[NoCoverage] BlockStatement
api-gateway/src/middlewares/base-proxy.middleware.ts:5:54
 import { createProxyMiddleware, Options } from 'http-proxy-middleware';
 import { Request, Response, NextFunction } from 'express';
 
-function handleProxyRequestBody(proxyReq, req): void {
-  if (req.method === 'POST' && req.body) {
-    const bodyData = JSON.stringify(req.body);
-
-    proxyReq.setHeader('Content-Length', Buffer.byteLength(bodyData));
-    proxyReq.setHeader('Content-Type', 'application/json');
-    proxyReq.write(bodyData);
-  }
-}
+function handleProxyRequestBody(proxyReq, req): void {}
 
 export abstract class ProxyMiddleware implements NestMiddleware {

[NoCoverage] LogicalOperator
api-gateway/src/middlewares/base-proxy.middleware.ts:6:7
 import { Request, Response, NextFunction } from 'express';
 
 function handleProxyRequestBody(proxyReq, req): void {
-  if (req.method === 'POST' && req.body) {
+  if (req.method === 'POST' || req.body) {
     const bodyData = JSON.stringify(req.body);
 

[NoCoverage] ConditionalExpression
api-gateway/src/middlewares/base-proxy.middleware.ts:6:7
 import { Request, Response, NextFunction } from 'express';
 
 function handleProxyRequestBody(proxyReq, req): void {
-  if (req.method === 'POST' && req.body) {
+  if (false) {
     const bodyData = JSON.stringify(req.body);
 

[NoCoverage] StringLiteral
api-gateway/src/middlewares/base-proxy.middleware.ts:10:40
     const bodyData = JSON.stringify(req.body);
 
     proxyReq.setHeader('Content-Length', Buffer.byteLength(bodyData));
-    proxyReq.setHeader('Content-Type', 'application/json');
+    proxyReq.setHeader('Content-Type', "");
     proxyReq.write(bodyData);
   }

[NoCoverage] StringLiteral
api-gateway/src/middlewares/base-proxy.middleware.ts:10:24
     const bodyData = JSON.stringify(req.body);
 
     proxyReq.setHeader('Content-Length', Buffer.byteLength(bodyData));
-    proxyReq.setHeader('Content-Type', 'application/json');
+    proxyReq.setHeader("", 'application/json');
     proxyReq.write(bodyData);
   }

[NoCoverage] BlockStatement
api-gateway/src/middlewares/base-proxy.middleware.ts:18:25
 export abstract class ProxyMiddleware implements NestMiddleware {
   protected abstract getOptions(): Options;
 
-  private createProxy() {
-    const options = this.getOptions();
-    return createProxyMiddleware({
-      ...options,
-      on: {
-        proxyReq: (proxyReq, req) => {
-          handleProxyRequestBody(proxyReq, req);
-        },
-      },
-    });
-  }
+  private createProxy() {}
 
   use(req: Request, res: Response, next: NextFunction) {

[NoCoverage] ObjectLiteral
api-gateway/src/middlewares/base-proxy.middleware.ts:20:34
 
   private createProxy() {
     const options = this.getOptions();
-    return createProxyMiddleware({
-      ...options,
-      on: {
-        proxyReq: (proxyReq, req) => {
-          handleProxyRequestBody(proxyReq, req);
-        },
-      },
-    });
+    return createProxyMiddleware({});
   }
 

[NoCoverage] BlockStatement
api-gateway/src/middlewares/base-proxy.middleware.ts:23:38
     return createProxyMiddleware({
       ...options,
       on: {
-        proxyReq: (proxyReq, req) => {
-          handleProxyRequestBody(proxyReq, req);
-        },
+        proxyReq: (proxyReq, req) => {},
       },
     });

[NoCoverage] BlockStatement
api-gateway/src/middlewares/base-proxy.middleware.ts:30:56
     });
   }
 
-  use(req: Request, res: Response, next: NextFunction) {
-    const proxy = this.createProxy();
-    proxy(req, res, next);
-  }
+  use(req: Request, res: Response, next: NextFunction) {}
 }
 
