[NoCoverage] BlockStatement
src/community-reports/exceptions/user-not-authorized.error.ts:12:17
 import { BaseDomainError } from '@common-lib/common-lib/core/exceptions/base-domain.error';
 
 export class UserNotAuthorizedError extends BaseDomainError {
-  constructor() {
-    super('Unauthorized access');
-  }
+  constructor() {}
 }
 

[NoCoverage] StringLiteral
src/community-reports/exceptions/user-not-authorized.error.ts:13:11
 
 export class UserNotAuthorizedError extends BaseDomainError {
   constructor() {
-    super('Unauthorized access');
+    super("");
   }
 }
