[NoCoverage] BlockStatement
src/auth/application/auth.controller.ts:23:72
   @Public()
   @HttpCode(HttpStatus.OK)
   @Post('login')
-  async signIn(@Body() signInDto: { email: string; password: string }) {
-    const token = await this.authService.signIn(
-      signInDto.email,
-      signInDto.password,
-    );
-    return token;
-  }
+  async signIn(@Body() signInDto: { email: string; password: string }) {}
 
   @Public()

[NoCoverage] BlockStatement
src/auth/application/auth.controller.ts:42:48
   @Public()
   @Get('github/callback')
   @UseGuards(AuthGuard('github'))
-  async githubCallback(@Req() req, @Res() res) {
-    // Generates the JWT token with the user's information
-    const token = await this.authService.signOauth2(req.user.email);
-    // Returns the JWT token as part of the response
-    return res.json({ token });
-  }
+  async githubCallback(@Req() req, @Res() res) {}
 }
 
