[NoCoverage] BlockStatement
api-gateway/src/middlewares/docs-proxy.middleware.ts:7:26
 
 @Injectable()
 export class DocsProxyMiddleware extends ProxyMiddleware {
-  protected getOptions() {
-    return {
-      target: envs.communitiesDocsUrl,
-      pathRewrite: {
-        '^/api/v1/doc/communities': '/',
-      },
-      changeOrigin: true,
-    };
-  }
+  protected getOptions() {}
 }
 

[NoCoverage] StringLiteral
api-gateway/src/middlewares/docs-proxy.middleware.ts:11:37
     return {
       target: envs.communitiesDocsUrl,
       pathRewrite: {
-        '^/api/v1/doc/communities': '/',
+        '^/api/v1/doc/communities': "",
       },
       changeOrigin: true,

[NoCoverage] BooleanLiteral
api-gateway/src/middlewares/docs-proxy.middleware.ts:13:21
       pathRewrite: {
         '^/api/v1/doc/communities': '/',
       },
-      changeOrigin: true,
+      changeOrigin: false,
     };
   }
