[NoCoverage] BlockStatement
src/auth/application/auth.service.impl.ts:18:40
   async signIn(
     email: string,
     password: string,
-  ): Promise<{ access_token: string }> {
-    try {
-      const user = await this.userService.getUserByEmail(email);
-      const isPasswordValid = await user.isValidPassword(password);
-
-      if (!isPasswordValid) {
-        throw new UnauthorizedException('Invalid password');
-      }
-
-      // Payload for the JWT
-      const payload = { sub: user.id, email: user.email, roles: user.role };
-      return {
-        access_token: await this.jwtService.signAsync(payload),
-      };
-    } catch (error) {
-      this.logger.error('Error signing in', error);
-      throw new UnauthorizedException('Invalid email');
-    }
-  }
+  ): Promise<{ access_token: string }> {}
 
   async signOauth2(email: string): Promise<{ access_token: string }> {

[NoCoverage] BlockStatement
src/auth/application/auth.service.impl.ts:19:9
     email: string,
     password: string,
   ): Promise<{ access_token: string }> {
-    try {
-      const user = await this.userService.getUserByEmail(email);
-      const isPasswordValid = await user.isValidPassword(password);
-
-      if (!isPasswordValid) {
-        throw new UnauthorizedException('Invalid password');
-      }
-
-      // Payload for the JWT
-      const payload = { sub: user.id, email: user.email, roles: user.role };
-      return {
-        access_token: await this.jwtService.signAsync(payload),
-      };
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error('Error signing in', error);
       throw new UnauthorizedException('Invalid email');

[NoCoverage] BlockStatement
src/auth/application/auth.service.impl.ts:23:29
       const user = await this.userService.getUserByEmail(email);
       const isPasswordValid = await user.isValidPassword(password);
 
-      if (!isPasswordValid) {
-        throw new UnauthorizedException('Invalid password');
-      }
+      if (!isPasswordValid) {}
 
       // Payload for the JWT

[NoCoverage] BlockStatement
src/auth/application/auth.service.impl.ts:32:21
       return {
         access_token: await this.jwtService.signAsync(payload),
       };
-    } catch (error) {
-      this.logger.error('Error signing in', error);
-      throw new UnauthorizedException('Invalid email');
-    }
+    } catch (error) {}
   }
 

[NoCoverage] StringLiteral
src/auth/application/auth.service.impl.ts:34:39
       };
     } catch (error) {
       this.logger.error('Error signing in', error);
-      throw new UnauthorizedException('Invalid email');
+      throw new UnauthorizedException("");
     }
   }

[NoCoverage] BlockStatement
src/auth/application/auth.service.impl.ts:38:70
     }
   }
 
-  async signOauth2(email: string): Promise<{ access_token: string }> {
-    try {
-      const user = await this.userService.getUserByEmail(email);
-
-      // Payload for the JWT
-      const payload = { sub: user.id, email: user.email, roles: user.role };
-
-      return {
-        access_token: await this.jwtService.signAsync(payload),
-      };
-    } catch (error) {
-      this.logger.error('Error signing in', error);
-      throw new UnauthorizedException('Email not registered');
-    }
-  }
+  async signOauth2(email: string): Promise<{ access_token: string }> {}
 }
 

[NoCoverage] BlockStatement
src/auth/application/auth.service.impl.ts:39:9
   }
 
   async signOauth2(email: string): Promise<{ access_token: string }> {
-    try {
-      const user = await this.userService.getUserByEmail(email);
-
-      // Payload for the JWT
-      const payload = { sub: user.id, email: user.email, roles: user.role };
-
-      return {
-        access_token: await this.jwtService.signAsync(payload),
-      };
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error('Error signing in', error);
       throw new UnauthorizedException('Email not registered');

[NoCoverage] BlockStatement
src/auth/application/auth.service.impl.ts:48:21
       return {
         access_token: await this.jwtService.signAsync(payload),
       };
-    } catch (error) {
-      this.logger.error('Error signing in', error);
-      throw new UnauthorizedException('Email not registered');
-    }
+    } catch (error) {}
   }
 }
