[NoCoverage] BlockStatement
api-gateway/src/middlewares/statistics-proxy.middleware.ts:7:26
 
 @Injectable()
 export class StatisticsProxyMiddleware extends ProxyMiddleware {
-  protected getOptions() {
-    return {
-      target: envs.statisticsMsUrl,
-      pathRewrite: { '^/api/v1/statistics': '/' },
-      changeOrigin: true,
-    };
-  }
+  protected getOptions() {}
 }
 

[NoCoverage] ObjectLiteral
api-gateway/src/middlewares/statistics-proxy.middleware.ts:10:20
   protected getOptions() {
     return {
       target: envs.statisticsMsUrl,
-      pathRewrite: { '^/api/v1/statistics': '/' },
+      pathRewrite: {},
       changeOrigin: true,
     };

[NoCoverage] BooleanLiteral
api-gateway/src/middlewares/statistics-proxy.middleware.ts:11:21
     return {
       target: envs.statisticsMsUrl,
       pathRewrite: { '^/api/v1/statistics': '/' },
-      changeOrigin: true,
+      changeOrigin: false,
     };
   }
