[NoCoverage] StringLiteral
src/auth/infra/github.strategy.ts:14:41
 
 @Injectable()
 export class GithubStrategy extends PassportStrategy(Strategy, 'github') {
-  private readonly githubApiEmailsUrl = 'https://api.github.com/user/emails';
+  private readonly githubApiEmailsUrl = "";
 
   constructor() {

[NoCoverage] ObjectLiteral
src/auth/infra/github.strategy.ts:17:11
   private readonly githubApiEmailsUrl = 'https://api.github.com/user/emails';
 
   constructor() {
-    super({
-      clientID: envs.githubClientId,
-      clientSecret: envs.githubClientSecret,
-      callbackURL: envs.githubCallbackUrl,
-      scope: ['user:email'],
-    });
+    super({});
   }
 

[NoCoverage] StringLiteral
src/auth/infra/github.strategy.ts:21:15
       clientID: envs.githubClientId,
       clientSecret: envs.githubClientSecret,
       callbackURL: envs.githubCallbackUrl,
-      scope: ['user:email'],
+      scope: [""],
     });
   }

[NoCoverage] EqualityOperator
src/auth/infra/github.strategy.ts:33:27
   ) {
     const { emails } = profile;
 
-    let email = emails && emails.length > 0 ? emails[0].value : null;
+    let email = emails && emails.length <= 0 ? emails[0].value : null;
 
     if (!email) {

[NoCoverage] ConditionalExpression
src/auth/infra/github.strategy.ts:33:17
   ) {
     const { emails } = profile;
 
-    let email = emails && emails.length > 0 ? emails[0].value : null;
+    let email = true ? emails[0].value : null;
 
     if (!email) {

[NoCoverage] BlockStatement
src/auth/infra/github.strategy.ts:35:17
 
     let email = emails && emails.length > 0 ? emails[0].value : null;
 
-    if (!email) {
-      const emailData = await axios.get(this.githubApiEmailsUrl, {
-        headers: {
-          Authorization: `Bearer ${accessToken}`,
-        },
-      });
-
-      // Find the primary email in the list
-      const primaryEmail = emailData.data.find((e) => e.primary && e.verified);
-      if (primaryEmail) {
-        email = primaryEmail.email;
-      }
-    }
+    if (!email) {}
 
     if (!email) {

[NoCoverage] ObjectLiteral
src/auth/infra/github.strategy.ts:36:66
     let email = emails && emails.length > 0 ? emails[0].value : null;
 
     if (!email) {
-      const emailData = await axios.get(this.githubApiEmailsUrl, {
-        headers: {
-          Authorization: `Bearer ${accessToken}`,
-        },
-      });
+      const emailData = await axios.get(this.githubApiEmailsUrl, {});
 
       // Find the primary email in the list

[NoCoverage] StringLiteral
src/auth/infra/github.strategy.ts:38:26
     if (!email) {
       const emailData = await axios.get(this.githubApiEmailsUrl, {
         headers: {
-          Authorization: `Bearer ${accessToken}`,
+          Authorization: ``,
         },
       });

[NoCoverage] ArrowFunction
src/auth/infra/github.strategy.ts:43:48
       });
 
       // Find the primary email in the list
-      const primaryEmail = emailData.data.find((e) => e.primary && e.verified);
+      const primaryEmail = emailData.data.find(() => undefined);
       if (primaryEmail) {
         email = primaryEmail.email;

[NoCoverage] ConditionalExpression
src/auth/infra/github.strategy.ts:43:55
       });
 
       // Find the primary email in the list
-      const primaryEmail = emailData.data.find((e) => e.primary && e.verified);
+      const primaryEmail = emailData.data.find((e) => false);
       if (primaryEmail) {
         email = primaryEmail.email;

[NoCoverage] BlockStatement
src/auth/infra/github.strategy.ts:44:25
 
       // Find the primary email in the list
       const primaryEmail = emailData.data.find((e) => e.primary && e.verified);
-      if (primaryEmail) {
-        email = primaryEmail.email;
-      }
+      if (primaryEmail) {}
     }
 

[NoCoverage] ConditionalExpression
src/auth/infra/github.strategy.ts:44:11
 
       // Find the primary email in the list
       const primaryEmail = emailData.data.find((e) => e.primary && e.verified);
-      if (primaryEmail) {
+      if (true) {
         email = primaryEmail.email;
       }

[NoCoverage] BlockStatement
src/auth/infra/github.strategy.ts:49:17
       }
     }
 
-    if (!email) {
-      return done(new Error('GitHub account does not provide an email'), null);
-    }
+    if (!email) {}
 
     const user: GithubUser = {

[NoCoverage] StringLiteral
src/auth/infra/github.strategy.ts:50:29
     }
 
     if (!email) {
-      return done(new Error('GitHub account does not provide an email'), null);
+      return done(new Error(""), null);
     }
 
