[NoCoverage] BlockStatement
api-gateway/src/middlewares/users-proxy.middleware.ts:8:35
 
 @Injectable()
 export class UsersProxyMiddleware extends ProxyMiddleware {
-  protected getOptions(): Options {
-    return {
-      target: envs.usersMsUrl,
-      pathRewrite: { '^/api/v1/users': '/' },
-      changeOrigin: true,
-    };
-  }
+  protected getOptions(): Options {}
 }
 

[NoCoverage] BooleanLiteral
api-gateway/src/middlewares/users-proxy.middleware.ts:12:21
     return {
       target: envs.usersMsUrl,
       pathRewrite: { '^/api/v1/users': '/' },
-      changeOrigin: true,
+      changeOrigin: false,
     };
   }
