[Killed] BlockStatement
src/users/domain/Password.ts:14:49
 }
 
 export class UserPassword extends ValueObject<UserpasswordProps> {
-  private constructor(props: UserpasswordProps) {
-    super(props);
-  }
+  private constructor(props: UserpasswordProps) {}
 
   get value(): string {
killedBy: UserServiceImpl createUser creates a new user successfully and returns its ID
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/users/domain/Password.ts:18:23
     super(props);
   }
 
-  get value(): string {
-    return this.props.password;
-  }
+  get value(): string {}
 
   public static async create(value: string): Promise<UserPassword> {
killedBy: UserServiceImpl createUser creates a new user successfully and returns its ID
statusReason: InvalidPasswordError: The password must be longer than 8 characters and contain at least one symbol, one uppercase letter, one lowercase letter, and one number.

[Killed] BlockStatement
src/users/domain/Password.ts:22:68
     return this.props.password;
   }
 
-  public static async create(value: string): Promise<UserPassword> {
-    if (!PASSWORD_PATTERN.test(value)) {
-      throw new InvalidPasswordError();
-    }
-
-    const hashedPassword = await bcrypt.hash(value, PASSWORD_HASH_SALT_ROUNDS);
-    return new UserPassword({ password: hashedPassword });
-  }
+  public static async create(value: string): Promise<UserPassword> {}
 
   public static fromHashedPassword(value: string): UserPassword {
killedBy: UserServiceImpl createUser creates a new user successfully and returns its ID
statusReason: MissingPropertiesError: [User] Missing properties to create a new user.

[Killed] BlockStatement
src/users/domain/Password.ts:23:40
   }
 
   public static async create(value: string): Promise<UserPassword> {
-    if (!PASSWORD_PATTERN.test(value)) {
-      throw new InvalidPasswordError();
-    }
+    if (!PASSWORD_PATTERN.test(value)) {}
 
     const hashedPassword = await bcrypt.hash(value, PASSWORD_HASH_SALT_ROUNDS);
killedBy: UserServiceImpl createUser validates password requirements during user creation
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: InvalidPasswordError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'id')"

      109 |       user.commit();

[Killed] BooleanLiteral
src/users/domain/Password.ts:23:9
   }
 
   public static async create(value: string): Promise<UserPassword> {
-    if (!PASSWORD_PATTERN.test(value)) {
+    if (PASSWORD_PATTERN.test(value)) {
       throw new InvalidPasswordError();
     }
killedBy: UserServiceImpl createUser creates a new user successfully and returns its ID
statusReason: InvalidPasswordError: The password must be longer than 8 characters and contain at least one symbol, one uppercase letter, one lowercase letter, and one number.

[Killed] ObjectLiteral
src/users/domain/Password.ts:28:29
     }
 
     const hashedPassword = await bcrypt.hash(value, PASSWORD_HASH_SALT_ROUNDS);
-    return new UserPassword({ password: hashedPassword });
+    return new UserPassword({});
   }
 
killedBy: UserServiceImpl createUser creates a new user successfully and returns its ID
statusReason: InvalidPasswordError: The password must be longer than 8 characters and contain at least one symbol, one uppercase letter, one lowercase letter, and one number.

[NoCoverage] BlockStatement
src/users/domain/Password.ts:31:65
     return new UserPassword({ password: hashedPassword });
   }
 
-  public static fromHashedPassword(value: string): UserPassword {
-    return new UserPassword({ password: value });
-  }
+  public static fromHashedPassword(value: string): UserPassword {}
 
   public async compare(password: string): Promise<boolean> {

[NoCoverage] BlockStatement
src/users/domain/Password.ts:35:60
     return new UserPassword({ password: value });
   }
 
-  public async compare(password: string): Promise<boolean> {
-    return bcrypt.compare(password, this.value);
-  }
+  public async compare(password: string): Promise<boolean> {}
 }
 
