[NoCoverage] BlockStatement
src/actions/application/action.controller.ts:40:20
     @Query() query: FindActionsDto,
     @Req() req: Request,
     @Res() res: Response,
-  ): Promise<void> {
-    const { name, status, sortBy, sortDirection, page, limit } = query;
-
-    const { data, total } = await this.actionService.getAllActions(
-      name,
-      status,
-      sortBy,
-      sortDirection,
-      page,
-      limit,
-    );
-
-    // Build the base URL for the paginated response
-    const baseUrl = `${req.protocol}://${req.get('host')}${req.path}`;
-
-    const response = new PaginatedResponseDto(
-      data.map(Mapper.ActionMapper.toDTO),
-      total,
-      page,
-      limit,
-      baseUrl,
-    );
-
-    res.status(HttpStatus.OK).json(response);
-  }
+  ): Promise<void> {}
 
   @ApiOperation({ summary: 'Get details of a specific action by id' })

[NoCoverage] StringLiteral
src/actions/application/action.controller.ts:53:50
     );
 
     // Build the base URL for the paginated response
-    const baseUrl = `${req.protocol}://${req.get('host')}${req.path}`;
+    const baseUrl = `${req.protocol}://${req.get("")}${req.path}`;
 
     const response = new PaginatedResponseDto(

[NoCoverage] BlockStatement
src/actions/application/action.controller.ts:69:79
   @ApiOperation({ summary: 'Get details of a specific action by id' })
   @Public()
   @Get(':id')
-  async findOne(@Param('id', ParseUUIDPipe) id: string, @Res() res: Response) {
-    const action = await this.actionService.getActionDetails(id);
-
-    const actionDto = Mapper.ActionMapper.toDTO(action);
-    res.status(HttpStatus.OK).json(actionDto);
-  }
+  async findOne(@Param('id', ParseUUIDPipe) id: string, @Res() res: Response) {}
 
   @ApiExcludeEndpoint()

[NoCoverage] BlockStatement
src/actions/application/action.controller.ts:82:5
     @Param('id', ParseUUIDPipe) id: string,
     @Body() updateActionDto: UpdateActionDto,
     @Res() res: Response,
-  ) {
-    const { title, description, target } = updateActionDto;
-
-    await this.actionService.updateAction(id, title, description, target);
-    const locationUrl = `/actions/${id}`;
-    res.status(HttpStatus.NO_CONTENT).location(locationUrl).send();
-  }
+  ) {}
 
   @ApiExcludeEndpoint()

[NoCoverage] BlockStatement
src/actions/application/action.controller.ts:97:5
     @Body() contributionDto: CreateContributionDto,
     @GetUserId() userId: string,
     @Res() res: Response,
-  ) {
-    const { date, amount, unit } = contributionDto;
-
-    const result = await this.actionService.makeContribution(
-      userId,
-      actionId,
-      date,
-      amount,
-      unit,
-    );
-
-    const locationUrl = `/actions/${actionId}/contributions/${result}`;
-    res.status(HttpStatus.CREATED).location(locationUrl).json({ id: result });
-  }
+  ) {}
 
   @ApiExcludeEndpoint()

[NoCoverage] ObjectLiteral
src/actions/application/action.controller.ts:109:63
     );
 
     const locationUrl = `/actions/${actionId}/contributions/${result}`;
-    res.status(HttpStatus.CREATED).location(locationUrl).json({ id: result });
+    res.status(HttpStatus.CREATED).location(locationUrl).json({});
   }
 

[NoCoverage] BlockStatement
src/actions/application/action.controller.ts:119:5
     @Query() queryPagination: QueryPaginationDto,
     @Req() req: Request,
     @Res() res: Response,
-  ) {
-    const { page, limit } = queryPagination;
-
-    const { data, total } = await this.actionService.getContributions(
-      actionId,
-      page,
-      limit,
-    );
-
-    // Build the base URL for the paginated response
-    const baseUrl = `${req.protocol}://${req.get('host')}${req.path}`;
-
-    // Create the paginated response
-    const response = new PaginatedResponseDto(
-      data.map(Mapper.ContributionMapper.toDTO),
-      total,
-      page,
-      limit,
-      baseUrl,
-    );
-
-    // Send the response
-    res.status(HttpStatus.OK).json(response);
-  }
+  ) {}
 }
 
