[Killed] BlockStatement
src/users/exceptions/invalid-password.error.ts:4:17
 import { BaseDomainError } from '@common-lib/common-lib/core/exceptions/base-domain.error';
 
 export class InvalidPasswordError extends BaseDomainError {
-  constructor() {
-    super(
-      'The password must be longer than 8 characters and contain at least one symbol, one uppercase letter, one lowercase letter, and one number.',
-    );
-  }
+  constructor() {}
 }
 
killedBy: UserServiceImpl createUser validates password requirements during user creation
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: InvalidPasswordError
Received constructor: ReferenceError

Received message: "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      53 |     } else {
