[NoCoverage] ObjectLiteral
src/auth/application/auth.controller.ts:48:21
     // Generates the JWT token with the user's information
     const token = await this.authService.signOauth2(req.user.email);
     // Returns the JWT token as part of the response
-    return res.json({ token });
+    return res.json({});
   }
 }
