[NoCoverage] ConditionalExpression
src/actions/application/action.service.impl.ts:37:9
   ): Promise<string> {
     // Check for duplicate
     const isDuplicate = await this.duplicateCheck(causeId, title);
-    if (isDuplicate) {
+    if (false) {
       throw new Exceptions.ActionTitleConflictError(title);
     }

[NoCoverage] BlockStatement
src/actions/application/action.service.impl.ts:37:22
   ): Promise<string> {
     // Check for duplicate
     const isDuplicate = await this.duplicateCheck(causeId, title);
-    if (isDuplicate) {
-      throw new Exceptions.ActionTitleConflictError(title);
-    }
+    if (isDuplicate) {}
 
     // Create the new action

[NoCoverage] BlockStatement
src/actions/application/action.service.impl.ts:70:20
     title?: string,
     description?: string,
     target?: number,
-  ): Promise<void> {
-    // Find the existing action by Id
-    const action = await this.actionRepository.findById(id);
-
-    // Update action fields
-    action.update(title, description, target);
-
-    // Update the action in the repository
-    await this.actionRepository.save(action);
-  }
+  ): Promise<void> {}
 
   async getActionDetails(id: string): Promise<Domain.Action> {

[NoCoverage] BlockStatement
src/actions/application/action.service.impl.ts:81:62
     await this.actionRepository.save(action);
   }
 
-  async getActionDetails(id: string): Promise<Domain.Action> {
-    // Find the action by Id
-    const action = await this.actionRepository.findById(id);
-
-    return action;
-  }
+  async getActionDetails(id: string): Promise<Domain.Action> {}
 
   async getAllActions(

[NoCoverage] BlockStatement
src/actions/application/action.service.impl.ts:95:56
     sortDirection: SortDirection = SortDirection.ASC,
     page: number = PaginationDefaults.DEFAULT_PAGE,
     limit: number = PaginationDefaults.DEFAULT_LIMIT,
-  ): Promise<{ data: Domain.Action[]; total: number }> {
-    const queryBuilder = new ActionQueryBuilder()
-      .addNameFilter(nameFilter)
-      .addStatusFilter(statusFilter)
-      .addSort(sortBy, sortDirection)
-      .addPagination(page, limit);
-
-    const filters = queryBuilder.buildFilter();
-    const sort = queryBuilder.buildSort();
-    const pagination = queryBuilder.buildPagination();
-
-    // Use Promise.all to execute both queries in parallel
-    const [data, total] = await Promise.all([
-      this.actionRepository.findAll(filters, sort, pagination), // Get paginated data
-      this.actionRepository.countDocuments(filters), // Count total documents
-    ]);
-
-    return {
-      data,
-      total,
-    };
-  }
+  ): Promise<{ data: Domain.Action[]; total: number }> {}
 
   async duplicateCheck(causeId: string, title: string): Promise<boolean> {

[NoCoverage] ArrayDeclaration
src/actions/application/action.service.impl.ts:107:45
     const pagination = queryBuilder.buildPagination();
 
     // Use Promise.all to execute both queries in parallel
-    const [data, total] = await Promise.all([
-      this.actionRepository.findAll(filters, sort, pagination), // Get paginated data
-      this.actionRepository.countDocuments(filters), // Count total documents
-    ]);
+    const [data, total] = await Promise.all([]);
 
     return {

[NoCoverage] BlockStatement
src/actions/application/action.service.impl.ts:118:74
     };
   }
 
-  async duplicateCheck(causeId: string, title: string): Promise<boolean> {
-    // Check if an action with the same title already exists for the cause
-    const existingActions = await this.actionRepository.findByCauseId(causeId);
-    const actionWithTitle = existingActions.find(
-      (action) =>
-        action.title === title &&
-        action.status !== Domain.ActionStatus.COMPLETED,
-    );
-
-    return !!actionWithTitle;
-  }
+  async duplicateCheck(causeId: string, title: string): Promise<boolean> {}
 
   async makeContribution(

[NoCoverage] ArrowFunction
src/actions/application/action.service.impl.ts:122:7
     // Check if an action with the same title already exists for the cause
     const existingActions = await this.actionRepository.findByCauseId(causeId);
     const actionWithTitle = existingActions.find(
-      (action) =>
-        action.title === title &&
-        action.status !== Domain.ActionStatus.COMPLETED,
+      () => undefined,
     );
 

[NoCoverage] LogicalOperator
src/actions/application/action.service.impl.ts:123:9
     const existingActions = await this.actionRepository.findByCauseId(causeId);
     const actionWithTitle = existingActions.find(
       (action) =>
-        action.title === title &&
-        action.status !== Domain.ActionStatus.COMPLETED,
+        action.title === title || action.status !== Domain.ActionStatus.COMPLETED,
     );
 

[NoCoverage] EqualityOperator
src/actions/application/action.service.impl.ts:123:9
     const existingActions = await this.actionRepository.findByCauseId(causeId);
     const actionWithTitle = existingActions.find(
       (action) =>
-        action.title === title &&
+        action.title !== title &&
         action.status !== Domain.ActionStatus.COMPLETED,
     );

[NoCoverage] ConditionalExpression
src/actions/application/action.service.impl.ts:124:9
     const actionWithTitle = existingActions.find(
       (action) =>
         action.title === title &&
-        action.status !== Domain.ActionStatus.COMPLETED,
+        true,
     );
 

[NoCoverage] EqualityOperator
src/actions/application/action.service.impl.ts:124:9
     const actionWithTitle = existingActions.find(
       (action) =>
         action.title === title &&
-        action.status !== Domain.ActionStatus.COMPLETED,
+        action.status === Domain.ActionStatus.COMPLETED,
     );
 

[NoCoverage] BooleanLiteral
src/actions/application/action.service.impl.ts:127:12
         action.status !== Domain.ActionStatus.COMPLETED,
     );
 
-    return !!actionWithTitle;
+    return !actionWithTitle;
   }
 

[NoCoverage] BlockStatement
src/actions/application/action.service.impl.ts:136:22
     date: Date,
     amount: number,
     unit: string,
-  ): Promise<string> {
-    // Find the action by Id
-    const action = this.eventPublisher.mergeObjectContext(
-      await this.actionRepository.findById(actionId),
-    );
-
-    const contributionId = action.contribute(userId, date, amount, unit);
-    await this.actionRepository.save(action);
-
-    action.commit();
-    return contributionId;
-  }
+  ): Promise<string> {}
 
   async getContributions(

[NoCoverage] BlockStatement
src/actions/application/action.service.impl.ts:153:62
     id: string,
     page: number = PaginationDefaults.DEFAULT_PAGE,
     limit: number = PaginationDefaults.DEFAULT_LIMIT,
-  ): Promise<{ data: Domain.Contribution[]; total: number }> {
-    // Find the action by Id
-    const action = await this.actionRepository.findById(id);
-
-    // Validate page and limit
-    const validatedPage = Math.max(page, 1);
-    const validatedLimit = Math.max(limit, 1);
-
-    // Calculate the total number of contributions and the data to return
-    const total = action.contributions.length;
-    const skip = (validatedPage - 1) * validatedLimit;
-    const data = action.contributions.slice(skip, skip + validatedLimit);
-
-    return { data, total };
-  }
+  ): Promise<{ data: Domain.Contribution[]; total: number }> {}
 }
 

[NoCoverage] MethodExpression
src/actions/application/action.service.impl.ts:158:27
     const action = await this.actionRepository.findById(id);
 
     // Validate page and limit
-    const validatedPage = Math.max(page, 1);
+    const validatedPage = Math.min(page, 1);
     const validatedLimit = Math.max(limit, 1);
 

[NoCoverage] MethodExpression
src/actions/application/action.service.impl.ts:159:28
 
     // Validate page and limit
     const validatedPage = Math.max(page, 1);
-    const validatedLimit = Math.max(limit, 1);
+    const validatedLimit = Math.min(limit, 1);
 
     // Calculate the total number of contributions and the data to return

[NoCoverage] ArithmeticOperator
src/actions/application/action.service.impl.ts:163:18
 
     // Calculate the total number of contributions and the data to return
     const total = action.contributions.length;
-    const skip = (validatedPage - 1) * validatedLimit;
+    const skip = (validatedPage - 1) / validatedLimit;
     const data = action.contributions.slice(skip, skip + validatedLimit);
 

[NoCoverage] ArithmeticOperator
src/actions/application/action.service.impl.ts:163:19
 
     // Calculate the total number of contributions and the data to return
     const total = action.contributions.length;
-    const skip = (validatedPage - 1) * validatedLimit;
+    const skip = (validatedPage + 1) * validatedLimit;
     const data = action.contributions.slice(skip, skip + validatedLimit);
 

[NoCoverage] MethodExpression
src/actions/application/action.service.impl.ts:164:18
     // Calculate the total number of contributions and the data to return
     const total = action.contributions.length;
     const skip = (validatedPage - 1) * validatedLimit;
-    const data = action.contributions.slice(skip, skip + validatedLimit);
+    const data = action.contributions;
 
     return { data, total };

[NoCoverage] ArithmeticOperator
src/actions/application/action.service.impl.ts:164:51
     // Calculate the total number of contributions and the data to return
     const total = action.contributions.length;
     const skip = (validatedPage - 1) * validatedLimit;
-    const data = action.contributions.slice(skip, skip + validatedLimit);
+    const data = action.contributions.slice(skip, skip - validatedLimit);
 
     return { data, total };

[NoCoverage] ObjectLiteral
src/actions/application/action.service.impl.ts:166:12
     const skip = (validatedPage - 1) * validatedLimit;
     const data = action.contributions.slice(skip, skip + validatedLimit);
 
-    return { data, total };
+    return {};
   }
 }
