[NoCoverage] BlockStatement
src/actions/domain/Action.ts:26:66
 }
 
 export abstract class Action extends EntityRoot<ActionProps> {
-  protected constructor(props: ActionProps, id?: UniqueEntityID) {
-    super(props, id);
-    this.props.status = props.status || ActionStatus.PENDING;
-    this.props.contributions = props.contributions || [];
-    this.props.achieved = props.achieved ?? 0;
-    this.props.createdAt = props.createdAt ?? new Date();
-    this.props.updatedAt = props.updatedAt ?? new Date();
-  }
+  protected constructor(props: ActionProps, id?: UniqueEntityID) {}
 
   get id(): UniqueEntityID {

[NoCoverage] ConditionalExpression
src/actions/domain/Action.ts:28:25
 export abstract class Action extends EntityRoot<ActionProps> {
   protected constructor(props: ActionProps, id?: UniqueEntityID) {
     super(props, id);
-    this.props.status = props.status || ActionStatus.PENDING;
+    this.props.status = false;
     this.props.contributions = props.contributions || [];
     this.props.achieved = props.achieved ?? 0;

[NoCoverage] LogicalOperator
src/actions/domain/Action.ts:28:25
 export abstract class Action extends EntityRoot<ActionProps> {
   protected constructor(props: ActionProps, id?: UniqueEntityID) {
     super(props, id);
-    this.props.status = props.status || ActionStatus.PENDING;
+    this.props.status = props.status && ActionStatus.PENDING;
     this.props.contributions = props.contributions || [];
     this.props.achieved = props.achieved ?? 0;

[NoCoverage] LogicalOperator
src/actions/domain/Action.ts:29:32
   protected constructor(props: ActionProps, id?: UniqueEntityID) {
     super(props, id);
     this.props.status = props.status || ActionStatus.PENDING;
-    this.props.contributions = props.contributions || [];
+    this.props.contributions = props.contributions && [];
     this.props.achieved = props.achieved ?? 0;
     this.props.createdAt = props.createdAt ?? new Date();

[NoCoverage] ConditionalExpression
src/actions/domain/Action.ts:29:32
   protected constructor(props: ActionProps, id?: UniqueEntityID) {
     super(props, id);
     this.props.status = props.status || ActionStatus.PENDING;
-    this.props.contributions = props.contributions || [];
+    this.props.contributions = true;
     this.props.achieved = props.achieved ?? 0;
     this.props.createdAt = props.createdAt ?? new Date();

[NoCoverage] LogicalOperator
src/actions/domain/Action.ts:30:27
     super(props, id);
     this.props.status = props.status || ActionStatus.PENDING;
     this.props.contributions = props.contributions || [];
-    this.props.achieved = props.achieved ?? 0;
+    this.props.achieved = props.achieved && 0;
     this.props.createdAt = props.createdAt ?? new Date();
     this.props.updatedAt = props.updatedAt ?? new Date();

[NoCoverage] LogicalOperator
src/actions/domain/Action.ts:31:28
     this.props.status = props.status || ActionStatus.PENDING;
     this.props.contributions = props.contributions || [];
     this.props.achieved = props.achieved ?? 0;
-    this.props.createdAt = props.createdAt ?? new Date();
+    this.props.createdAt = props.createdAt && new Date();
     this.props.updatedAt = props.updatedAt ?? new Date();
   }

[NoCoverage] LogicalOperator
src/actions/domain/Action.ts:32:28
     this.props.contributions = props.contributions || [];
     this.props.achieved = props.achieved ?? 0;
     this.props.createdAt = props.createdAt ?? new Date();
-    this.props.updatedAt = props.updatedAt ?? new Date();
+    this.props.updatedAt = props.updatedAt && new Date();
   }
 

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:35:28
     this.props.updatedAt = props.updatedAt ?? new Date();
   }
 
-  get id(): UniqueEntityID {
-    return this._id;
-  }
+  get id(): UniqueEntityID {}
 
   get title(): string {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:39:23
     return this._id;
   }
 
-  get title(): string {
-    return this.props.title;
-  }
+  get title(): string {}
 
   get description(): string {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:43:29
     return this.props.title;
   }
 
-  get description(): string {
-    return this.props.description;
-  }
+  get description(): string {}
 
   get causeId(): string {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:47:25
     return this.props.description;
   }
 
-  get causeId(): string {
-    return this.props.causeId;
-  }
+  get causeId(): string {}
 
   get type(): ActionType {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:51:26
     return this.props.causeId;
   }
 
-  get type(): ActionType {
-    return this.props.type;
-  }
+  get type(): ActionType {}
 
   set type(value: ActionType) {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:55:31
     return this.props.type;
   }
 
-  set type(value: ActionType) {
-    this.props.type = value;
-  }
+  set type(value: ActionType) {}
 
   get status(): ActionStatus {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:59:30
     this.props.type = value;
   }
 
-  get status(): ActionStatus {
-    return this.props.status;
-  }
+  get status(): ActionStatus {}
 
   set status(value: ActionStatus) {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:63:35
     return this.props.status;
   }
 
-  set status(value: ActionStatus) {
-    this.props.status = value;
-  }
+  set status(value: ActionStatus) {}
 
   get contributions(): Contribution[] {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:67:39
     this.props.status = value;
   }
 
-  get contributions(): Contribution[] {
-    return [...this.props.contributions];
-  }
+  get contributions(): Contribution[] {}
 
   get target(): number {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:71:24
     return [...this.props.contributions];
   }
 
-  get target(): number {
-    return this.props.target;
-  }
+  get target(): number {}
 
   get unit(): string {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:75:22
     return this.props.target;
   }
 
-  get unit(): string {
-    return this.props.unit;
-  }
+  get unit(): string {}
 
   set unit(value: string) {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:79:27
     return this.props.unit;
   }
 
-  set unit(value: string) {
-    this.props.unit = value;
-  }
+  set unit(value: string) {}
 
   get achieved(): number {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:83:26
     this.props.unit = value;
   }
 
-  get achieved(): number {
-    return this.props.achieved;
-  }
+  get achieved(): number {}
 
   set achieved(value: number) {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:87:31
     return this.props.achieved;
   }
 
-  set achieved(value: number) {
-    this.props.achieved = value;
-  }
+  set achieved(value: number) {}
 
   get createdBy(): string {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:91:27
     this.props.achieved = value;
   }
 
-  get createdBy(): string {
-    return this.props.createdBy;
-  }
+  get createdBy(): string {}
 
   get createdAt(): Date {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:95:25
     return this.props.createdBy;
   }
 
-  get createdAt(): Date {
-    return this.props.createdAt;
-  }
+  get createdAt(): Date {}
 
   get communityId(): string {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:99:29
     return this.props.createdAt;
   }
 
-  get communityId(): string {
-    return this.props.communityId;
-  }
+  get communityId(): string {}
 
   get updatedAt(): Date {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:103:25
     return this.props.communityId;
   }
 
-  get updatedAt(): Date {
-    return this.props.updatedAt;
-  }
+  get updatedAt(): Date {}
 
   addContribution(contribution: Contribution) {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:107:47
     return this.props.updatedAt;
   }
 
-  addContribution(contribution: Contribution) {
-    this.props.contributions.push(contribution);
-  }
+  addContribution(contribution: Contribution) {}
 
   update(title?: string, description?: string, target?: number): void {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:111:71
     this.props.contributions.push(contribution);
   }
 
-  update(title?: string, description?: string, target?: number): void {
-    if (title !== undefined) {
-      this.props.title = title;
-    }
-    if (description !== undefined) {
-      this.props.description = description;
-    }
-    if (target !== undefined) {
-      this.props.target = target;
-    }
-  }
+  update(title?: string, description?: string, target?: number): void {}
 
   getProgress(): number {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:112:30
   }
 
   update(title?: string, description?: string, target?: number): void {
-    if (title !== undefined) {
-      this.props.title = title;
-    }
+    if (title !== undefined) {}
     if (description !== undefined) {
       this.props.description = description;

[NoCoverage] EqualityOperator
src/actions/domain/Action.ts:112:9
   }
 
   update(title?: string, description?: string, target?: number): void {
-    if (title !== undefined) {
+    if (title === undefined) {
       this.props.title = title;
     }

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:115:36
     if (title !== undefined) {
       this.props.title = title;
     }
-    if (description !== undefined) {
-      this.props.description = description;
-    }
+    if (description !== undefined) {}
     if (target !== undefined) {
       this.props.target = target;

[NoCoverage] ConditionalExpression
src/actions/domain/Action.ts:115:9
     if (title !== undefined) {
       this.props.title = title;
     }
-    if (description !== undefined) {
+    if (false) {
       this.props.description = description;
     }

[NoCoverage] EqualityOperator
src/actions/domain/Action.ts:118:9
     if (description !== undefined) {
       this.props.description = description;
     }
-    if (target !== undefined) {
+    if (target === undefined) {
       this.props.target = target;
     }

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:118:31
     if (description !== undefined) {
       this.props.description = description;
     }
-    if (target !== undefined) {
-      this.props.target = target;
-    }
+    if (target !== undefined) {}
   }
 

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:123:25
     }
   }
 
-  getProgress(): number {
-    return (this.achieved / this.target) * 100;
-  }
+  getProgress(): number {}
 
   contribute(userId: string, date: Date, amount: number, unit: string): string {

[NoCoverage] ArithmeticOperator
src/actions/domain/Action.ts:124:13
   }
 
   getProgress(): number {
-    return (this.achieved / this.target) * 100;
+    return (this.achieved * this.target) * 100;
   }
 

[NoCoverage] ArithmeticOperator
src/actions/domain/Action.ts:124:12
   }
 
   getProgress(): number {
-    return (this.achieved / this.target) * 100;
+    return this.achieved / this.target / 100;
   }
 

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:127:80
     return (this.achieved / this.target) * 100;
   }
 
-  contribute(userId: string, date: Date, amount: number, unit: string): string {
-    const actionId = this.id.toString();
-    this.validateContribution(actionId, unit);
-
-    const contribution = this.createContribution(
-      userId,
-      actionId,
-      date,
-      amount,
-      unit,
-    );
-    this.processContribution(contribution);
-    this.publishContributionEvent(contribution, actionId);
-    return contribution.id.toString();
-  }
+  contribute(userId: string, date: Date, amount: number, unit: string): string {}
 
   private validateContribution(actionId: string, unit: string): void {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:143:70
     return contribution.id.toString();
   }
 
-  private validateContribution(actionId: string, unit: string): void {
-    if (this.unit !== unit) {
-      throw new Exceptions.InvalidContributionUnitError(
-        actionId,
-        unit,
-        this.unit,
-      );
-    }
-
-    if (this.status === ActionStatus.COMPLETED) {
-      throw new Exceptions.CompletedActionError(actionId);
-    }
-  }
+  private validateContribution(actionId: string, unit: string): void {}
 
   private createContribution(

[NoCoverage] ConditionalExpression
src/actions/domain/Action.ts:144:9
   }
 
   private validateContribution(actionId: string, unit: string): void {
-    if (this.unit !== unit) {
+    if (false) {
       throw new Exceptions.InvalidContributionUnitError(
         actionId,

[NoCoverage] ConditionalExpression
src/actions/domain/Action.ts:144:9
   }
 
   private validateContribution(actionId: string, unit: string): void {
-    if (this.unit !== unit) {
+    if (true) {
       throw new Exceptions.InvalidContributionUnitError(
         actionId,

[NoCoverage] EqualityOperator
src/actions/domain/Action.ts:152:9
       );
     }
 
-    if (this.status === ActionStatus.COMPLETED) {
+    if (this.status !== ActionStatus.COMPLETED) {
       throw new Exceptions.CompletedActionError(actionId);
     }

[NoCoverage] ConditionalExpression
src/actions/domain/Action.ts:152:9
       );
     }
 
-    if (this.status === ActionStatus.COMPLETED) {
+    if (false) {
       throw new Exceptions.CompletedActionError(actionId);
     }

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:163:19
     date: Date,
     amount: number,
     unit: string,
-  ): Contribution {
-    return Contribution.create({
-      userId,
-      actionId,
-      date,
-      amount,
-      unit,
-    });
-  }
+  ): Contribution {}
 
   private processContribution(contribution: Contribution): void {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:173:65
     });
   }
 
-  private processContribution(contribution: Contribution): void {
-    if (this.status === ActionStatus.PENDING) {
-      this.status = ActionStatus.IN_PROGRESS;
-    }
-
-    this.addContribution(contribution);
-    this.achieved += contribution.amount;
-
-    if (this.achieved >= this.target) {
-      this.status = ActionStatus.COMPLETED;
-    }
-  }
+  private processContribution(contribution: Contribution): void {}
 
   private publishContributionEvent(

[NoCoverage] ConditionalExpression
src/actions/domain/Action.ts:174:9
   }
 
   private processContribution(contribution: Contribution): void {
-    if (this.status === ActionStatus.PENDING) {
+    if (true) {
       this.status = ActionStatus.IN_PROGRESS;
     }

[NoCoverage] EqualityOperator
src/actions/domain/Action.ts:174:9
   }
 
   private processContribution(contribution: Contribution): void {
-    if (this.status === ActionStatus.PENDING) {
+    if (this.status !== ActionStatus.PENDING) {
       this.status = ActionStatus.IN_PROGRESS;
     }

[NoCoverage] AssignmentOperator
src/actions/domain/Action.ts:179:5
     }
 
     this.addContribution(contribution);
-    this.achieved += contribution.amount;
+    this.achieved -= contribution.amount;
 
     if (this.achieved >= this.target) {

[NoCoverage] EqualityOperator
src/actions/domain/Action.ts:181:9
     this.addContribution(contribution);
     this.achieved += contribution.amount;
 
-    if (this.achieved >= this.target) {
+    if (this.achieved < this.target) {
       this.status = ActionStatus.COMPLETED;
     }

[NoCoverage] ConditionalExpression
src/actions/domain/Action.ts:181:9
     this.addContribution(contribution);
     this.achieved += contribution.amount;
 
-    if (this.achieved >= this.target) {
+    if (false) {
       this.status = ActionStatus.COMPLETED;
     }

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:189:11
   private publishContributionEvent(
     contribution: Contribution,
     actionId: string,
-  ): void {
-    this.apply(
-      new ActionContributedEvent(
-        contribution.userId,
-        this.communityId,
-        actionId,
-        this.causeId,
-        contribution.amount,
-        contribution.unit,
-      ),
-    );
-  }
+  ): void {}
 
   static checkProperties(props: ActionProps): boolean {

[NoCoverage] BlockStatement
src/actions/domain/Action.ts:202:55
     );
   }
 
-  static checkProperties(props: ActionProps): boolean {
-    const { type, title, description, causeId, createdBy } = props;
-    if (!type || !title || !description || !causeId || !createdBy) {
-      return false;
-    }
-    return true;
-  }
+  static checkProperties(props: ActionProps): boolean {}
 }
 

[NoCoverage] LogicalOperator
src/actions/domain/Action.ts:204:9
 
   static checkProperties(props: ActionProps): boolean {
     const { type, title, description, causeId, createdBy } = props;
-    if (!type || !title || !description || !causeId || !createdBy) {
+    if ((!type || !title || !description) && !causeId || !createdBy) {
       return false;
     }

[NoCoverage] LogicalOperator
src/actions/domain/Action.ts:204:9
 
   static checkProperties(props: ActionProps): boolean {
     const { type, title, description, causeId, createdBy } = props;
-    if (!type || !title || !description || !causeId || !createdBy) {
+    if ((!type || !title || !description || !causeId) && !createdBy) {
       return false;
     }

[NoCoverage] BooleanLiteral
src/actions/domain/Action.ts:205:14
   static checkProperties(props: ActionProps): boolean {
     const { type, title, description, causeId, createdBy } = props;
     if (!type || !title || !description || !causeId || !createdBy) {
-      return false;
+      return true;
     }
     return true;
