[NoCoverage] ConditionalExpression
src/actions/domain/ActionFactory.ts:33:7
       communityId,
     };
     switch (type) {
-      case ActionType.ECONOMIC: {
-        return EconomicAction.create({
-          ...commonProps,
-        });
-      }
+      case ActionType.ECONOMIC:
       case ActionType.GOODS_COLLECTION: {
         return GoodsCollectionAction.create({

[NoCoverage] BlockStatement
src/actions/domain/ActionFactory.ts:33:33
       communityId,
     };
     switch (type) {
-      case ActionType.ECONOMIC: {
-        return EconomicAction.create({
-          ...commonProps,
-        });
-      }
+      case ActionType.ECONOMIC: {}
       case ActionType.GOODS_COLLECTION: {
         return GoodsCollectionAction.create({

[NoCoverage] ConditionalExpression
src/actions/domain/ActionFactory.ts:38:7
           ...commonProps,
         });
       }
-      case ActionType.GOODS_COLLECTION: {
-        return GoodsCollectionAction.create({
-          ...commonProps,
-          goodType,
-        });
-      }
+      case ActionType.GOODS_COLLECTION:
       case ActionType.VOLUNTEER: {
         return VolunteerAction.create({

[NoCoverage] BlockStatement
src/actions/domain/ActionFactory.ts:38:41
           ...commonProps,
         });
       }
-      case ActionType.GOODS_COLLECTION: {
-        return GoodsCollectionAction.create({
-          ...commonProps,
-          goodType,
-        });
-      }
+      case ActionType.GOODS_COLLECTION: {}
       case ActionType.VOLUNTEER: {
         return VolunteerAction.create({

[NoCoverage] ConditionalExpression
src/actions/domain/ActionFactory.ts:44:7
           goodType,
         });
       }
-      case ActionType.VOLUNTEER: {
-        return VolunteerAction.create({
-          ...commonProps,
-          location,
-          date,
-        });
-      }
+      case ActionType.VOLUNTEER:
       default:
         throw new InvalidActionTypeError(type);

[NoCoverage] BlockStatement
src/actions/domain/ActionFactory.ts:44:34
           goodType,
         });
       }
-      case ActionType.VOLUNTEER: {
-        return VolunteerAction.create({
-          ...commonProps,
-          location,
-          date,
-        });
-      }
+      case ActionType.VOLUNTEER: {}
       default:
         throw new InvalidActionTypeError(type);

[NoCoverage] ConditionalExpression
src/actions/domain/ActionFactory.ts:51:7
           date,
         });
       }
-      default:
-        throw new InvalidActionTypeError(type);
+      default:
     }
   }
