[NoCoverage] BlockStatement
src/actions/domain/Contribution.ts:15:72
 }
 
 export class Contribution extends Entity<ContributionProps> {
-  protected constructor(props: ContributionProps, id?: UniqueEntityID) {
-    super(props, id);
-  }
+  protected constructor(props: ContributionProps, id?: UniqueEntityID) {}
 
   get id(): UniqueEntityID {

[NoCoverage] BlockStatement
src/actions/domain/Contribution.ts:23:24
     return this._id;
   }
 
-  get userId(): string {
-    return this.props.userId;
-  }
+  get userId(): string {}
 
   get actionId(): string {

[NoCoverage] BlockStatement
src/actions/domain/Contribution.ts:27:26
     return this.props.userId;
   }
 
-  get actionId(): string {
-    return this.props.actionId;
-  }
+  get actionId(): string {}
 
   get date(): Date {

[NoCoverage] BlockStatement
src/actions/domain/Contribution.ts:31:20
     return this.props.actionId;
   }
 
-  get date(): Date {
-    return this.props.date;
-  }
+  get date(): Date {}
 
   get amount(): number {

[NoCoverage] BlockStatement
src/actions/domain/Contribution.ts:35:24
     return this.props.date;
   }
 
-  get amount(): number {
-    return this.props.amount;
-  }
+  get amount(): number {}
 
   set amount(value: number) {

[NoCoverage] BlockStatement
src/actions/domain/Contribution.ts:39:29
     return this.props.amount;
   }
 
-  set amount(value: number) {
-    this.props.amount = value;
-  }
+  set amount(value: number) {}
 
   get unit(): string {

[NoCoverage] BlockStatement
src/actions/domain/Contribution.ts:51:77
     this.props.unit = value;
   }
 
-  public static create(props: ContributionProps, id?: string): Contribution {
-    if (id !== undefined) {
-      return new Contribution(props, new UniqueEntityID(id));
-    }
-    return new Contribution(props);
-  }
+  public static create(props: ContributionProps, id?: string): Contribution {}
 }
 

[NoCoverage] ConditionalExpression
src/actions/domain/Contribution.ts:52:9
   }
 
   public static create(props: ContributionProps, id?: string): Contribution {
-    if (id !== undefined) {
+    if (false) {
       return new Contribution(props, new UniqueEntityID(id));
     }

[NoCoverage] BlockStatement
src/actions/domain/Contribution.ts:52:27
   }
 
   public static create(props: ContributionProps, id?: string): Contribution {
-    if (id !== undefined) {
-      return new Contribution(props, new UniqueEntityID(id));
-    }
+    if (id !== undefined) {}
     return new Contribution(props);
   }
