[NoCoverage] BlockStatement
src/actions/domain/EconomicAction.ts:8:56
 import { ActionType } from './ActionType';
 
 export class EconomicAction extends Action {
-  constructor(props: ActionProps, id?: UniqueEntityID) {
-    super(props, id);
-    this.type = ActionType.ECONOMIC;
-  }
+  constructor(props: ActionProps, id?: UniqueEntityID) {}
 
   public static create(

[NoCoverage] BlockStatement
src/actions/domain/EconomicAction.ts:16:21
   public static create(
     props: ActionProps,
     id?: UniqueEntityID,
-  ): EconomicAction {
-    if (!super.checkProperties(props)) {
-      throw new MissingPropertiesError('[Action] Properties are missing.');
-    }
-    const action = new EconomicAction(props, id);
-    if (!id) {
-      action.apply(
-        new ActionCreatedEvent(
-          action.id.toString(),
-          props.causeId,
-          props.communityId,
-          props.target,
-          props.type,
-          props.title,
-        ),
-      );
-    }
-    return action;
-  }
+  ): EconomicAction {}
 }
 

[NoCoverage] ConditionalExpression
src/actions/domain/EconomicAction.ts:17:9
     props: ActionProps,
     id?: UniqueEntityID,
   ): EconomicAction {
-    if (!super.checkProperties(props)) {
+    if (true) {
       throw new MissingPropertiesError('[Action] Properties are missing.');
     }

[NoCoverage] ConditionalExpression
src/actions/domain/EconomicAction.ts:17:9
     props: ActionProps,
     id?: UniqueEntityID,
   ): EconomicAction {
-    if (!super.checkProperties(props)) {
+    if (false) {
       throw new MissingPropertiesError('[Action] Properties are missing.');
     }

[NoCoverage] ConditionalExpression
src/actions/domain/EconomicAction.ts:21:9
       throw new MissingPropertiesError('[Action] Properties are missing.');
     }
     const action = new EconomicAction(props, id);
-    if (!id) {
+    if (true) {
       action.apply(
         new ActionCreatedEvent(

[NoCoverage] BooleanLiteral
src/actions/domain/EconomicAction.ts:21:9
       throw new MissingPropertiesError('[Action] Properties are missing.');
     }
     const action = new EconomicAction(props, id);
-    if (!id) {
+    if (id) {
       action.apply(
         new ActionCreatedEvent(
