[NoCoverage] BlockStatement
src/actions/domain/GoodsCollectionAction.ts:12:71
 }
 
 export class GoodsCollectionAction extends Action {
-  constructor(props: GoodsCollectionActionProps, id?: UniqueEntityID) {
-    super(props, id);
-    this.type = ActionType.GOODS_COLLECTION;
-  }
+  constructor(props: GoodsCollectionActionProps, id?: UniqueEntityID) {}
 
   get goodType(): string {

[NoCoverage] BlockStatement
src/actions/domain/GoodsCollectionAction.ts:17:26
     this.type = ActionType.GOODS_COLLECTION;
   }
 
-  get goodType(): string {
-    return (this.props as GoodsCollectionActionProps).goodType;
-  }
+  get goodType(): string {}
 
   public static create(

[NoCoverage] BlockStatement
src/actions/domain/GoodsCollectionAction.ts:24:28
   public static create(
     props: GoodsCollectionActionProps,
     id?: UniqueEntityID,
-  ): GoodsCollectionAction {
-    if (!super.checkProperties(props) || !props.goodType) {
-      throw new MissingPropertiesError('[Action] Properties are missing.');
-    }
-    const action = new GoodsCollectionAction(props, id);
-    if (!id) {
-      action.apply(
-        new ActionCreatedEvent(
-          action.id.toString(),
-          props.causeId,
-          props.communityId,
-          props.target,
-          props.type,
-          props.title,
-        ),
-      );
-    }
-    return action;
-  }
+  ): GoodsCollectionAction {}
 }
 

[NoCoverage] BlockStatement
src/actions/domain/GoodsCollectionAction.ts:25:59
     props: GoodsCollectionActionProps,
     id?: UniqueEntityID,
   ): GoodsCollectionAction {
-    if (!super.checkProperties(props) || !props.goodType) {
-      throw new MissingPropertiesError('[Action] Properties are missing.');
-    }
+    if (!super.checkProperties(props) || !props.goodType) {}
     const action = new GoodsCollectionAction(props, id);
     if (!id) {

[NoCoverage] BooleanLiteral
src/actions/domain/GoodsCollectionAction.ts:25:9
     props: GoodsCollectionActionProps,
     id?: UniqueEntityID,
   ): GoodsCollectionAction {
-    if (!super.checkProperties(props) || !props.goodType) {
+    if (super.checkProperties(props) || !props.goodType) {
       throw new MissingPropertiesError('[Action] Properties are missing.');
     }

[NoCoverage] ConditionalExpression
src/actions/domain/GoodsCollectionAction.ts:29:9
       throw new MissingPropertiesError('[Action] Properties are missing.');
     }
     const action = new GoodsCollectionAction(props, id);
-    if (!id) {
+    if (false) {
       action.apply(
         new ActionCreatedEvent(

[NoCoverage] ConditionalExpression
src/actions/domain/GoodsCollectionAction.ts:29:9
       throw new MissingPropertiesError('[Action] Properties are missing.');
     }
     const action = new GoodsCollectionAction(props, id);
-    if (!id) {
+    if (true) {
       action.apply(
         new ActionCreatedEvent(
