[NoCoverage] BlockStatement
src/actions/domain/VolunteerAction.ts:13:65
 }
 
 export class VolunteerAction extends Action {
-  constructor(props: VolunteerActionProps, id?: UniqueEntityID) {
-    super(props, id);
-    this.type = ActionType.VOLUNTEER;
-  }
+  constructor(props: VolunteerActionProps, id?: UniqueEntityID) {}
 
   get location(): string {

[NoCoverage] BlockStatement
src/actions/domain/VolunteerAction.ts:18:26
     this.type = ActionType.VOLUNTEER;
   }
 
-  get location(): string {
-    return (this.props as VolunteerActionProps).location;
-  }
+  get location(): string {}
 
   get date(): Date {

[NoCoverage] BlockStatement
src/actions/domain/VolunteerAction.ts:22:20
     return (this.props as VolunteerActionProps).location;
   }
 
-  get date(): Date {
-    return (this.props as VolunteerActionProps).date;
-  }
+  get date(): Date {}
 
   public static create(

[NoCoverage] BlockStatement
src/actions/domain/VolunteerAction.ts:29:22
   public static create(
     props: VolunteerActionProps,
     id?: UniqueEntityID,
-  ): VolunteerAction {
-    if (!super.checkProperties(props) || !props.location || !props.date) {
-      throw new MissingPropertiesError('[Action] Properties are missing.');
-    }
-    const action = new VolunteerAction(props, id);
-    if (!id) {
-      action.apply(
-        new ActionCreatedEvent(
-          action.id.toString(),
-          props.causeId,
-          props.communityId,
-          props.target,
-          props.type,
-          props.title,
-        ),
-      );
-    }
-    return action;
-  }
+  ): VolunteerAction {}
 }
 

[NoCoverage] ConditionalExpression
src/actions/domain/VolunteerAction.ts:30:9
     props: VolunteerActionProps,
     id?: UniqueEntityID,
   ): VolunteerAction {
-    if (!super.checkProperties(props) || !props.location || !props.date) {
+    if (true) {
       throw new MissingPropertiesError('[Action] Properties are missing.');
     }

[NoCoverage] BooleanLiteral
src/actions/domain/VolunteerAction.ts:30:42
     props: VolunteerActionProps,
     id?: UniqueEntityID,
   ): VolunteerAction {
-    if (!super.checkProperties(props) || !props.location || !props.date) {
+    if (!super.checkProperties(props) || props.location || !props.date) {
       throw new MissingPropertiesError('[Action] Properties are missing.');
     }

[NoCoverage] BlockStatement
src/actions/domain/VolunteerAction.ts:34:14
       throw new MissingPropertiesError('[Action] Properties are missing.');
     }
     const action = new VolunteerAction(props, id);
-    if (!id) {
-      action.apply(
-        new ActionCreatedEvent(
-          action.id.toString(),
-          props.causeId,
-          props.communityId,
-          props.target,
-          props.type,
-          props.title,
-        ),
-      );
-    }
+    if (!id) {}
     return action;
   }

[NoCoverage] ConditionalExpression
src/actions/domain/VolunteerAction.ts:34:9
       throw new MissingPropertiesError('[Action] Properties are missing.');
     }
     const action = new VolunteerAction(props, id);
-    if (!id) {
+    if (false) {
       action.apply(
         new ActionCreatedEvent(
