[NoCoverage] BlockStatement
src/actions/exceptions/invalid-action-type.erros.ts:5:29
 import { ActionType } from '../domain/ActionType';
 
 export class InvalidActionTypeError extends BaseDomainError {
-  constructor(type: string) {
-    const validTypes = Object.values(ActionType).join(', ');
-    super(
-      `The type "${type}" is not valid. Valid action types are: ${validTypes}.`,
-    );
-  }
+  constructor(type: string) {}
 }
 

[NoCoverage] StringLiteral
src/actions/exceptions/invalid-action-type.erros.ts:8:7
   constructor(type: string) {
     const validTypes = Object.values(ActionType).join(', ');
     super(
-      `The type "${type}" is not valid. Valid action types are: ${validTypes}.`,
+      ``,
     );
   }
