[NoCoverage] BlockStatement
src/actions/infra/action.repository.mongodb.ts:24:61
     super();
   }
 
-  async save(entity: Domain.Action): Promise<Domain.Action> {
-    const persistenceAction = ActionMapper.toPersistence(entity);
-
-    const doc = await this.actionModel
-      .findOneAndUpdate({ id: persistenceAction.id }, persistenceAction, {
-        upsert: true,
-        new: true,
-      })
-      .exec();
-    return ActionMapper.toDomain(doc);
-  }
+  async save(entity: Domain.Action): Promise<Domain.Action> {}
 
   async findById(id: string): Promise<Domain.Action> {

[NoCoverage] BooleanLiteral
src/actions/infra/action.repository.mongodb.ts:29:17
 
     const doc = await this.actionModel
       .findOneAndUpdate({ id: persistenceAction.id }, persistenceAction, {
-        upsert: true,
+        upsert: false,
         new: true,
       })

[NoCoverage] BooleanLiteral
src/actions/infra/action.repository.mongodb.ts:30:14
     const doc = await this.actionModel
       .findOneAndUpdate({ id: persistenceAction.id }, persistenceAction, {
         upsert: true,
-        new: true,
+        new: false,
       })
       .exec();

[NoCoverage] BlockStatement
src/actions/infra/action.repository.mongodb.ts:36:54
     return ActionMapper.toDomain(doc);
   }
 
-  async findById(id: string): Promise<Domain.Action> {
-    const action = await this.actionModel.findOne({ id }).exec();
-
-    if (!action) {
-      throw new EntityNotFoundError(`Action with id ${id} not found.`);
-    }
-
-    return ActionMapper.toDomain(action);
-  }
+  async findById(id: string): Promise<Domain.Action> {}
 
   async findAll(

[NoCoverage] ObjectLiteral
src/actions/infra/action.repository.mongodb.ts:37:51
   }
 
   async findById(id: string): Promise<Domain.Action> {
-    const action = await this.actionModel.findOne({ id }).exec();
+    const action = await this.actionModel.findOne({}).exec();
 
     if (!action) {

[NoCoverage] BlockStatement
src/actions/infra/action.repository.mongodb.ts:39:18
   async findById(id: string): Promise<Domain.Action> {
     const action = await this.actionModel.findOne({ id }).exec();
 
-    if (!action) {
-      throw new EntityNotFoundError(`Action with id ${id} not found.`);
-    }
+    if (!action) {}
 
     return ActionMapper.toDomain(action);

[NoCoverage] ConditionalExpression
src/actions/infra/action.repository.mongodb.ts:39:9
   async findById(id: string): Promise<Domain.Action> {
     const action = await this.actionModel.findOne({ id }).exec();
 
-    if (!action) {
+    if (false) {
       throw new EntityNotFoundError(`Action with id ${id} not found.`);
     }

[NoCoverage] BlockStatement
src/actions/infra/action.repository.mongodb.ts:50:31
     filter: ActionFilter,
     sort: ActionSort,
     pagination: PaginationParams,
-  ): Promise<Domain.Action[]> {
-    const actions = await this.actionModel
-      .find(filter)
-      .sort(sort)
-      .skip(pagination.skip)
-      .limit(pagination.limit)
-      .exec();
-    return actions.map(ActionMapper.toDomain);
-  }
+  ): Promise<Domain.Action[]> {}
 
   async countDocuments(filter: ActionFilter): Promise<number> {

[NoCoverage] MethodExpression
src/actions/infra/action.repository.mongodb.ts:51:27
     sort: ActionSort,
     pagination: PaginationParams,
   ): Promise<Domain.Action[]> {
-    const actions = await this.actionModel
-      .find(filter)
-      .sort(sort)
+    const actions = await this.actionModel.find(filter)
       .skip(pagination.skip)
       .limit(pagination.limit)

[NoCoverage] BlockStatement
src/actions/infra/action.repository.mongodb.ts:60:63
     return actions.map(ActionMapper.toDomain);
   }
 
-  async countDocuments(filter: ActionFilter): Promise<number> {
-    return this.actionModel.countDocuments(filter).exec();
-  }
+  async countDocuments(filter: ActionFilter): Promise<number> {}
 
   async findByCauseId(causeId: string): Promise<Domain.Action[]> {

[NoCoverage] BlockStatement
src/actions/infra/action.repository.mongodb.ts:64:66
     return this.actionModel.countDocuments(filter).exec();
   }
 
-  async findByCauseId(causeId: string): Promise<Domain.Action[]> {
-    const actions = await this.actionModel.find({ causeId }).exec();
-    return actions.map(ActionMapper.toDomain);
-  }
+  async findByCauseId(causeId: string): Promise<Domain.Action[]> {}
 }
 

[NoCoverage] ObjectLiteral
src/actions/infra/action.repository.mongodb.ts:65:49
   }
 
   async findByCauseId(causeId: string): Promise<Domain.Action[]> {
-    const actions = await this.actionModel.find({ causeId }).exec();
+    const actions = await this.actionModel.find({}).exec();
     return actions.map(ActionMapper.toDomain);
   }
