[NoCoverage] ArrayDeclaration
actions/infra/filters/action-domain-exception.filter.ts:32:5
   >([
     [EntityNotFoundError, HttpStatus.NOT_FOUND],
     [ActionTitleConflictError, HttpStatus.CONFLICT],
-    [InvalidActionTypeError, HttpStatus.BAD_REQUEST],
+    [],
     [CompletedActionError, HttpStatus.CONFLICT],
     [InvalidContributionUnitError, HttpStatus.BAD_REQUEST],

[NoCoverage] ArrayDeclaration
actions/infra/filters/action-domain-exception.filter.ts:33:5
     [EntityNotFoundError, HttpStatus.NOT_FOUND],
     [ActionTitleConflictError, HttpStatus.CONFLICT],
     [InvalidActionTypeError, HttpStatus.BAD_REQUEST],
-    [CompletedActionError, HttpStatus.CONFLICT],
+    [],
     [InvalidContributionUnitError, HttpStatus.BAD_REQUEST],
   ]);

[NoCoverage] BlockStatement
actions/infra/filters/action-domain-exception.filter.ts:37:48
     [InvalidContributionUnitError, HttpStatus.BAD_REQUEST],
   ]);
 
-  catch(exception: Error, host: ArgumentsHost) {
-    const ctx = host.switchToHttp();
-    const response = ctx.getResponse<Response>();
-
-    const status =
-      this.exceptionStatusMap.get(
-        exception.constructor as ExceptionConstructor,
-      ) || HttpStatus.INTERNAL_SERVER_ERROR;
-    const message = exception.message || 'Internal server error';
-
-    response.status(status).json({
-      statusCode: status,
-      message,
-      timestamp: new Date().toISOString(),
-    });
-  }
+  catch(exception: Error, host: ArgumentsHost) {}
 }
 

[NoCoverage] ConditionalExpression
actions/infra/filters/action-domain-exception.filter.ts:42:7
     const response = ctx.getResponse<Response>();
 
     const status =
-      this.exceptionStatusMap.get(
-        exception.constructor as ExceptionConstructor,
-      ) || HttpStatus.INTERNAL_SERVER_ERROR;
+      false;
     const message = exception.message || 'Internal server error';
 

[NoCoverage] ConditionalExpression
actions/infra/filters/action-domain-exception.filter.ts:42:7
     const response = ctx.getResponse<Response>();
 
     const status =
-      this.exceptionStatusMap.get(
-        exception.constructor as ExceptionConstructor,
-      ) || HttpStatus.INTERNAL_SERVER_ERROR;
+      true;
     const message = exception.message || 'Internal server error';
 

[NoCoverage] ConditionalExpression
actions/infra/filters/action-domain-exception.filter.ts:45:21
       this.exceptionStatusMap.get(
         exception.constructor as ExceptionConstructor,
       ) || HttpStatus.INTERNAL_SERVER_ERROR;
-    const message = exception.message || 'Internal server error';
+    const message = false;
 
     response.status(status).json({

[NoCoverage] ConditionalExpression
actions/infra/filters/action-domain-exception.filter.ts:45:21
       this.exceptionStatusMap.get(
         exception.constructor as ExceptionConstructor,
       ) || HttpStatus.INTERNAL_SERVER_ERROR;
-    const message = exception.message || 'Internal server error';
+    const message = true;
 
     response.status(status).json({
