[NoCoverage] BlockStatement
actions/infra/filters/action-query.builder.ts:30:44
     limit: PaginationDefaults.DEFAULT_LIMIT,
   };
 
-  addNameFilter(nameFilter?: string): this {
-    if (nameFilter) {
-      this.filter.title = { $regex: nameFilter, $options: 'i' };
-    }
-    return this;
-  }
+  addNameFilter(nameFilter?: string): this {}
 
   addStatusFilter(statusFilter?: ActionStatus): this {

[NoCoverage] ConditionalExpression
actions/infra/filters/action-query.builder.ts:31:9
   };
 
   addNameFilter(nameFilter?: string): this {
-    if (nameFilter) {
+    if (false) {
       this.filter.title = { $regex: nameFilter, $options: 'i' };
     }

[NoCoverage] ConditionalExpression
actions/infra/filters/action-query.builder.ts:31:9
   };
 
   addNameFilter(nameFilter?: string): this {
-    if (nameFilter) {
+    if (true) {
       this.filter.title = { $regex: nameFilter, $options: 'i' };
     }

[NoCoverage] BlockStatement
actions/infra/filters/action-query.builder.ts:37:54
     return this;
   }
 
-  addStatusFilter(statusFilter?: ActionStatus): this {
-    if (statusFilter) {
-      this.filter.status = { $eq: statusFilter };
-    }
-    return this;
-  }
+  addStatusFilter(statusFilter?: ActionStatus): this {}
 
   addSort(

[NoCoverage] ConditionalExpression
actions/infra/filters/action-query.builder.ts:38:9
   }
 
   addStatusFilter(statusFilter?: ActionStatus): this {
-    if (statusFilter) {
+    if (false) {
       this.filter.status = { $eq: statusFilter };
     }

[NoCoverage] ConditionalExpression
actions/infra/filters/action-query.builder.ts:38:9
   }
 
   addStatusFilter(statusFilter?: ActionStatus): this {
-    if (statusFilter) {
+    if (true) {
       this.filter.status = { $eq: statusFilter };
     }

[NoCoverage] BlockStatement
actions/infra/filters/action-query.builder.ts:47:11
   addSort(
     sortBy?: ActionSortBy,
     sortDirection: SortDirection = SortDirection.ASC,
-  ): this {
-    if (sortBy) {
-      this.sort[sortBy] = sortDirection === SortDirection.DESC ? -1 : 1;
-    }
-    return this;
-  }
+  ): this {}
 
   addPagination(

[NoCoverage] BlockStatement
actions/infra/filters/action-query.builder.ts:48:17
     sortBy?: ActionSortBy,
     sortDirection: SortDirection = SortDirection.ASC,
   ): this {
-    if (sortBy) {
-      this.sort[sortBy] = sortDirection === SortDirection.DESC ? -1 : 1;
-    }
+    if (sortBy) {}
     return this;
   }

[NoCoverage] ConditionalExpression
actions/infra/filters/action-query.builder.ts:48:9
     sortBy?: ActionSortBy,
     sortDirection: SortDirection = SortDirection.ASC,
   ): this {
-    if (sortBy) {
+    if (false) {
       this.sort[sortBy] = sortDirection === SortDirection.DESC ? -1 : 1;
     }

[NoCoverage] ConditionalExpression
actions/infra/filters/action-query.builder.ts:49:27
     sortDirection: SortDirection = SortDirection.ASC,
   ): this {
     if (sortBy) {
-      this.sort[sortBy] = sortDirection === SortDirection.DESC ? -1 : 1;
+      this.sort[sortBy] = false ? -1 : 1;
     }
     return this;

[NoCoverage] UnaryOperator
actions/infra/filters/action-query.builder.ts:49:66
     sortDirection: SortDirection = SortDirection.ASC,
   ): this {
     if (sortBy) {
-      this.sort[sortBy] = sortDirection === SortDirection.DESC ? -1 : 1;
+      this.sort[sortBy] = sortDirection === SortDirection.DESC ? +1 : 1;
     }
     return this;

[NoCoverage] BlockStatement
actions/infra/filters/action-query.builder.ts:57:11
   addPagination(
     page: number = PaginationDefaults.DEFAULT_PAGE,
     limit: number = PaginationDefaults.DEFAULT_LIMIT,
-  ): this {
-    // Validate that page is at least 1
-    const validatedPage = Math.max(page, 1);
-
-    // Validate that limit is within the allowed values
-    const validatedLimit = Math.min(
-      Math.max(limit, 1), // Ensure it is at least 1
-      PaginationDefaults.MAX_LIMIT, // Respect the maximum allowed limit
-    );
-
-    const skip = (validatedPage - 1) * validatedLimit;
-
-    this.pagination = { skip, limit: validatedLimit };
-    return this;
-  }
+  ): this {}
 
   buildFilter(): ActionFilter {

[NoCoverage] MethodExpression
actions/infra/filters/action-query.builder.ts:59:27
     limit: number = PaginationDefaults.DEFAULT_LIMIT,
   ): this {
     // Validate that page is at least 1
-    const validatedPage = Math.max(page, 1);
+    const validatedPage = Math.min(page, 1);
 
     // Validate that limit is within the allowed values

[NoCoverage] MethodExpression
actions/infra/filters/action-query.builder.ts:62:28
     const validatedPage = Math.max(page, 1);
 
     // Validate that limit is within the allowed values
-    const validatedLimit = Math.min(
-      Math.max(limit, 1), // Ensure it is at least 1
-      PaginationDefaults.MAX_LIMIT, // Respect the maximum allowed limit
-    );
+    const validatedLimit = Math.max(Math.max(limit, 1),
+// Ensure it is at least 1
+PaginationDefaults.MAX_LIMIT // Respect the maximum allowed limit
+);
 
     const skip = (validatedPage - 1) * validatedLimit;

[NoCoverage] MethodExpression
actions/infra/filters/action-query.builder.ts:63:7
 
     // Validate that limit is within the allowed values
     const validatedLimit = Math.min(
-      Math.max(limit, 1), // Ensure it is at least 1
+      Math.min(limit, 1), // Ensure it is at least 1
       PaginationDefaults.MAX_LIMIT, // Respect the maximum allowed limit
     );

[NoCoverage] ArithmeticOperator
actions/infra/filters/action-query.builder.ts:67:18
       PaginationDefaults.MAX_LIMIT, // Respect the maximum allowed limit
     );
 
-    const skip = (validatedPage - 1) * validatedLimit;
+    const skip = (validatedPage - 1) / validatedLimit;
 
     this.pagination = { skip, limit: validatedLimit };

[NoCoverage] ArithmeticOperator
actions/infra/filters/action-query.builder.ts:67:19
       PaginationDefaults.MAX_LIMIT, // Respect the maximum allowed limit
     );
 
-    const skip = (validatedPage - 1) * validatedLimit;
+    const skip = (validatedPage + 1) * validatedLimit;
 
     this.pagination = { skip, limit: validatedLimit };

[NoCoverage] BlockStatement
actions/infra/filters/action-query.builder.ts:73:31
     return this;
   }
 
-  buildFilter(): ActionFilter {
-    return this.filter;
-  }
+  buildFilter(): ActionFilter {}
 
   buildSort(): ActionSort {

[NoCoverage] BlockStatement
actions/infra/filters/action-query.builder.ts:77:27
     return this.filter;
   }
 
-  buildSort(): ActionSort {
-    return this.sort;
-  }
+  buildSort(): ActionSort {}
 
   buildPagination(): PaginationParams {

[NoCoverage] BlockStatement
actions/infra/filters/action-query.builder.ts:81:39
     return this.sort;
   }
 
-  buildPagination(): PaginationParams {
-    return this.pagination;
-  }
+  buildPagination(): PaginationParams {}
 }
 
