[NoCoverage] StringLiteral
src/causes/application/cause.controller.ts:53:21
     );
 
     // Build the base URL for the paginated response
-    const baseUrl = `${req.protocol}://${req.get('host')}${req.path}`;
+    const baseUrl = ``;
 
     // Create the paginated response

[NoCoverage] BlockStatement
src/causes/application/cause.controller.ts:71:79
   @ApiOperation({ summary: 'Get details of a specific cause by id' })
   @Public()
   @Get(':id')
-  async findOne(@Param('id', ParseUUIDPipe) id: string, @Res() res: Response) {
-    const cause = await this.causeService.getCause(id);
-
-    const causeDto = CauseMapper.toDTO(cause);
-    res.status(HttpStatus.OK).json(causeDto);
-  }
+  async findOne(@Param('id', ParseUUIDPipe) id: string, @Res() res: Response) {}
 
   @ApiExcludeEndpoint()

[NoCoverage] BlockStatement
src/causes/application/cause.controller.ts:84:5
     @Param('id', ParseUUIDPipe) id: string,
     @Body() updateCauseDto: UpdateCauseDto,
     @Res() res: Response,
-  ) {
-    await this.causeService.updateCause(
-      id,
-      updateCauseDto.description,
-      updateCauseDto.ods,
-    );
-
-    const locationUrl = `/causes/${id}`;
-    res.status(HttpStatus.NO_CONTENT).location(locationUrl).send();
-  }
+  ) {}
 
   @ApiExcludeEndpoint()

[NoCoverage] BlockStatement
src/causes/application/cause.controller.ts:103:5
     @Query() queryPagination: QueryPaginationDto,
     @Req() req: Request,
     @Res() res: Response,
-  ) {
-    const { page, limit } = queryPagination;
-
-    const { data, total } = await this.causeService.getCauseActions(
-      causeId,
-      page,
-      limit,
-    );
-
-    // Build the base URL for the paginated response
-    const baseUrl = `${req.protocol}://${req.get('host')}${req.path}`;
-
-    // Create the paginated response
-    const response = new PaginatedResponseDto(
-      data,
-      total,
-      page,
-      limit,
-      baseUrl,
-    );
-
-    // Send the response
-    res.status(HttpStatus.OK).json(response);
-  }
+  ) {}
 
   @ApiExcludeEndpoint()

[NoCoverage] BlockStatement
src/causes/application/cause.controller.ts:135:5
     @Param('id', ParseUUIDPipe) causeId: string,
     @GetUserId() userId: string,
     @Res() res: Response,
-  ) {
-    const { type, title, description, target, unit, goodType, location, date } =
-      createActionDto;
-
-    const createdBy = userId;
-
-    const result = await this.causeService.addCauseAction(
-      type,
-      title,
-      description,
-      causeId,
-      target,
-      unit,
-      createdBy,
-      goodType,
-      location,
-      date,
-    );
-
-    const locationUrl = `/actions/${result}`;
-    res.status(HttpStatus.CREATED).location(locationUrl).json({ id: result });
-  }
+  ) {}
 
   @ApiExcludeEndpoint()

[NoCoverage] ObjectLiteral
src/causes/application/cause.controller.ts:155:63
     );
 
     const locationUrl = `/actions/${result}`;
-    res.status(HttpStatus.CREATED).location(locationUrl).json({ id: result });
+    res.status(HttpStatus.CREATED).location(locationUrl).json({});
   }
 

[NoCoverage] BlockStatement
src/causes/application/cause.controller.ts:166:5
     @Query() queryPagination: QueryPaginationDto,
     @Req() req: Request,
     @Res() res: Response,
-  ) {
-    const { page, limit } = queryPagination;
-
-    const { data, total } = await this.causeService.getCauseSupporters(
-      causeId,
-      page,
-      limit,
-    );
-
-    // Build the base URL for the paginated response
-    const baseUrl = `${req.protocol}://${req.get('host')}${req.path}`;
-
-    // Create the paginated response
-    const response = new PaginatedResponseDto(
-      data,
-      total,
-      page,
-      limit,
-      baseUrl,
-    );
-
-    // Send the response
-    res.status(HttpStatus.OK).json(response);
-  }
+  ) {}
 
   @ApiExcludeEndpoint()

[NoCoverage] BlockStatement
src/causes/application/cause.controller.ts:197:5
     @Param('id', ParseUUIDPipe) id: string,
     @GetUserId() supporterId: string,
     @Res() res: Response,
-  ) {
-    await this.causeService.addCauseSupporter(id, supporterId);
-
-    const locationUrl = `/causes/${id}/supporters/${supporterId}`;
-    res
-      .status(HttpStatus.CREATED)
-      .location(locationUrl)
-      .json({ causeId: id, supporterId });
-  }
+  ) {}
 }
 
