[NoCoverage] BlockStatement
src/causes/application/cause.service.impl.ts:36:6
   ): Promise<{
     data: Cause[];
     total: number;
-  }> {
-    const queryBuilder = new CauseQueryBuilder()
-      .addOdsFilter(odsFilter)
-      .addNameFilter(nameFilter)
-      .addSort(sortBy, sortDirection)
-      .addPagination(page, limit);
-
-    const filters = queryBuilder.buildFilter();
-    const sort = queryBuilder.buildSort();
-    const pagination = queryBuilder.buildPagination();
-
-    // Use Promise.all to execute both queries in parallel
-    const [data, total] = await Promise.all([
-      this.causeRepository.findAll(filters, sort, pagination), // Get paginated data
-      this.causeRepository.countDocuments(filters), // Count total documents
-    ]);
-
-    return {
-      data,
-      total,
-    };
-  }
+  }> {}
 
   async createCause(

[NoCoverage] ArrayDeclaration
src/causes/application/cause.service.impl.ts:48:45
     const pagination = queryBuilder.buildPagination();
 
     // Use Promise.all to execute both queries in parallel
-    const [data, total] = await Promise.all([
-      this.causeRepository.findAll(filters, sort, pagination), // Get paginated data
-      this.causeRepository.countDocuments(filters), // Count total documents
-    ]);
+    const [data, total] = await Promise.all([]);
 
     return {

[NoCoverage] ObjectLiteral
src/causes/application/cause.service.impl.ts:53:12
       this.causeRepository.countDocuments(filters), // Count total documents
     ]);
 
-    return {
-      data,
-      total,
-    };
+    return {};
   }
 

[NoCoverage] BlockStatement
src/causes/application/cause.service.impl.ts:66:22
     endDate: Date,
     communityId: string,
     createdBy: string,
-  ): Promise<string> {
-    // Create a new cause
-    const cause = this.eventPublisher.mergeObjectContext(
-      Cause.create({
-        title,
-        description,
-        ods,
-        endDate: CauseEndDate.create(endDate),
-        communityId,
-        createdBy,
-      }),
-    );
-
-    // Create the new cause and save it
-    const savedCause = await this.causeRepository.save(cause);
-
-    cause.commit();
-    // Return the ID of the newly created cause
-    return savedCause.id.toString();
-  }
+  ): Promise<string> {}
 
   validateCauseEndDate(endDate: Date): boolean {

[NoCoverage] BlockStatement
src/causes/application/cause.service.impl.ts:87:48
     return savedCause.id.toString();
   }
 
-  validateCauseEndDate(endDate: Date): boolean {
-    try {
-      CauseEndDate.create(endDate);
-      return true;
-    } catch (error) {
-      this.logger.error(error);
-      return false;
-    }
-  }
+  validateCauseEndDate(endDate: Date): boolean {}
 
   getCause(id: string): Promise<Cause> {

[NoCoverage] BlockStatement
src/causes/application/cause.service.impl.ts:88:9
   }
 
   validateCauseEndDate(endDate: Date): boolean {
-    try {
-      CauseEndDate.create(endDate);
-      return true;
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error(error);
       return false;

[NoCoverage] BooleanLiteral
src/causes/application/cause.service.impl.ts:90:14
   validateCauseEndDate(endDate: Date): boolean {
     try {
       CauseEndDate.create(endDate);
-      return true;
+      return false;
     } catch (error) {
       this.logger.error(error);

[NoCoverage] BlockStatement
src/causes/application/cause.service.impl.ts:91:21
     try {
       CauseEndDate.create(endDate);
       return true;
-    } catch (error) {
-      this.logger.error(error);
-      return false;
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BooleanLiteral
src/causes/application/cause.service.impl.ts:93:14
       return true;
     } catch (error) {
       this.logger.error(error);
-      return false;
+      return true;
     }
   }

[NoCoverage] BlockStatement
src/causes/application/cause.service.impl.ts:97:40
     }
   }
 
-  getCause(id: string): Promise<Cause> {
-    return this.causeRepository.findById(id);
-  }
+  getCause(id: string): Promise<Cause> {}
 
   async updateCause(

[NoCoverage] BlockStatement
src/causes/application/cause.service.impl.ts:105:20
     id: string,
     description?: string,
     ods?: ODSEnum[],
-  ): Promise<void> {
-    // Find the existing cause by ID
-    const existingCause = await this.causeRepository.findById(id);
-
-    // Update optional fields if provided
-    existingCause.description = description ?? existingCause.description;
-    existingCause.ods = ods ?? existingCause.ods;
-
-    // Update the changes in the repository
-    await this.causeRepository.save(existingCause);
-  }
+  ): Promise<void> {}
 
   async getCauseSupporters(

[NoCoverage] LogicalOperator
src/causes/application/cause.service.impl.ts:110:33
     const existingCause = await this.causeRepository.findById(id);
 
     // Update optional fields if provided
-    existingCause.description = description ?? existingCause.description;
+    existingCause.description = description && existingCause.description;
     existingCause.ods = ods ?? existingCause.ods;
 

[NoCoverage] LogicalOperator
src/causes/application/cause.service.impl.ts:111:25
 
     // Update optional fields if provided
     existingCause.description = description ?? existingCause.description;
-    existingCause.ods = ods ?? existingCause.ods;
+    existingCause.ods = ods && existingCause.ods;
 
     // Update the changes in the repository

[NoCoverage] BlockStatement
src/causes/application/cause.service.impl.ts:124:6
   ): Promise<{
     data: string[];
     total: number;
-  }> {
-    const cause = await this.getCause(id);
-
-    // Validate page and limit
-    const validatedPage = Math.max(page, 1);
-    const validatedLimit = Math.max(limit, 1);
-
-    // Calculate the total number of supporters and the data to return
-    const total = cause.supportersIds.length;
-    const skip = (validatedPage - 1) * validatedLimit;
-    const data = cause.supportersIds.slice(skip, skip + validatedLimit);
-
-    return {
-      data,
-      total,
-    };
-  }
+  }> {}
 
   async addCauseSupporter(id: string, userId: string): Promise<void> {

[NoCoverage] ArithmeticOperator
src/causes/application/cause.service.impl.ts:133:18
 
     // Calculate the total number of supporters and the data to return
     const total = cause.supportersIds.length;
-    const skip = (validatedPage - 1) * validatedLimit;
+    const skip = (validatedPage - 1) / validatedLimit;
     const data = cause.supportersIds.slice(skip, skip + validatedLimit);
 

[NoCoverage] ArithmeticOperator
src/causes/application/cause.service.impl.ts:133:19
 
     // Calculate the total number of supporters and the data to return
     const total = cause.supportersIds.length;
-    const skip = (validatedPage - 1) * validatedLimit;
+    const skip = (validatedPage + 1) * validatedLimit;
     const data = cause.supportersIds.slice(skip, skip + validatedLimit);
 

[NoCoverage] ArithmeticOperator
src/causes/application/cause.service.impl.ts:134:50
     // Calculate the total number of supporters and the data to return
     const total = cause.supportersIds.length;
     const skip = (validatedPage - 1) * validatedLimit;
-    const data = cause.supportersIds.slice(skip, skip + validatedLimit);
+    const data = cause.supportersIds.slice(skip, skip - validatedLimit);
 
     return {

[NoCoverage] MethodExpression
src/causes/application/cause.service.impl.ts:134:18
     // Calculate the total number of supporters and the data to return
     const total = cause.supportersIds.length;
     const skip = (validatedPage - 1) * validatedLimit;
-    const data = cause.supportersIds.slice(skip, skip + validatedLimit);
+    const data = cause.supportersIds;
 
     return {

[NoCoverage] BlockStatement
src/causes/application/cause.service.impl.ts:142:70
     };
   }
 
-  async addCauseSupporter(id: string, userId: string): Promise<void> {
-    const cause = this.eventPublisher.mergeObjectContext(
-      await this.getCause(id),
-    );
-    cause.addSupporter(userId);
-
-    await this.causeRepository.save(cause);
-    cause.commit();
-  }
+  async addCauseSupporter(id: string, userId: string): Promise<void> {}
 
   async getCauseActions(

[NoCoverage] BlockStatement
src/causes/application/cause.service.impl.ts:159:6
   ): Promise<{
     data: string[];
     total: number;
-  }> {
-    const cause = await this.getCause(id);
-
-    // Validate page and limit
-    const validatedPage = Math.max(page, 1);
-    const validatedLimit = Math.max(limit, 1);
-
-    // Calculate the total number of actions and the data to return
-    const total = cause.actionsIds.length;
-    const skip = (validatedPage - 1) * validatedLimit;
-    const data = cause.actionsIds.slice(skip, skip + validatedLimit);
-
-    return {
-      data,
-      total,
-    };
-  }
+  }> {}
 
   async addCauseAction(

[NoCoverage] ArithmeticOperator
src/causes/application/cause.service.impl.ts:168:18
 
     // Calculate the total number of actions and the data to return
     const total = cause.actionsIds.length;
-    const skip = (validatedPage - 1) * validatedLimit;
+    const skip = (validatedPage - 1) / validatedLimit;
     const data = cause.actionsIds.slice(skip, skip + validatedLimit);
 

[NoCoverage] ArithmeticOperator
src/causes/application/cause.service.impl.ts:168:19
 
     // Calculate the total number of actions and the data to return
     const total = cause.actionsIds.length;
-    const skip = (validatedPage - 1) * validatedLimit;
+    const skip = (validatedPage + 1) * validatedLimit;
     const data = cause.actionsIds.slice(skip, skip + validatedLimit);
 

[NoCoverage] ArithmeticOperator
src/causes/application/cause.service.impl.ts:169:47
     // Calculate the total number of actions and the data to return
     const total = cause.actionsIds.length;
     const skip = (validatedPage - 1) * validatedLimit;
-    const data = cause.actionsIds.slice(skip, skip + validatedLimit);
+    const data = cause.actionsIds.slice(skip, skip - validatedLimit);
 
     return {

[NoCoverage] MethodExpression
src/causes/application/cause.service.impl.ts:169:18
     // Calculate the total number of actions and the data to return
     const total = cause.actionsIds.length;
     const skip = (validatedPage - 1) * validatedLimit;
-    const data = cause.actionsIds.slice(skip, skip + validatedLimit);
+    const data = cause.actionsIds;
 
     return {

[NoCoverage] BlockStatement
src/causes/application/cause.service.impl.ts:188:22
     goodType?: string,
     location?: string,
     date?: Date,
-  ): Promise<string> {
-    const cause = await this.getCause(causeId);
-
-    const actionId = await this.actionService.createAction(
-      type,
-      title,
-      description,
-      causeId,
-      target,
-      unit,
-      createdBy,
-      cause.communityId,
-      goodType,
-      location,
-      date,
-    );
-
-    cause.addAction(actionId);
-    await this.causeRepository.save(cause);
-    return actionId;
-  }
+  ): Promise<string> {}
 }
 
