[NoCoverage] BlockStatement
src/causes/domain/Cause.ts:27:28
 }
 
 export class Cause extends EntityRoot<CauseProps> {
-  get id(): UniqueEntityID {
-    return this._id;
-  }
+  get id(): UniqueEntityID {}
 
   get title(): string {

[NoCoverage] BlockStatement
src/causes/domain/Cause.ts:39:34
     return this.props.description;
   }
 
-  set description(value: string) {
-    this.props.description = value;
-  }
+  set description(value: string) {}
 
   get ods(): ODSEnum[] {

[NoCoverage] BlockStatement
src/causes/domain/Cause.ts:43:24
     this.props.description = value;
   }
 
-  get ods(): ODSEnum[] {
-    return this.props.ods;
-  }
+  get ods(): ODSEnum[] {}
 
   set ods(value: ODSEnum[]) {

[NoCoverage] BlockStatement
src/causes/domain/Cause.ts:47:29
     return this.props.ods;
   }
 
-  set ods(value: ODSEnum[]) {
-    this.props.ods = value;
-  }
+  set ods(value: ODSEnum[]) {}
 
   get endDate(): CauseEndDate {

[NoCoverage] BlockStatement
src/causes/domain/Cause.ts:51:31
     this.props.ods = value;
   }
 
-  get endDate(): CauseEndDate {
-    return this.props.endDate;
-  }
+  get endDate(): CauseEndDate {}
 
   get communityId(): string {

[NoCoverage] BlockStatement
src/causes/domain/Cause.ts:59:30
     return this.props.communityId;
   }
 
-  get actionsIds(): string[] {
-    return [...this.props.actionsIds];
-  }
+  get actionsIds(): string[] {}
 
   get supportersIds(): string[] {

[NoCoverage] BlockStatement
src/causes/domain/Cause.ts:63:33
     return [...this.props.actionsIds];
   }
 
-  get supportersIds(): string[] {
-    return [...this.props.supportersIds];
-  }
+  get supportersIds(): string[] {}
 
   get createdBy(): string {

[NoCoverage] BooleanLiteral
src/causes/domain/Cause.ts:82:7
   public static create(props: CauseProps, id?: UniqueEntityID): Cause {
     const { title, description, ods, endDate, communityId, createdBy } = props;
     if (
-      !title ||
+      title ||
       !description ||
       !ods ||

[NoCoverage] LogicalOperator
src/causes/domain/Cause.ts:82:7
   public static create(props: CauseProps, id?: UniqueEntityID): Cause {
     const { title, description, ods, endDate, communityId, createdBy } = props;
     if (
-      !title ||
-      !description ||
-      !ods ||
-      !endDate ||
-      !communityId ||
-      !createdBy
+      (!title || !description || !ods || !endDate || !communityId) && !createdBy
     ) {
       throw new MissingPropertiesError('[Cause] Properties are missing.');

[NoCoverage] BooleanLiteral
src/causes/domain/Cause.ts:83:7
     const { title, description, ods, endDate, communityId, createdBy } = props;
     if (
       !title ||
-      !description ||
+      description ||
       !ods ||
       !endDate ||

[NoCoverage] BooleanLiteral
src/causes/domain/Cause.ts:84:7
     if (
       !title ||
       !description ||
-      !ods ||
+      ods ||
       !endDate ||
       !communityId ||

[NoCoverage] BooleanLiteral
src/causes/domain/Cause.ts:85:7
       !title ||
       !description ||
       !ods ||
-      !endDate ||
+      endDate ||
       !communityId ||
       !createdBy

[NoCoverage] BooleanLiteral
src/causes/domain/Cause.ts:86:7
       !description ||
       !ods ||
       !endDate ||
-      !communityId ||
+      communityId ||
       !createdBy
     ) {

[NoCoverage] BooleanLiteral
src/causes/domain/Cause.ts:87:7
       !ods ||
       !endDate ||
       !communityId ||
-      !createdBy
+      createdBy
     ) {
       throw new MissingPropertiesError('[Cause] Properties are missing.');

[NoCoverage] BlockStatement
src/causes/domain/Cause.ts:88:7
       !endDate ||
       !communityId ||
       !createdBy
-    ) {
-      throw new MissingPropertiesError('[Cause] Properties are missing.');
-    }
+    ) {}
 
     const defaultProps: CauseProps = {

[NoCoverage] ConditionalExpression
src/causes/domain/Cause.ts:94:19
 
     const defaultProps: CauseProps = {
       ...props,
-      actionsIds: props.actionsIds || [],
+      actionsIds: true,
       supportersIds: props.supportersIds || [],
       createdAt: props.createdAt ?? new Date(),

[NoCoverage] ConditionalExpression
src/causes/domain/Cause.ts:94:19
 
     const defaultProps: CauseProps = {
       ...props,
-      actionsIds: props.actionsIds || [],
+      actionsIds: false,
       supportersIds: props.supportersIds || [],
       createdAt: props.createdAt ?? new Date(),

[NoCoverage] LogicalOperator
src/causes/domain/Cause.ts:95:22
     const defaultProps: CauseProps = {
       ...props,
       actionsIds: props.actionsIds || [],
-      supportersIds: props.supportersIds || [],
+      supportersIds: props.supportersIds && [],
       createdAt: props.createdAt ?? new Date(),
       updatedAt: props.updatedAt ?? new Date(),

[NoCoverage] ConditionalExpression
src/causes/domain/Cause.ts:95:22
     const defaultProps: CauseProps = {
       ...props,
       actionsIds: props.actionsIds || [],
-      supportersIds: props.supportersIds || [],
+      supportersIds: false,
       createdAt: props.createdAt ?? new Date(),
       updatedAt: props.updatedAt ?? new Date(),

[NoCoverage] LogicalOperator
src/causes/domain/Cause.ts:96:18
       ...props,
       actionsIds: props.actionsIds || [],
       supportersIds: props.supportersIds || [],
-      createdAt: props.createdAt ?? new Date(),
+      createdAt: props.createdAt && new Date(),
       updatedAt: props.updatedAt ?? new Date(),
     };

[NoCoverage] LogicalOperator
src/causes/domain/Cause.ts:97:18
       actionsIds: props.actionsIds || [],
       supportersIds: props.supportersIds || [],
       createdAt: props.createdAt ?? new Date(),
-      updatedAt: props.updatedAt ?? new Date(),
+      updatedAt: props.updatedAt && new Date(),
     };
 

[NoCoverage] BlockStatement
src/causes/domain/Cause.ts:117:44
     return cause;
   }
 
-  public addAction(actionId: string): void {
-    // We check if the action already exists
-    if (this.props.actionsIds.includes(actionId)) {
-      throw new ActionAlreadyExistsError(actionId);
-    }
-
-    this.props.actionsIds.push(actionId);
-  }
+  public addAction(actionId: string): void {}
 
   public addSupporter(userId: string): void {

[NoCoverage] ConditionalExpression
src/causes/domain/Cause.ts:119:9
 
   public addAction(actionId: string): void {
     // We check if the action already exists
-    if (this.props.actionsIds.includes(actionId)) {
+    if (false) {
       throw new ActionAlreadyExistsError(actionId);
     }

[NoCoverage] ConditionalExpression
src/causes/domain/Cause.ts:119:9
 
   public addAction(actionId: string): void {
     // We check if the action already exists
-    if (this.props.actionsIds.includes(actionId)) {
+    if (true) {
       throw new ActionAlreadyExistsError(actionId);
     }

[NoCoverage] BlockStatement
src/causes/domain/Cause.ts:126:45
     this.props.actionsIds.push(actionId);
   }
 
-  public addSupporter(userId: string): void {
-    // We check if the supporter already exists
-    if (this.props.supportersIds.includes(userId)) {
-      throw new SupporterAlreadyExistsError(userId);
-    }
-    this.props.supportersIds.push(userId);
-    this.apply(
-      new CauseSupportedEvent(
-        userId,
-        this.id.toString(),
-        this.communityId,
-        this.ods,
-      ),
-    );
-  }
+  public addSupporter(userId: string): void {}
 }
 

[NoCoverage] BlockStatement
src/causes/domain/Cause.ts:128:52
 
   public addSupporter(userId: string): void {
     // We check if the supporter already exists
-    if (this.props.supportersIds.includes(userId)) {
-      throw new SupporterAlreadyExistsError(userId);
-    }
+    if (this.props.supportersIds.includes(userId)) {}
     this.props.supportersIds.push(userId);
     this.apply(

[NoCoverage] ConditionalExpression
src/causes/domain/Cause.ts:128:9
 
   public addSupporter(userId: string): void {
     // We check if the supporter already exists
-    if (this.props.supportersIds.includes(userId)) {
+    if (true) {
       throw new SupporterAlreadyExistsError(userId);
     }
