[NoCoverage] BlockStatement
src/causes/domain/CauseEndDate.ts:9:49
 }
 
 export class CauseEndDate extends ValueObject<CauseEndDateProps> {
-  private constructor(props: CauseEndDateProps) {
-    super(props);
-  }
+  private constructor(props: CauseEndDateProps) {}
 
   get value(): Date {

[NoCoverage] BlockStatement
src/causes/domain/CauseEndDate.ts:13:21
     super(props);
   }
 
-  get value(): Date {
-    return this.props.value;
-  }
+  get value(): Date {}
 
   public static create(value: Date): CauseEndDate {

[NoCoverage] BlockStatement
src/causes/domain/CauseEndDate.ts:17:51
     return this.props.value;
   }
 
-  public static create(value: Date): CauseEndDate {
-    if (!(value instanceof Date) || Number.isNaN(value.getTime())) {
-      throw new InvalidDateProvidedError();
-    }
-
-    if (value <= new Date()) {
-      throw new InvalidDateProvidedError('The end date must be in the future.');
-    }
-    return new CauseEndDate({ value });
-  }
+  public static create(value: Date): CauseEndDate {}
 }
 

[NoCoverage] ConditionalExpression
src/causes/domain/CauseEndDate.ts:18:9
   }
 
   public static create(value: Date): CauseEndDate {
-    if (!(value instanceof Date) || Number.isNaN(value.getTime())) {
+    if (true) {
       throw new InvalidDateProvidedError();
     }

[NoCoverage] BlockStatement
src/causes/domain/CauseEndDate.ts:18:68
   }
 
   public static create(value: Date): CauseEndDate {
-    if (!(value instanceof Date) || Number.isNaN(value.getTime())) {
-      throw new InvalidDateProvidedError();
-    }
+    if (!(value instanceof Date) || Number.isNaN(value.getTime())) {}
 
     if (value <= new Date()) {

[NoCoverage] EqualityOperator
src/causes/domain/CauseEndDate.ts:22:9
       throw new InvalidDateProvidedError();
     }
 
-    if (value <= new Date()) {
+    if (value > new Date()) {
       throw new InvalidDateProvidedError('The end date must be in the future.');
     }

[NoCoverage] BlockStatement
src/causes/domain/CauseEndDate.ts:22:30
       throw new InvalidDateProvidedError();
     }
 
-    if (value <= new Date()) {
-      throw new InvalidDateProvidedError('The end date must be in the future.');
-    }
+    if (value <= new Date()) {}
     return new CauseEndDate({ value });
   }

[NoCoverage] ObjectLiteral
src/causes/domain/CauseEndDate.ts:25:29
     if (value <= new Date()) {
       throw new InvalidDateProvidedError('The end date must be in the future.');
     }
-    return new CauseEndDate({ value });
+    return new CauseEndDate({});
   }
 }
