[NoCoverage] BlockStatement
src/causes/exceptions/action-already-exists.error.ts:12:33
 import { BaseDomainError } from '@common-lib/common-lib/core/exceptions/base-domain.error';
 
 export class ActionAlreadyExistsError extends BaseDomainError {
-  constructor(actionId: string) {
-    super(
-      `The action with ID ${actionId} is already associated with this cause.`,
-    );
-  }
+  constructor(actionId: string) {}
 }
 
