[NoCoverage] BlockStatement
src/causes/exceptions/supporter-already-exists.error.ts:12:31
 import { BaseDomainError } from '@common-lib/common-lib/core/exceptions/base-domain.error';
 
 export class SupporterAlreadyExistsError extends BaseDomainError {
-  constructor(userId: string) {
-    super(`The user with ID ${userId} is already a supporter of this cause.`);
-  }
+  constructor(userId: string) {}
 }
 

[NoCoverage] StringLiteral
src/causes/exceptions/supporter-already-exists.error.ts:13:11
 
 export class SupporterAlreadyExistsError extends BaseDomainError {
   constructor(userId: string) {
-    super(`The user with ID ${userId} is already a supporter of this cause.`);
+    super(``);
   }
 }
