[NoCoverage] BlockStatement
src/causes/infra/cause.repository.mongodb.ts:24:59
     super();
   }
 
-  async save(entity: Domain.Cause): Promise<Domain.Cause> {
-    const persistenceCause = CauseMapper.toPersistence(entity);
-
-    try {
-      const doc = await this.causeModel
-        .findOneAndUpdate(
-          { id: persistenceCause.id }, // Search by id
-          persistenceCause, // Data to store
-          { upsert: true, new: true }, // Create if not found, return updated doc
-        )
-        .exec();
-
-      return CauseMapper.toDomain(doc);
-    } catch (error) {
-      throw new Error(
-        `[CauseRepositoryMongoDB] Error saving Cause: ${error.message}`,
-      );
-    }
-  }
+  async save(entity: Domain.Cause): Promise<Domain.Cause> {}
 
   async findById(id: string): Promise<Domain.Cause> {

[NoCoverage] BlockStatement
src/causes/infra/cause.repository.mongodb.ts:27:9
   async save(entity: Domain.Cause): Promise<Domain.Cause> {
     const persistenceCause = CauseMapper.toPersistence(entity);
 
-    try {
-      const doc = await this.causeModel
-        .findOneAndUpdate(
-          { id: persistenceCause.id }, // Search by id
-          persistenceCause, // Data to store
-          { upsert: true, new: true }, // Create if not found, return updated doc
-        )
-        .exec();
-
-      return CauseMapper.toDomain(doc);
-    } catch (error) {
+    try {} catch (error) {
       throw new Error(
         `[CauseRepositoryMongoDB] Error saving Cause: ${error.message}`,

[NoCoverage] ObjectLiteral
src/causes/infra/cause.repository.mongodb.ts:30:11
     try {
       const doc = await this.causeModel
         .findOneAndUpdate(
-          { id: persistenceCause.id }, // Search by id
+          {}, // Search by id
           persistenceCause, // Data to store
           { upsert: true, new: true }, // Create if not found, return updated doc

[NoCoverage] BooleanLiteral
src/causes/infra/cause.repository.mongodb.ts:32:32
         .findOneAndUpdate(
           { id: persistenceCause.id }, // Search by id
           persistenceCause, // Data to store
-          { upsert: true, new: true }, // Create if not found, return updated doc
+          { upsert: true, new: false }, // Create if not found, return updated doc
         )
         .exec();

[NoCoverage] BooleanLiteral
src/causes/infra/cause.repository.mongodb.ts:32:21
         .findOneAndUpdate(
           { id: persistenceCause.id }, // Search by id
           persistenceCause, // Data to store
-          { upsert: true, new: true }, // Create if not found, return updated doc
+          { upsert: false, new: true }, // Create if not found, return updated doc
         )
         .exec();

[NoCoverage] BlockStatement
src/causes/infra/cause.repository.mongodb.ts:37:21
         .exec();
 
       return CauseMapper.toDomain(doc);
-    } catch (error) {
-      throw new Error(
-        `[CauseRepositoryMongoDB] Error saving Cause: ${error.message}`,
-      );
-    }
+    } catch (error) {}
   }
 

[NoCoverage] StringLiteral
src/causes/infra/cause.repository.mongodb.ts:39:9
       return CauseMapper.toDomain(doc);
     } catch (error) {
       throw new Error(
-        `[CauseRepositoryMongoDB] Error saving Cause: ${error.message}`,
+        ``,
       );
     }

[NoCoverage] BlockStatement
src/causes/infra/cause.repository.mongodb.ts:44:53
     }
   }
 
-  async findById(id: string): Promise<Domain.Cause> {
-    const cause = await this.causeModel.findOne({ id }).exec();
-
-    if (!cause) {
-      throw new EntityNotFoundError(`Cause with id ${id} not found.`);
-    }
-
-    return CauseMapper.toDomain(cause);
-  }
+  async findById(id: string): Promise<Domain.Cause> {}
 
   async findAll(

[NoCoverage] ObjectLiteral
src/causes/infra/cause.repository.mongodb.ts:45:49
   }
 
   async findById(id: string): Promise<Domain.Cause> {
-    const cause = await this.causeModel.findOne({ id }).exec();
+    const cause = await this.causeModel.findOne({}).exec();
 
     if (!cause) {

[NoCoverage] ConditionalExpression
src/causes/infra/cause.repository.mongodb.ts:47:9
   async findById(id: string): Promise<Domain.Cause> {
     const cause = await this.causeModel.findOne({ id }).exec();
 
-    if (!cause) {
+    if (false) {
       throw new EntityNotFoundError(`Cause with id ${id} not found.`);
     }

[NoCoverage] BlockStatement
src/causes/infra/cause.repository.mongodb.ts:47:17
   async findById(id: string): Promise<Domain.Cause> {
     const cause = await this.causeModel.findOne({ id }).exec();
 
-    if (!cause) {
-      throw new EntityNotFoundError(`Cause with id ${id} not found.`);
-    }
+    if (!cause) {}
 
     return CauseMapper.toDomain(cause);

[NoCoverage] BlockStatement
src/causes/infra/cause.repository.mongodb.ts:58:30
     filter: CauseFilter,
     sort: CauseSort,
     pagination: PaginationParams,
-  ): Promise<Domain.Cause[]> {
-    const causes = await this.causeModel
-      .find(filter)
-      .sort(sort)
-      .skip(pagination.skip)
-      .limit(pagination.limit)
-      .exec();
-
-    return causes.map(CauseMapper.toDomain);
-  }
+  ): Promise<Domain.Cause[]> {}
 
   async countDocuments(filter: CauseFilter): Promise<number> {

[NoCoverage] MethodExpression
src/causes/infra/cause.repository.mongodb.ts:59:26
     sort: CauseSort,
     pagination: PaginationParams,
   ): Promise<Domain.Cause[]> {
-    const causes = await this.causeModel
-      .find(filter)
-      .sort(sort)
+    const causes = await this.causeModel.find(filter)
       .skip(pagination.skip)
       .limit(pagination.limit)

[NoCoverage] BlockStatement
src/causes/infra/cause.repository.mongodb.ts:69:62
     return causes.map(CauseMapper.toDomain);
   }
 
-  async countDocuments(filter: CauseFilter): Promise<number> {
-    return this.causeModel.countDocuments(filter).exec();
-  }
+  async countDocuments(filter: CauseFilter): Promise<number> {}
 }
 
