[NoCoverage] LogicalOperator
causes/infra/filters/cause-domain-exception.filter.ts:49:7
     const response = ctx.getResponse<Response>();
 
     const status =
-      this.exceptionStatusMap.get(
-        exception.constructor as ExceptionConstructor,
-      ) || HttpStatus.INTERNAL_SERVER_ERROR;
+      this.exceptionStatusMap.get(exception.constructor as ExceptionConstructor) && HttpStatus.INTERNAL_SERVER_ERROR;
     const message = exception.message || 'Internal server error';
 

[NoCoverage] LogicalOperator
causes/infra/filters/cause-domain-exception.filter.ts:52:21
       this.exceptionStatusMap.get(
         exception.constructor as ExceptionConstructor,
       ) || HttpStatus.INTERNAL_SERVER_ERROR;
-    const message = exception.message || 'Internal server error';
+    const message = exception.message && 'Internal server error';
 
     response.status(status).json({

[NoCoverage] ObjectLiteral
causes/infra/filters/cause-domain-exception.filter.ts:54:34
       ) || HttpStatus.INTERNAL_SERVER_ERROR;
     const message = exception.message || 'Internal server error';
 
-    response.status(status).json({
-      statusCode: status,
-      message,
-      timestamp: new Date().toISOString(),
-    });
+    response.status(status).json({});
   }
 }
