[NoCoverage] BlockStatement
causes/infra/filters/cause-query.builder.ts:40:45
     limit: PaginationDefaults.DEFAULT_LIMIT,
   };
 
-  addOdsFilter(odsFilter?: ODSEnum[]): this {
-    if (odsFilter && odsFilter.length > 0) {
-      this.filter.ods = { $in: odsFilter };
-    }
-    return this;
-  }
+  addOdsFilter(odsFilter?: ODSEnum[]): this {}
 
   addNameFilter(nameFilter?: string): this {

[NoCoverage] BlockStatement
causes/infra/filters/cause-query.builder.ts:41:44
   };
 
   addOdsFilter(odsFilter?: ODSEnum[]): this {
-    if (odsFilter && odsFilter.length > 0) {
-      this.filter.ods = { $in: odsFilter };
-    }
+    if (odsFilter && odsFilter.length > 0) {}
     return this;
   }

[NoCoverage] ConditionalExpression
causes/infra/filters/cause-query.builder.ts:41:9
   };
 
   addOdsFilter(odsFilter?: ODSEnum[]): this {
-    if (odsFilter && odsFilter.length > 0) {
+    if (true) {
       this.filter.ods = { $in: odsFilter };
     }

[NoCoverage] BlockStatement
causes/infra/filters/cause-query.builder.ts:48:21
   }
 
   addNameFilter(nameFilter?: string): this {
-    if (nameFilter) {
-      this.filter.title = { $regex: nameFilter, $options: 'i' };
-    }
+    if (nameFilter) {}
     return this;
   }

[NoCoverage] ConditionalExpression
causes/infra/filters/cause-query.builder.ts:58:9
     sortBy?: CauseSortBy,
     sortDirection: SortDirection = SortDirection.ASC,
   ): this {
-    if (sortBy) {
+    if (true) {
       this.sort[sortBy] = sortDirection === SortDirection.DESC ? -1 : 1;
     }

[NoCoverage] ObjectLiteral
causes/infra/filters/cause-query.builder.ts:79:23
 
     const skip = (validatedPage - 1) * validatedLimit;
 
-    this.pagination = { skip, limit: validatedLimit };
+    this.pagination = {};
     return this;
   }

[NoCoverage] BlockStatement
causes/infra/filters/cause-query.builder.ts:83:30
     return this;
   }
 
-  buildFilter(): CauseFilter {
-    return this.filter;
-  }
+  buildFilter(): CauseFilter {}
 
   buildSort(): CauseSort {

[NoCoverage] BlockStatement
causes/infra/filters/cause-query.builder.ts:87:26
     return this.filter;
   }
 
-  buildSort(): CauseSort {
-    return this.sort;
-  }
+  buildSort(): CauseSort {}
 
   buildPagination(): PaginationParams {
