[NoCoverage] BlockStatement
src/communities/application/community.controller.ts:62:26
       userId,
     );
 
-    if (result.isLeft()) {
-      const error = result.value;
-
-      // Handle the error
-      switch (error.constructor) {
-        case Exceptions.CommunityNotFound:
-          res.status(HttpStatus.NOT_FOUND);
-          res.json({ errors: { message: error.errorValue().message } });
-          res.send();
-          return;
-        default:
-          res.status(HttpStatus.INTERNAL_SERVER_ERROR);
-          res.json({ errors: { message: error.errorValue().message } });
-          res.send();
-      }
-    } else {
+    if (result.isLeft()) {} else {
       // Return the community
       const causeId = result.value;

[NoCoverage] ConditionalExpression
src/communities/application/community.controller.ts:62:9
       userId,
     );
 
-    if (result.isLeft()) {
+    if (false) {
       const error = result.value;
 

[NoCoverage] ConditionalExpression
src/communities/application/community.controller.ts:67:9
 
       // Handle the error
       switch (error.constructor) {
-        case Exceptions.CommunityNotFound:
-          res.status(HttpStatus.NOT_FOUND);
-          res.json({ errors: { message: error.errorValue().message } });
-          res.send();
-          return;
+        case Exceptions.CommunityNotFound:
         default:
           res.status(HttpStatus.INTERNAL_SERVER_ERROR);

[NoCoverage] ObjectLiteral
src/communities/application/community.controller.ts:69:20
       switch (error.constructor) {
         case Exceptions.CommunityNotFound:
           res.status(HttpStatus.NOT_FOUND);
-          res.json({ errors: { message: error.errorValue().message } });
+          res.json({});
           res.send();
           return;

[NoCoverage] ConditionalExpression
src/communities/application/community.controller.ts:72:9
           res.json({ errors: { message: error.errorValue().message } });
           res.send();
           return;
-        default:
-          res.status(HttpStatus.INTERNAL_SERVER_ERROR);
-          res.json({ errors: { message: error.errorValue().message } });
-          res.send();
+        default:
       }
     } else {

[NoCoverage] ObjectLiteral
src/communities/application/community.controller.ts:74:30
           return;
         default:
           res.status(HttpStatus.INTERNAL_SERVER_ERROR);
-          res.json({ errors: { message: error.errorValue().message } });
+          res.json({ errors: {} });
           res.send();
       }

[NoCoverage] BlockStatement
src/communities/application/community.controller.ts:77:12
           res.json({ errors: { message: error.errorValue().message } });
           res.send();
       }
-    } else {
-      // Return the community
-      const causeId = result.value;
-
-      const location = `/causes/${causeId.getValue().toString()}`;
-      res.status(HttpStatus.OK);
-      res.location(location);
-      res.send();
-    }
+    } else {}
   }
 

[NoCoverage] StringLiteral
src/communities/application/community.controller.ts:81:24
       // Return the community
       const causeId = result.value;
 
-      const location = `/causes/${causeId.getValue().toString()}`;
+      const location = ``;
       res.status(HttpStatus.OK);
       res.location(location);

[NoCoverage] ConditionalExpression
src/communities/application/community.controller.ts:106:9
       causeOds: createCommunityDto.cause.ods,
     });
 
-    if (result.isLeft()) {
+    if (true) {
       const error = result.value;
 

[NoCoverage] ConditionalExpression
src/communities/application/community.controller.ts:111:9
 
       // Handle the error
       switch (error.constructor) {
-        case Exceptions.CommunityNameIsTaken:
-          res.status(HttpStatus.CONFLICT);
-          res.json({ errors: { message: error.errorValue().message } });
-          res.send();
-          return;
+        case Exceptions.CommunityNameIsTaken:
         case Exceptions.InvalidDateProvided:
           res.status(HttpStatus.BAD_REQUEST);

[NoCoverage] ConditionalExpression
src/communities/application/community.controller.ts:116:9
           res.json({ errors: { message: error.errorValue().message } });
           res.send();
           return;
-        case Exceptions.InvalidDateProvided:
-          res.status(HttpStatus.BAD_REQUEST);
-          res.json({ errors: { message: error.errorValue().message } });
-          res.send();
-          return;
+        case Exceptions.InvalidDateProvided:
         default:
           res.status(HttpStatus.INTERNAL_SERVER_ERROR);

[NoCoverage] BlockStatement
src/communities/application/community.controller.ts:126:12
           res.json({ errors: { message: error.errorValue().message } });
           res.send();
       }
-    } else {
-      // Return the location of the created resource
-      const request = result.value;
-
-      const location = `/communities/creation-requests/${request.getValue().id.toString()}`;
-      res.status(HttpStatus.CREATED);
-      res.location(location);
-      res.send();
-    }
+    } else {}
   }
 

[NoCoverage] StringLiteral
src/communities/application/community.controller.ts:130:24
       // Return the location of the created resource
       const request = result.value;
 
-      const location = `/communities/creation-requests/${request.getValue().id.toString()}`;
+      const location = ``;
       res.status(HttpStatus.CREATED);
       res.location(location);

[NoCoverage] EqualityOperator
src/communities/application/community.controller.ts:158:7
 
     // Create the paginated response
     const response = new PaginatedResponseDto(
-      data.length > 0 ? data.map(CommunityMapper.toDto) : [],
+      data.length <= 0 ? data.map(CommunityMapper.toDto) : [],
       total,
       page,

[NoCoverage] EqualityOperator
src/communities/application/community.controller.ts:158:7
 
     // Create the paginated response
     const response = new PaginatedResponseDto(
-      data.length > 0 ? data.map(CommunityMapper.toDto) : [],
+      data.length >= 0 ? data.map(CommunityMapper.toDto) : [],
       total,
       page,

[NoCoverage] ObjectLiteral
src/communities/application/community.controller.ts:188:30
       switch (error.constructor) {
         case Exceptions.CommunityNotFound:
           res.status(HttpStatus.NOT_FOUND);
-          res.json({ errors: { message: error.errorValue().message } });
+          res.json({ errors: {} });
           res.send();
           return;

[NoCoverage] BlockStatement
src/communities/application/community.controller.ts:196:12
           res.json({ errors: { message: error.errorValue().message } });
           res.send();
       }
-    } else {
-      // Return the community
-      const community = result.value.getValue();
-
-      res.status(HttpStatus.OK);
-      res.json({
-        data: CommunityMapper.toDto(community),
-      });
-      res.send();
-    }
+    } else {}
   }
 

[NoCoverage] ObjectLiteral
src/communities/application/community.controller.ts:201:16
       const community = result.value.getValue();
 
       res.status(HttpStatus.OK);
-      res.json({
-        data: CommunityMapper.toDto(community),
-      });
+      res.json({});
       res.send();
     }

[NoCoverage] BlockStatement
src/communities/application/community.controller.ts:240:12
           res.json({ errors: { message: error.errorValue().message } });
           res.send();
       }
-    } else {
-      const { data, total } = result.value;
-      // Build the base URL for the paginated response
-      const baseUrl = `${req.protocol}://${req.get('host')}${req.path}`;
-
-      // Create the paginated response
-      const response = new PaginatedResponseDto(
-        data,
-        total,
-        page,
-        limit,
-        baseUrl,
-      );
-
-      // Send the response
-      res.status(HttpStatus.OK);
-      res.json(response);
-      res.send();
-    }
+    } else {}
   }
 

[NoCoverage] ConditionalExpression
src/communities/application/community.controller.ts:335:9
           res.json({ errors: { message: error.errorValue().message } });
           res.send();
           return;
-        case Exceptions.JoinCommunityRequestAlreadyExists:
-          res.status(HttpStatus.CONFLICT);
-          res.json({ errors: { message: error.errorValue().message } });
-          res.send();
-          return;
+        case Exceptions.JoinCommunityRequestAlreadyExists:
         case Exceptions.UserIsAlreadyMember:
           res.status(HttpStatus.CONFLICT);

[NoCoverage] ObjectLiteral
src/communities/application/community.controller.ts:337:20
           return;
         case Exceptions.JoinCommunityRequestAlreadyExists:
           res.status(HttpStatus.CONFLICT);
-          res.json({ errors: { message: error.errorValue().message } });
+          res.json({});
           res.send();
           return;

[NoCoverage] ConditionalExpression
src/communities/application/community.controller.ts:340:9
           res.json({ errors: { message: error.errorValue().message } });
           res.send();
           return;
-        case Exceptions.UserIsAlreadyMember:
-          res.status(HttpStatus.CONFLICT);
-          res.json({ errors: { message: error.errorValue().message } });
-          res.send();
-          return;
+        case Exceptions.UserIsAlreadyMember:
         case Exceptions.JoinCommunityRequestDenied:
           res.status(HttpStatus.CONFLICT);

[NoCoverage] ConditionalExpression
src/communities/application/community.controller.ts:345:9
           res.json({ errors: { message: error.errorValue().message } });
           res.send();
           return;
-        case Exceptions.JoinCommunityRequestDenied:
-          res.status(HttpStatus.CONFLICT);
-          res.json({ errors: { message: error.errorValue().message } });
-          res.send();
-          return;
+        case Exceptions.JoinCommunityRequestDenied:
         default:
           res.status(HttpStatus.INTERNAL_SERVER_ERROR);

[NoCoverage] ObjectLiteral
src/communities/application/community.controller.ts:347:30
           return;
         case Exceptions.JoinCommunityRequestDenied:
           res.status(HttpStatus.CONFLICT);
-          res.json({ errors: { message: error.errorValue().message } });
+          res.json({ errors: {} });
           res.send();
           return;

[NoCoverage] ObjectLiteral
src/communities/application/community.controller.ts:352:20
           return;
         default:
           res.status(HttpStatus.INTERNAL_SERVER_ERROR);
-          res.json({ errors: { message: error.errorValue().message } });
+          res.json({});
           res.send();
       }

[NoCoverage] BlockStatement
src/communities/application/community.controller.ts:355:12
           res.json({ errors: { message: error.errorValue().message } });
           res.send();
       }
-    } else {
-      const request = result.value.getValue();
-
-      const location = `/communities/${communityId}/join-requests/${request.id.toString()}`;
-      res.status(HttpStatus.CREATED);
-      res.location(location);
-      res.send();
-    }
+    } else {}
   }
 

[NoCoverage] EqualityOperator
src/communities/application/community.controller.ts:380:9
       communityId,
     );
 
-    if (isCommunityAdmin === false) {
+    if (isCommunityAdmin !== false) {
       res.status(HttpStatus.UNAUTHORIZED);
       res.json({

[NoCoverage] BooleanLiteral
src/communities/application/community.controller.ts:380:30
       communityId,
     );
 
-    if (isCommunityAdmin === false) {
+    if (isCommunityAdmin === true) {
       res.status(HttpStatus.UNAUTHORIZED);
       res.json({

[NoCoverage] StringLiteral
src/communities/application/community.controller.ts:384:20
       res.status(HttpStatus.UNAUTHORIZED);
       res.json({
         errors: {
-          message: `The user with ID ${userId} is not an admin of the community with ID ${communityId}.`,
+          message: ``,
         },
       });

[NoCoverage] ConditionalExpression
src/communities/application/community.controller.ts:405:7
 
     // Create the paginated response
     const response = new PaginatedResponseDto(
-      data.length > 0 ? data.map(JoinCommunityRequestMapper.toDto) : [],
+      false ? data.map(JoinCommunityRequestMapper.toDto) : [],
       total,
       page,

[NoCoverage] EqualityOperator
src/communities/application/community.controller.ts:405:7
 
     // Create the paginated response
     const response = new PaginatedResponseDto(
-      data.length > 0 ? data.map(JoinCommunityRequestMapper.toDto) : [],
+      data.length <= 0 ? data.map(JoinCommunityRequestMapper.toDto) : [],
       total,
       page,

[NoCoverage] ConditionalExpression
src/communities/application/community.controller.ts:432:9
       communityId,
     );
 
-    if (isCommunityAdmin === false) {
+    if (false) {
       res.status(HttpStatus.UNAUTHORIZED);
       res.json({

[NoCoverage] ObjectLiteral
src/communities/application/community.controller.ts:435:17
     if (isCommunityAdmin === false) {
       res.status(HttpStatus.UNAUTHORIZED);
       res.json({
-        errors: {
-          message: `The user with ID ${userId} is not an admin of the community with ID ${communityId}.`,
-        },
+        errors: {},
       });
       res.send();

[NoCoverage] BlockStatement
src/communities/application/community.controller.ts:447:26
     const result =
       await this.joinCommunityService.getJoinCommunityRequest(requestId);
 
-    if (result.isLeft()) {
-      const error = result.value;
-
-      // Return the error
-      switch (error.constructor) {
-        case Exceptions.JoinCommunityRequestNotFound:
-          res.status(HttpStatus.NOT_FOUND);
-          res.json({ errors: { message: error.errorValue().message } });
-          res.send();
-          return;
-        default:
-          res.status(HttpStatus.INTERNAL_SERVER_ERROR);
-          res.json({ errors: { message: error.errorValue().message } });
-          res.send();
-      }
-    } else {
+    if (result.isLeft()) {} else {
       const request = result.value.getValue();
 

[NoCoverage] ConditionalExpression
src/communities/application/community.controller.ts:452:9
 
       // Return the error
       switch (error.constructor) {
-        case Exceptions.JoinCommunityRequestNotFound:
-          res.status(HttpStatus.NOT_FOUND);
-          res.json({ errors: { message: error.errorValue().message } });
-          res.send();
-          return;
+        case Exceptions.JoinCommunityRequestNotFound:
         default:
           res.status(HttpStatus.INTERNAL_SERVER_ERROR);

[NoCoverage] BlockStatement
src/communities/application/community.controller.ts:462:12
           res.json({ errors: { message: error.errorValue().message } });
           res.send();
       }
-    } else {
-      const request = result.value.getValue();
-
-      // Return the request
-      res.status(HttpStatus.OK);
-      res.json({
-        data: JoinCommunityRequestMapper.toDto(request),
-      });
-      res.send();
-    }
+    } else {}
   }
 

[NoCoverage] BlockStatement
src/communities/application/community.controller.ts:488:37
       communityId,
     );
 
-    if (isCommunityAdmin === false) {
-      res.status(HttpStatus.UNAUTHORIZED);
-      res.json({
-        errors: {
-          message: `The user with ID ${userId} is not an admin of the community with ID ${communityId}.`,
-        },
-      });
-      res.send();
-      return;
-    }
+    if (isCommunityAdmin === false) {}
 
     // Call the service to accept the request

[NoCoverage] ConditionalExpression
src/communities/application/community.controller.ts:516:9
           res.json({ errors: { message: error.errorValue().message } });
           res.send();
           return;
-        case Exceptions.CommentIsMandatory:
-          res.status(HttpStatus.BAD_REQUEST);
-          res.json({ errors: { message: error.errorValue().message } });
-          res.send();
-          return;
+        case Exceptions.CommentIsMandatory:
         default:
           res.status(HttpStatus.INTERNAL_SERVER_ERROR);

[NoCoverage] BlockStatement
src/communities/application/community.controller.ts:526:12
           res.json({ errors: { message: error.errorValue().message } });
           res.send();
       }
-    } else {
-      // Return the success
-      res.status(HttpStatus.CREATED);
-      res.send();
-    }
+    } else {}
   }
 

[NoCoverage] ConditionalExpression
src/communities/application/community.controller.ts:557:7
 
     // Create the paginated response
     const response = new PaginatedResponseDto(
-      data.length > 0 ? data.map(CreateCommunityRequestMapper.toDto) : [],
+      false ? data.map(CreateCommunityRequestMapper.toDto) : [],
       total,
       page,

[NoCoverage] ConditionalExpression
src/communities/application/community.controller.ts:557:7
 
     // Create the paginated response
     const response = new PaginatedResponseDto(
-      data.length > 0 ? data.map(CreateCommunityRequestMapper.toDto) : [],
+      true ? data.map(CreateCommunityRequestMapper.toDto) : [],
       total,
       page,

[NoCoverage] BlockStatement
src/communities/application/community.controller.ts:581:26
     const result =
       await this.createCommunityService.getCreateCommunityRequest(id);
 
-    if (result.isLeft()) {
-      const error = result.value;
-
-      switch (error.constructor) {
-        case Exceptions.CreateCommunityRequestNotFound:
-          res.status(HttpStatus.NOT_FOUND);
-          res.json({ errors: { message: error.errorValue().message } });
-          res.send();
-          return;
-        default:
-          res.status(HttpStatus.INTERNAL_SERVER_ERROR);
-          res.json({ errors: { message: error.errorValue().message } });
-          res.send();
-      }
-    } else {
+    if (result.isLeft()) {} else {
       const request = result.value.getValue();
 

[NoCoverage] ConditionalExpression
src/communities/application/community.controller.ts:585:9
       const error = result.value;
 
       switch (error.constructor) {
-        case Exceptions.CreateCommunityRequestNotFound:
-          res.status(HttpStatus.NOT_FOUND);
-          res.json({ errors: { message: error.errorValue().message } });
-          res.send();
-          return;
+        case Exceptions.CreateCommunityRequestNotFound:
         default:
           res.status(HttpStatus.INTERNAL_SERVER_ERROR);

[NoCoverage] BlockStatement
src/communities/application/community.controller.ts:595:12
           res.json({ errors: { message: error.errorValue().message } });
           res.send();
       }
-    } else {
-      const request = result.value.getValue();
-
-      res.status(HttpStatus.OK);
-      res.json({
-        data: CreateCommunityRequestMapper.toDto(request),
-      });
-      res.send();
-    }
+    } else {}
   }
 

[NoCoverage] BlockStatement
src/communities/application/community.controller.ts:641:12
           res.json({ errors: { message: error.errorValue().message } });
           res.send();
       }
-    } else {
-      const newCommunity = result.value.getValue();
-
-      if (!newCommunity) {
-        res.status(HttpStatus.OK);
-        res.send();
-        return;
-      }
-
-      const location = `/communities/${newCommunity.id.toString()}`;
-      res.status(HttpStatus.CREATED);
-      res.location(location);
-      res.send();
-    }
+    } else {}
   }
 }

[NoCoverage] BlockStatement
src/communities/application/community.controller.ts:644:26
     } else {
       const newCommunity = result.value.getValue();
 
-      if (!newCommunity) {
-        res.status(HttpStatus.OK);
-        res.send();
-        return;
-      }
+      if (!newCommunity) {}
 
       const location = `/communities/${newCommunity.id.toString()}`;

[NoCoverage] ConditionalExpression
src/communities/application/community.controller.ts:644:11
     } else {
       const newCommunity = result.value.getValue();
 
-      if (!newCommunity) {
+      if (true) {
         res.status(HttpStatus.OK);
         res.send();
