[Killed] BlockStatement
src/communities/application/community.service.impl.ts:25:78
 
   async getCommunity(
     id: string,
-  ): Promise<Either<Exceptions.CommunityNotFound, Result<Domain.Community>>> {
-    const community = await this.communityRepository.findById(id);
-
-    if (!community) {
-      return left(Exceptions.CommunityNotFound.create(id));
-    }
-
-    return right(Result.ok(community));
-  }
+  ): Promise<Either<Exceptions.CommunityNotFound, Result<Domain.Community>>> {}
 
   async getCommunityMembers(
killedBy: CommunityService getCommunity should return the community
statusReason: TypeError: Cannot read properties of undefined (reading 'value')

[Killed] BlockStatement
src/communities/application/community.service.impl.ts:28:21
   ): Promise<Either<Exceptions.CommunityNotFound, Result<Domain.Community>>> {
     const community = await this.communityRepository.findById(id);
 
-    if (!community) {
-      return left(Exceptions.CommunityNotFound.create(id));
-    }
+    if (!community) {}
 
     return right(Result.ok(community));
killedBy: CommunityService getCommunity should return a CommunityNotFound error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 5

- CommunityNotFound {
-   "_value": undefined,
-   "error": Object {

[Killed] BooleanLiteral
src/communities/application/community.service.impl.ts:28:9
   ): Promise<Either<Exceptions.CommunityNotFound, Result<Domain.Community>>> {
     const community = await this.communityRepository.findById(id);
 
-    if (!community) {
+    if (community) {
       return left(Exceptions.CommunityNotFound.create(id));
     }
killedBy: CommunityService getCommunity should return the community
statusReason: Error: Can't get the value of an error result. Use 'errorValue' instead.

[NoCoverage] BlockStatement
src/communities/application/community.service.impl.ts:41:5
     limit: number = PaginationDefaults.DEFAULT_LIMIT,
   ): Promise<
     Either<Exceptions.CommunityNotFound, { data: string[]; total: number }>
-  > {
-    const community = await this.communityRepository.findById(id);
-
-    if (!community) {
-      return left(Exceptions.CommunityNotFound.create(id));
-    }
-
-    // Validate page and limit
-    const validatedPage = Math.max(page, 1);
-    const validatedLimit = Math.max(limit, 1);
-
-    const total = community.members.length;
-    const skip = (validatedPage - 1) * validatedLimit;
-    const data = community.members.slice(skip, skip + validatedLimit);
-
-    return right({ data, total });
-  }
+  > {}
 
   async getCommunityCauses(

[NoCoverage] ConditionalExpression
src/communities/application/community.service.impl.ts:44:9
   > {
     const community = await this.communityRepository.findById(id);
 
-    if (!community) {
+    if (true) {
       return left(Exceptions.CommunityNotFound.create(id));
     }

[NoCoverage] ArithmeticOperator
src/communities/application/community.service.impl.ts:53:18
     const validatedLimit = Math.max(limit, 1);
 
     const total = community.members.length;
-    const skip = (validatedPage - 1) * validatedLimit;
+    const skip = (validatedPage - 1) / validatedLimit;
     const data = community.members.slice(skip, skip + validatedLimit);
 

[NoCoverage] ArithmeticOperator
src/communities/application/community.service.impl.ts:53:19
     const validatedLimit = Math.max(limit, 1);
 
     const total = community.members.length;
-    const skip = (validatedPage - 1) * validatedLimit;
+    const skip = (validatedPage + 1) * validatedLimit;
     const data = community.members.slice(skip, skip + validatedLimit);
 

[NoCoverage] ArithmeticOperator
src/communities/application/community.service.impl.ts:54:48
 
     const total = community.members.length;
     const skip = (validatedPage - 1) * validatedLimit;
-    const data = community.members.slice(skip, skip + validatedLimit);
+    const data = community.members.slice(skip, skip - validatedLimit);
 
     return right({ data, total });

[NoCoverage] MethodExpression
src/communities/application/community.service.impl.ts:54:18
 
     const total = community.members.length;
     const skip = (validatedPage - 1) * validatedLimit;
-    const data = community.members.slice(skip, skip + validatedLimit);
+    const data = community.members;
 
     return right({ data, total });

[NoCoverage] ObjectLiteral
src/communities/application/community.service.impl.ts:56:18
     const skip = (validatedPage - 1) * validatedLimit;
     const data = community.members.slice(skip, skip + validatedLimit);
 
-    return right({ data, total });
+    return right({});
   }
 

[NoCoverage] BlockStatement
src/communities/application/community.service.impl.ts:65:5
     limit: number = PaginationDefaults.DEFAULT_LIMIT,
   ): Promise<
     Either<Exceptions.CommunityNotFound, { data: string[]; total: number }>
-  > {
-    const community = await this.communityRepository.findById(id);
-
-    if (!community) {
-      return left(Exceptions.CommunityNotFound.create(id));
-    }
-
-    // Validate page and limit
-    const validatedPage = Math.max(page, 1);
-    const validatedLimit = Math.max(limit, 1);
-
-    const total = community.causes.length;
-    const skip = (validatedPage - 1) * validatedLimit;
-    const data = community.causes.slice(skip, skip + validatedLimit);
-
-    return right({ data, total });
-  }
+  > {}
 
   async getCommunities(

[NoCoverage] ArithmeticOperator
src/communities/application/community.service.impl.ts:77:19
     const validatedLimit = Math.max(limit, 1);
 
     const total = community.causes.length;
-    const skip = (validatedPage - 1) * validatedLimit;
+    const skip = (validatedPage + 1) * validatedLimit;
     const data = community.causes.slice(skip, skip + validatedLimit);
 

[NoCoverage] ArithmeticOperator
src/communities/application/community.service.impl.ts:77:18
     const validatedLimit = Math.max(limit, 1);
 
     const total = community.causes.length;
-    const skip = (validatedPage - 1) * validatedLimit;
+    const skip = (validatedPage - 1) / validatedLimit;
     const data = community.causes.slice(skip, skip + validatedLimit);
 

[NoCoverage] ArithmeticOperator
src/communities/application/community.service.impl.ts:78:47
 
     const total = community.causes.length;
     const skip = (validatedPage - 1) * validatedLimit;
-    const data = community.causes.slice(skip, skip + validatedLimit);
+    const data = community.causes.slice(skip, skip - validatedLimit);
 
     return right({ data, total });

[NoCoverage] MethodExpression
src/communities/application/community.service.impl.ts:78:18
 
     const total = community.causes.length;
     const skip = (validatedPage - 1) * validatedLimit;
-    const data = community.causes.slice(skip, skip + validatedLimit);
+    const data = community.causes;
 
     return right({ data, total });

[NoCoverage] BlockStatement
src/communities/application/community.service.impl.ts:87:59
     name?: string,
     page: number = PaginationDefaults.DEFAULT_PAGE,
     limit: number = PaginationDefaults.DEFAULT_LIMIT,
-  ): Promise<{ data: Domain.Community[]; total: number }> {
-    const queryBuilder = new CommunityQueryBuilder()
-      .addNameFilter(name)
-      .addPagination(page, limit);
-
-    const filters = queryBuilder.buildFilter();
-    const pagination = queryBuilder.buildPagination();
-
-    // Use Promise.all to execute both queries in parallel
-    const [data, total] = await Promise.all([
-      this.communityRepository.findAll(filters, pagination), // Get paginated data
-      this.communityRepository.countDocuments(filters), // Count total documents
-    ]);
-
-    return { data, total };
-  }
+  ): Promise<{ data: Domain.Community[]; total: number }> {}
 
   async createCommunityRequest(createCommunityRequest: {

[NoCoverage] ArrayDeclaration
src/communities/application/community.service.impl.ts:96:45
     const pagination = queryBuilder.buildPagination();
 
     // Use Promise.all to execute both queries in parallel
-    const [data, total] = await Promise.all([
-      this.communityRepository.findAll(filters, pagination), // Get paginated data
-      this.communityRepository.countDocuments(filters), // Count total documents
-    ]);
+    const [data, total] = await Promise.all([]);
 
     return { data, total };

[Killed] ConditionalExpression
src/communities/application/community.service.impl.ts:122:9
       createCommunityRequest.causeEndDate,
     );
 
-    if (!isValidEndDate) {
+    if (true) {
       return left(
         Exceptions.InvalidDateProvided.create(
killedBy: CommunityService createCommunityRequest should return the created community request
statusReason: Error: Can't get the value of an error result. Use 'errorValue' instead.

[Killed] BooleanLiteral
src/communities/application/community.service.impl.ts:122:9
       createCommunityRequest.causeEndDate,
     );
 
-    if (!isValidEndDate) {
+    if (isValidEndDate) {
       return left(
         Exceptions.InvalidDateProvided.create(
killedBy: CommunityService createCommunityRequest should return the created community request
statusReason: Error: Can't get the value of an error result. Use 'errorValue' instead.

[Killed] ConditionalExpression
src/communities/application/community.service.impl.ts:135:9
       createCommunityRequest.communityName,
     );
 
-    if (existingCommunity) {
+    if (true) {
       return left(
         Exceptions.CommunityNameIsTaken.create(
killedBy: CommunityService createCommunityRequest should return the created community request
statusReason: Error: Can't get the value of an error result. Use 'errorValue' instead.

[Killed] BlockStatement
src/communities/application/community.service.impl.ts:135:28
       createCommunityRequest.communityName,
     );
 
-    if (existingCommunity) {
-      return left(
-        Exceptions.CommunityNameIsTaken.create(
-          createCommunityRequest.communityName,
-        ),
-      );
-    }
+    if (existingCommunity) {}
 
     // Create the new request
killedBy: CommunityService createCommunityRequest should return a CommunityNameIsTaken error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

- CommunityNameIsTaken {
+ InvalidDateProvided {
    "_value": undefined,

[Survived] ObjectLiteral
src/communities/application/community.service.impl.ts:145:44
 
     // Create the new request
     const newRequest = await this.createCommunityRequestRepository.save(
-      Domain.CreateCommunityRequest.create({
-        userId: createCommunityRequest.userId,
-        communityName: createCommunityRequest.communityName,
-        communityDescription: createCommunityRequest.communityDescription,
-        causeTitle: createCommunityRequest.causeTitle,
-        causeDescription: createCommunityRequest.causeDescription,
-        causeEndDate: createCommunityRequest.causeEndDate,
-        causeOds: createCommunityRequest.causeOds,
-        status: StatusRequest.PENDING,
-        createdAt: new Date(),
-      }),
+      Domain.CreateCommunityRequest.create({}),
     );
 

[NoCoverage] BlockStatement
src/communities/application/community.service.impl.ts:169:68
     endDate: Date,
     communityId: string,
     createdBy: string,
-  ): Promise<Either<Exceptions.CommunityNotFound, Result<string>>> {
-    const community = await this.communityRepository.findById(communityId);
-
-    if (!community) {
-      return left(Exceptions.CommunityNotFound.create(communityId));
-    }
-
-    const causeId = await this.causeService.createCause(
-      title,
-      description,
-      ods,
-      endDate,
-      communityId,
-      createdBy,
-    );
-
-    community.addCause(causeId);
-    await this.communityRepository.save(community);
-
-    return right(Result.ok(causeId));
-  }
+  ): Promise<Either<Exceptions.CommunityNotFound, Result<string>>> {}
 }
 

[NoCoverage] ConditionalExpression
src/communities/application/community.service.impl.ts:172:9
   ): Promise<Either<Exceptions.CommunityNotFound, Result<string>>> {
     const community = await this.communityRepository.findById(communityId);
 
-    if (!community) {
+    if (false) {
       return left(Exceptions.CommunityNotFound.create(communityId));
     }
