[NoCoverage] BlockStatement
src/communities/application/create-community.service.impl.ts:33:72
     statusFilter?: StatusRequest,
     page: number = PaginationDefaults.DEFAULT_PAGE,
     limit: number = PaginationDefaults.DEFAULT_LIMIT,
-  ): Promise<{ data: Domain.CreateCommunityRequest[]; total: number }> {
-    const queryBuilder = new CreateCommunityQueryBuilder()
-      .addStatusFilter(statusFilter)
-      .addCreatedAtFilter(createdAtFilter)
-      .addStatusFilter(statusFilter)
-      .addSort(CreateCommunitySortBy.CREATED_AT, SortDirection.DESC)
-      .addPagination(page, limit);
-
-    const filters = queryBuilder.buildFilter();
-    const sort = queryBuilder.buildSort();
-    const pagination = queryBuilder.buildPagination();
-
-    // Use Promise.all to execute both queries in parallel
-    const [data, total] = await Promise.all([
-      this.createCommunityRequestRepository.findAll(filters, sort, pagination), // Get paginated data
-      this.createCommunityRequestRepository.countDocuments(filters), // Count total documents
-    ]);
-
-    return {
-      data,
-      total,
-    };
-  }
+  ): Promise<{ data: Domain.CreateCommunityRequest[]; total: number }> {}
 
   async getCreateCommunityRequest(

[NoCoverage] ArrayDeclaration
src/communities/application/create-community.service.impl.ts:46:45
     const pagination = queryBuilder.buildPagination();
 
     // Use Promise.all to execute both queries in parallel
-    const [data, total] = await Promise.all([
-      this.createCommunityRequestRepository.findAll(filters, sort, pagination), // Get paginated data
-      this.createCommunityRequestRepository.countDocuments(filters), // Count total documents
-    ]);
+    const [data, total] = await Promise.all([]);
 
     return {

[NoCoverage] BlockStatement
src/communities/application/create-community.service.impl.ts:64:5
       Exceptions.CreateCommunityRequestNotFound,
       Result<Domain.CreateCommunityRequest>
     >
-  > {
-    const createCommunityRequest =
-      await this.createCommunityRequestRepository.findById(id);
-
-    if (!!createCommunityRequest === false) {
-      return left(Exceptions.CreateCommunityRequestNotFound.create(id));
-    }
-
-    return right(Result.ok(createCommunityRequest));
-  }
+  > {}
 
   async validateCreateCommunityRequest(

[NoCoverage] EqualityOperator
src/communities/application/create-community.service.impl.ts:68:9
     const createCommunityRequest =
       await this.createCommunityRequestRepository.findById(id);
 
-    if (!!createCommunityRequest === false) {
+    if (!!createCommunityRequest !== false) {
       return left(Exceptions.CreateCommunityRequestNotFound.create(id));
     }

[NoCoverage] BooleanLiteral
src/communities/application/create-community.service.impl.ts:68:38
     const createCommunityRequest =
       await this.createCommunityRequestRepository.findById(id);
 
-    if (!!createCommunityRequest === false) {
+    if (!!createCommunityRequest === true) {
       return left(Exceptions.CreateCommunityRequestNotFound.create(id));
     }

[NoCoverage] BooleanLiteral
src/communities/application/create-community.service.impl.ts:89:9
     const createCommunityRequest =
       await this.createCommunityRequestRepository.findById(requestId);
 
-    if (!!createCommunityRequest === false) {
+    if (!createCommunityRequest === false) {
       return left(Exceptions.CreateCommunityRequestNotFound.create(requestId));
     }

[NoCoverage] BlockStatement
src/communities/application/create-community.service.impl.ts:89:45
     const createCommunityRequest =
       await this.createCommunityRequestRepository.findById(requestId);
 
-    if (!!createCommunityRequest === false) {
-      return left(Exceptions.CreateCommunityRequestNotFound.create(requestId));
-    }
+    if (!!createCommunityRequest === false) {}
 
     switch (status) {

[NoCoverage] ArrayDeclaration
src/communities/application/create-community.service.impl.ts:108:21
             name: createCommunityRequest.communityName,
             description: createCommunityRequest.communityDescription,
             members: [],
-            causes: [],
+            causes: ["Stryker was here"],
           }),
         );

[NoCoverage] ConditionalExpression
src/communities/application/create-community.service.impl.ts:133:7
         return right(Result.ok(newCommunity));
       }
 
-      case StatusRequest.DENIED:
-        if (comment) {
-          // Update the request
-          createCommunityRequest.status = StatusRequest.DENIED;
-          createCommunityRequest.comment = comment;
-
-          // Save the request
-          this.createCommunityRequestRepository.save(createCommunityRequest);
-        } else {
-          return left(Exceptions.CommentIsMandatory.create());
-        }
-
-        return right(Result.ok<void>());
+      case StatusRequest.DENIED:
 
       default:

[NoCoverage] ConditionalExpression
src/communities/application/create-community.service.impl.ts:134:13
       }
 
       case StatusRequest.DENIED:
-        if (comment) {
+        if (false) {
           // Update the request
           createCommunityRequest.status = StatusRequest.DENIED;

[NoCoverage] ConditionalExpression
src/communities/application/create-community.service.impl.ts:134:13
       }
 
       case StatusRequest.DENIED:
-        if (comment) {
+        if (true) {
           // Update the request
           createCommunityRequest.status = StatusRequest.DENIED;

[NoCoverage] BlockStatement
src/communities/application/create-community.service.impl.ts:141:16
 
           // Save the request
           this.createCommunityRequestRepository.save(createCommunityRequest);
-        } else {
-          return left(Exceptions.CommentIsMandatory.create());
-        }
+        } else {}
 
         return right(Result.ok<void>());
