[NoCoverage] BooleanLiteral
src/communities/application/join-community.service.impl.ts:36:9
   > {
     // Validate community exists
     const community = await this.communityRepository.findById(communityId);
-    if (!community) {
+    if (community) {
       return left(Exceptions.CommunityNotFound.create(communityId));
     }

[NoCoverage] ConditionalExpression
src/communities/application/join-community.service.impl.ts:36:9
   > {
     // Validate community exists
     const community = await this.communityRepository.findById(communityId);
-    if (!community) {
+    if (true) {
       return left(Exceptions.CommunityNotFound.create(communityId));
     }

[NoCoverage] BlockStatement
src/communities/application/join-community.service.impl.ts:47:26
         communityId,
       );
 
-    if (existingRequest) {
-      switch (existingRequest.status) {
-        case StatusRequest.PENDING:
-          return left(
-            Exceptions.JoinCommunityRequestAlreadyExists.create(
-              communityId,
-              userId,
-            ),
-          );
-
-        // Check if the user is already a member of the community
-        case StatusRequest.APPROVED:
-          return left(
-            Exceptions.UserIsAlreadyMember.create(communityId, userId),
-          );
-
-        // Check if the user is not allowed to join the community
-        case StatusRequest.DENIED:
-          return left(
-            Exceptions.JoinCommunityRequestDenied.create(communityId, userId),
-          );
-        default:
-          break;
-      }
-    }
+    if (existingRequest) {}
 
     // Create the new request

[NoCoverage] ConditionalExpression
src/communities/application/join-community.service.impl.ts:47:9
         communityId,
       );
 
-    if (existingRequest) {
+    if (true) {
       switch (existingRequest.status) {
         case StatusRequest.PENDING:

[NoCoverage] ConditionalExpression
src/communities/application/join-community.service.impl.ts:49:9
 
     if (existingRequest) {
       switch (existingRequest.status) {
-        case StatusRequest.PENDING:
-          return left(
-            Exceptions.JoinCommunityRequestAlreadyExists.create(
-              communityId,
-              userId,
-            ),
-          );
+        case StatusRequest.PENDING:
+
+// Check if the user is already a member of the community
 
         // Check if the user is already a member of the community

[NoCoverage] ConditionalExpression
src/communities/application/join-community.service.impl.ts:58:9
           );
 
         // Check if the user is already a member of the community
-        case StatusRequest.APPROVED:
-          return left(
-            Exceptions.UserIsAlreadyMember.create(communityId, userId),
-          );
+        // Check if the user is already a member of the community
+case StatusRequest.APPROVED:
+
+// Check if the user is not allowed to join the community
 
         // Check if the user is not allowed to join the community

[NoCoverage] ConditionalExpression
src/communities/application/join-community.service.impl.ts:64:9
           );
 
         // Check if the user is not allowed to join the community
-        case StatusRequest.DENIED:
-          return left(
-            Exceptions.JoinCommunityRequestDenied.create(communityId, userId),
-          );
+        // Check if the user is not allowed to join the community
+case StatusRequest.DENIED:
         default:
           break;

[NoCoverage] ConditionalExpression
src/communities/application/join-community.service.impl.ts:68:9
           return left(
             Exceptions.JoinCommunityRequestDenied.create(communityId, userId),
           );
-        default:
-          break;
+        default:
       }
     }

[NoCoverage] ObjectLiteral
src/communities/application/join-community.service.impl.ts:75:42
 
     // Create the new request
     const newRequest = this.eventPublisher.mergeObjectContext(
-      Domain.JoinCommunityRequest.create({
-        userId,
-        communityId,
-        adminId: community.adminId,
-        status: StatusRequest.PENDING,
-      }),
+      Domain.JoinCommunityRequest.create({}),
     );
 

[NoCoverage] BlockStatement
src/communities/application/join-community.service.impl.ts:94:70
     communityId: string,
     page: number = PaginationDefaults.DEFAULT_PAGE,
     limit: number = PaginationDefaults.DEFAULT_LIMIT,
-  ): Promise<{ data: Domain.JoinCommunityRequest[]; total: number }> {
-    const queryBuilder = new JoinCommunityQueryBuilder().addPagination(
-      page,
-      limit,
-    );
-
-    const pagination = queryBuilder.buildPagination();
-
-    const [data, total] = await Promise.all([
-      this.joinCommunityRequestRepository.findAll(communityId, pagination), // Get paginated data
-      this.joinCommunityRequestRepository.countDocuments(communityId), // Count total documents
-    ]);
-
-    // Return the requests
-    return { data, total };
-  }
+  ): Promise<{ data: Domain.JoinCommunityRequest[]; total: number }> {}
 
   async getJoinCommunityRequest(

[NoCoverage] BlockStatement
src/communities/application/join-community.service.impl.ts:118:5
       Exceptions.JoinCommunityRequestNotFound,
       Result<Domain.JoinCommunityRequest>
     >
-  > {
-    const joinCommunityRequest =
-      await this.joinCommunityRequestRepository.findById(id);
-
-    if (!joinCommunityRequest) {
-      return left(Exceptions.JoinCommunityRequestNotFound.create(id));
-    }
-
-    return right(Result.ok(joinCommunityRequest));
-  }
+  > {}
 
   async validateJoinCommunityRequest(

[NoCoverage] ConditionalExpression
src/communities/application/join-community.service.impl.ts:122:9
     const joinCommunityRequest =
       await this.joinCommunityRequestRepository.findById(id);
 
-    if (!joinCommunityRequest) {
+    if (false) {
       return left(Exceptions.JoinCommunityRequestNotFound.create(id));
     }

[NoCoverage] BlockStatement
src/communities/application/join-community.service.impl.ts:122:32
     const joinCommunityRequest =
       await this.joinCommunityRequestRepository.findById(id);
 
-    if (!joinCommunityRequest) {
-      return left(Exceptions.JoinCommunityRequestNotFound.create(id));
-    }
+    if (!joinCommunityRequest) {}
 
     return right(Result.ok(joinCommunityRequest));

[NoCoverage] BlockStatement
src/communities/application/join-community.service.impl.ts:142:19
     // Find the join request
     const request =
       await this.joinCommunityRequestRepository.findById(requestId);
-    if (!request) {
-      return left(Exceptions.JoinCommunityRequestNotFound.create(requestId));
-    }
+    if (!request) {}
 
     // Find the associated community

[NoCoverage] BooleanLiteral
src/communities/application/join-community.service.impl.ts:142:9
     // Find the join request
     const request =
       await this.joinCommunityRequestRepository.findById(requestId);
-    if (!request) {
+    if (request) {
       return left(Exceptions.JoinCommunityRequestNotFound.create(requestId));
     }

[NoCoverage] BooleanLiteral
src/communities/application/join-community.service.impl.ts:150:9
     const community = await this.communityRepository.findById(
       request.communityId,
     );
-    if (!community) {
+    if (community) {
       return left(Exceptions.CommunityNotFound.create(request.communityId));
     }

[NoCoverage] BlockStatement
src/communities/application/join-community.service.impl.ts:150:21
     const community = await this.communityRepository.findById(
       request.communityId,
     );
-    if (!community) {
-      return left(Exceptions.CommunityNotFound.create(request.communityId));
-    }
+    if (!community) {}
 
     // Merge request with event publisher

[NoCoverage] BlockStatement
src/communities/application/join-community.service.impl.ts:159:36
       this.eventPublisher.mergeObjectContext(request);
 
     switch (status) {
-      case StatusRequest.APPROVED: {
-        // Update request status and add member to community
-        joinCommunityRequest.status = StatusRequest.APPROVED;
-
-        const updatedCommunity =
-          this.eventPublisher.mergeObjectContext(community);
-        updatedCommunity.addMember(joinCommunityRequest.userId);
-
-        // Save both request and community
-        await Promise.all([
-          this.joinCommunityRequestRepository.save(joinCommunityRequest),
-          this.communityRepository.save(updatedCommunity),
-        ]);
-
-        updatedCommunity.commit();
-        break;
-      }
+      case StatusRequest.APPROVED: {}
 
       case StatusRequest.DENIED: {

[NoCoverage] ConditionalExpression
src/communities/application/join-community.service.impl.ts:159:7
       this.eventPublisher.mergeObjectContext(request);
 
     switch (status) {
-      case StatusRequest.APPROVED: {
-        // Update request status and add member to community
-        joinCommunityRequest.status = StatusRequest.APPROVED;
-
-        const updatedCommunity =
-          this.eventPublisher.mergeObjectContext(community);
-        updatedCommunity.addMember(joinCommunityRequest.userId);
-
-        // Save both request and community
-        await Promise.all([
-          this.joinCommunityRequestRepository.save(joinCommunityRequest),
-          this.communityRepository.save(updatedCommunity),
-        ]);
-
-        updatedCommunity.commit();
-        break;
-      }
+      case StatusRequest.APPROVED:
 
       case StatusRequest.DENIED: {

[NoCoverage] ArrayDeclaration
src/communities/application/join-community.service.impl.ts:168:27
         updatedCommunity.addMember(joinCommunityRequest.userId);
 
         // Save both request and community
-        await Promise.all([
-          this.joinCommunityRequestRepository.save(joinCommunityRequest),
-          this.communityRepository.save(updatedCommunity),
-        ]);
+        await Promise.all([]);
 
         updatedCommunity.commit();

[NoCoverage] BlockStatement
src/communities/application/join-community.service.impl.ts:177:34
         break;
       }
 
-      case StatusRequest.DENIED: {
-        if (!comment) {
-          return left(Exceptions.CommentIsMandatory.create());
-        }
-
-        // Update request status and add denial comment
-        joinCommunityRequest.status = StatusRequest.DENIED;
-        joinCommunityRequest.comment = comment;
-
-        // Save updated request
-        await this.joinCommunityRequestRepository.save(joinCommunityRequest);
-        joinCommunityRequest.commit();
-        break;
-      }
+      case StatusRequest.DENIED: {}
 
       default:

[NoCoverage] ConditionalExpression
src/communities/application/join-community.service.impl.ts:177:7
         break;
       }
 
-      case StatusRequest.DENIED: {
-        if (!comment) {
-          return left(Exceptions.CommentIsMandatory.create());
-        }
-
-        // Update request status and add denial comment
-        joinCommunityRequest.status = StatusRequest.DENIED;
-        joinCommunityRequest.comment = comment;
-
-        // Save updated request
-        await this.joinCommunityRequestRepository.save(joinCommunityRequest);
-        joinCommunityRequest.commit();
-        break;
-      }
+      case StatusRequest.DENIED:
 
       default:

[NoCoverage] ConditionalExpression
src/communities/application/join-community.service.impl.ts:178:13
       }
 
       case StatusRequest.DENIED: {
-        if (!comment) {
+        if (false) {
           return left(Exceptions.CommentIsMandatory.create());
         }

[NoCoverage] BooleanLiteral
src/communities/application/join-community.service.impl.ts:178:13
       }
 
       case StatusRequest.DENIED: {
-        if (!comment) {
+        if (comment) {
           return left(Exceptions.CommentIsMandatory.create());
         }

[NoCoverage] BlockStatement
src/communities/application/join-community.service.impl.ts:202:23
   async isCommunityAdmin(
     userId: string,
     communityId: string,
-  ): Promise<boolean> {
-    return this.communityRepository.isCommunityAdmin(userId, communityId);
-  }
+  ): Promise<boolean> {}
 }
 
