[NoCoverage] BlockStatement
src/communities/domain/Community.ts:24:22
     return this._id;
   }
 
-  get name(): string {
-    return this.props.name;
-  }
+  get name(): string {}
 
   get description(): string {

[NoCoverage] BlockStatement
src/communities/domain/Community.ts:32:25
     return this.props.description;
   }
 
-  get adminId(): string {
-    return this.props.adminId;
-  }
+  get adminId(): string {}
 
   set adminId(value: string) {

[NoCoverage] BlockStatement
src/communities/domain/Community.ts:36:30
     return this.props.adminId;
   }
 
-  set adminId(value: string) {
-    this.props.adminId = value;
-  }
+  set adminId(value: string) {}
 
   get members(): string[] {

[NoCoverage] BlockStatement
src/communities/domain/Community.ts:40:27
     this.props.adminId = value;
   }
 
-  get members(): string[] {
-    return this.props.members;
-  }
+  get members(): string[] {}
 
   set members(value: string[]) {

[NoCoverage] BlockStatement
src/communities/domain/Community.ts:44:32
     return this.props.members;
   }
 
-  set members(value: string[]) {
-    this.props.members = value;
-  }
+  set members(value: string[]) {}
 
   get causes(): string[] {

[NoCoverage] BlockStatement
src/communities/domain/Community.ts:48:26
     this.props.members = value;
   }
 
-  get causes(): string[] {
-    return this.props.causes;
-  }
+  get causes(): string[] {}
 
   set causes(value: string[]) {

[NoCoverage] BlockStatement
src/communities/domain/Community.ts:52:31
     return this.props.causes;
   }
 
-  set causes(value: string[]) {
-    this.props.causes = value;
-  }
+  set causes(value: string[]) {}
 
   static create(props: CommunityProps, id?: UniqueEntityID): Community {

[NoCoverage] BlockStatement
src/communities/domain/Community.ts:58:67
 
   static create(props: CommunityProps, id?: UniqueEntityID): Community {
     const { adminId, name, description, members, causes } = props;
-    if (!adminId || !name || !description || !members || !causes) {
-      MissingPropertiesError.create();
-    }
+    if (!adminId || !name || !description || !members || !causes) {}
     const community = new Community(props, id);
     if (!id) {

[NoCoverage] BlockStatement
src/communities/domain/Community.ts:62:14
       MissingPropertiesError.create();
     }
     const community = new Community(props, id);
-    if (!id) {
-      community.apply(
-        new CommunityCreatedEvent(
-          adminId,
-          community.id.toString(),
-          name,
-          description,
-        ),
-      );
-    }
+    if (!id) {}
     return community;
   }

[NoCoverage] BlockStatement
src/communities/domain/Community.ts:75:37
     return community;
   }
 
-  addMember(memberId: string): void {
-    this.props.members.push(memberId);
-    this.apply(new UserJoinedCommunity(memberId, this.id.toString()));
-  }
+  addMember(memberId: string): void {}
 
   addCause(causeId: string): void {

[NoCoverage] BlockStatement
src/communities/domain/Community.ts:80:35
     this.apply(new UserJoinedCommunity(memberId, this.id.toString()));
   }
 
-  addCause(causeId: string): void {
-    this.props.causes.push(causeId);
-  }
+  addCause(causeId: string): void {}
 }
 
