[NoCoverage] BlockStatement
src/communities/domain/CreateCommunityRequest.ts:31:31
     return this._id;
   }
 
-  get communityName(): string {
-    return this.props.communityName;
-  }
+  get communityName(): string {}
 
   get communityDescription(): string {

[NoCoverage] BlockStatement
src/communities/domain/CreateCommunityRequest.ts:35:38
     return this.props.communityName;
   }
 
-  get communityDescription(): string {
-    return this.props.communityDescription;
-  }
+  get communityDescription(): string {}
 
   get causeTitle(): string {

[NoCoverage] BlockStatement
src/communities/domain/CreateCommunityRequest.ts:39:28
     return this.props.communityDescription;
   }
 
-  get causeTitle(): string {
-    return this.props.causeTitle;
-  }
+  get causeTitle(): string {}
 
   get causeDescription(): string {

[NoCoverage] BlockStatement
src/communities/domain/CreateCommunityRequest.ts:43:34
     return this.props.causeTitle;
   }
 
-  get causeDescription(): string {
-    return this.props.causeDescription;
-  }
+  get causeDescription(): string {}
 
   get causeEndDate(): Date {

[NoCoverage] BlockStatement
src/communities/domain/CreateCommunityRequest.ts:47:28
     return this.props.causeDescription;
   }
 
-  get causeEndDate(): Date {
-    return this.props.causeEndDate;
-  }
+  get causeEndDate(): Date {}
 
   get causeOds(): number[] {

[NoCoverage] BlockStatement
src/communities/domain/CreateCommunityRequest.ts:51:28
     return this.props.causeEndDate;
   }
 
-  get causeOds(): number[] {
-    return this.props.causeOds;
-  }
+  get causeOds(): number[] {}
 
   get status(): StatusRequest {

[NoCoverage] BlockStatement
src/communities/domain/CreateCommunityRequest.ts:55:31
     return this.props.causeOds;
   }
 
-  get status(): StatusRequest {
-    return this.props.status;
-  }
+  get status(): StatusRequest {}
 
   set status(status: StatusRequest) {

[NoCoverage] BlockStatement
src/communities/domain/CreateCommunityRequest.ts:59:37
     return this.props.status;
   }
 
-  set status(status: StatusRequest) {
-    this.props.status = status;
-  }
+  set status(status: StatusRequest) {}
 
   get comment(): string | undefined {

[NoCoverage] BlockStatement
src/communities/domain/CreateCommunityRequest.ts:63:37
     this.props.status = status;
   }
 
-  get comment(): string | undefined {
-    return this.props.comment;
-  }
+  get comment(): string | undefined {}
 
   set comment(comment: string) {

[NoCoverage] BlockStatement
src/communities/domain/CreateCommunityRequest.ts:67:32
     return this.props.comment;
   }
 
-  set comment(comment: string) {
-    this.props.comment = comment;
-  }
+  set comment(comment: string) {}
 
   get userId(): string {

[NoCoverage] BlockStatement
src/communities/domain/CreateCommunityRequest.ts:75:30
     return this.props.userId;
   }
 
-  set userId(userId: string) {
-    this.props.userId = userId;
-  }
+  set userId(userId: string) {}
 
   get createdAt(): Date {

[NoCoverage] BlockStatement
src/communities/domain/CreateCommunityRequest.ts:83:34
     return this.props.createdAt;
   }
 
-  set createdAt(createdAt: Date) {
-    this.props.createdAt = createdAt;
-  }
+  set createdAt(createdAt: Date) {}
 
   static create(

[Survived] LogicalOperator
src/communities/domain/CreateCommunityRequest.ts:102:7
       status,
     } = props;
     if (
-      !userId ||
-      !communityName ||
-      !communityDescription ||
-      !causeTitle ||
-      !causeDescription ||
+      (!userId || !communityName || !communityDescription || !causeTitle) && !causeDescription ||
       !causeEndDate ||
       !causeOds ||

[Survived] LogicalOperator
src/communities/domain/CreateCommunityRequest.ts:102:7
       status,
     } = props;
     if (
-      !userId ||
-      !communityName ||
-      !communityDescription ||
-      !causeTitle ||
+      (!userId || !communityName || !communityDescription) && !causeTitle ||
       !causeDescription ||
       !causeEndDate ||

[Survived] BooleanLiteral
src/communities/domain/CreateCommunityRequest.ts:103:7
     } = props;
     if (
       !userId ||
-      !communityName ||
+      communityName ||
       !communityDescription ||
       !causeTitle ||

[Survived] BooleanLiteral
src/communities/domain/CreateCommunityRequest.ts:104:7
     if (
       !userId ||
       !communityName ||
-      !communityDescription ||
+      communityDescription ||
       !causeTitle ||
       !causeDescription ||

[Survived] BooleanLiteral
src/communities/domain/CreateCommunityRequest.ts:105:7
       !userId ||
       !communityName ||
       !communityDescription ||
-      !causeTitle ||
+      causeTitle ||
       !causeDescription ||
       !causeEndDate ||

[Survived] BooleanLiteral
src/communities/domain/CreateCommunityRequest.ts:106:7
       !communityName ||
       !communityDescription ||
       !causeTitle ||
-      !causeDescription ||
+      causeDescription ||
       !causeEndDate ||
       !causeOds ||

[Survived] BooleanLiteral
src/communities/domain/CreateCommunityRequest.ts:107:7
       !communityDescription ||
       !causeTitle ||
       !causeDescription ||
-      !causeEndDate ||
+      causeEndDate ||
       !causeOds ||
       !status

[Survived] BooleanLiteral
src/communities/domain/CreateCommunityRequest.ts:108:7
       !causeTitle ||
       !causeDescription ||
       !causeEndDate ||
-      !causeOds ||
+      causeOds ||
       !status
     ) {

[Survived] BooleanLiteral
src/communities/domain/CreateCommunityRequest.ts:109:7
       !causeDescription ||
       !causeEndDate ||
       !causeOds ||
-      !status
+      status
     ) {
       MissingPropertiesError.create();

[NoCoverage] BlockStatement
src/communities/domain/CreateCommunityRequest.ts:110:7
       !causeEndDate ||
       !causeOds ||
       !status
-    ) {
-      MissingPropertiesError.create();
-    }
+    ) {}
 
     return new CreateCommunityRequest(props, id);
