[NoCoverage] BlockStatement
src/communities/domain/JoinCommunityRequest.ts:17:78
 }
 
 export class JoinCommunityRequest extends EntityRoot<JoinCommunityRequestProps> {
-  private constructor(props: JoinCommunityRequestProps, id?: UniqueEntityID) {
-    super(props, id);
-  }
+  private constructor(props: JoinCommunityRequestProps, id?: UniqueEntityID) {}
 
   get id(): UniqueEntityID {

[NoCoverage] BlockStatement
src/communities/domain/JoinCommunityRequest.ts:29:37
     return this.props.status;
   }
 
-  set status(status: StatusRequest) {
-    this.props.status = status;
-
-    if (status === StatusRequest.DENIED) {
-      this.apply(
-        new JoinCommunityRequestRejectedEvent(this.userId, this.communityId),
-      );
-    }
-  }
+  set status(status: StatusRequest) {}
 
   get comment(): string | undefined {

[NoCoverage] BlockStatement
src/communities/domain/JoinCommunityRequest.ts:32:42
   set status(status: StatusRequest) {
     this.props.status = status;
 
-    if (status === StatusRequest.DENIED) {
-      this.apply(
-        new JoinCommunityRequestRejectedEvent(this.userId, this.communityId),
-      );
-    }
+    if (status === StatusRequest.DENIED) {}
   }
 

[NoCoverage] EqualityOperator
src/communities/domain/JoinCommunityRequest.ts:32:9
   set status(status: StatusRequest) {
     this.props.status = status;
 
-    if (status === StatusRequest.DENIED) {
+    if (status !== StatusRequest.DENIED) {
       this.apply(
         new JoinCommunityRequestRejectedEvent(this.userId, this.communityId),

[NoCoverage] BlockStatement
src/communities/domain/JoinCommunityRequest.ts:59:40
     return this.props.communityId;
   }
 
-  set communityId(communityId: string) {
-    this.props.communityId = communityId;
-  }
+  set communityId(communityId: string) {}
 
   get adminId(): string {

[NoCoverage] BlockStatement
src/communities/domain/JoinCommunityRequest.ts:70:27
   static create(
     props: JoinCommunityRequestProps,
     id?: UniqueEntityID,
-  ): JoinCommunityRequest {
-    const { userId, communityId, status, adminId } = props;
-    if (!userId || !communityId || !status || !adminId) {
-      MissingPropertiesError.create();
-    }
-    const joinCommunityRequest = new JoinCommunityRequest(props, id);
-    if (!id) {
-      joinCommunityRequest.apply(
-        new JoinCommunityRequestCreatedEvent(userId, communityId, adminId),
-      );
-    }
-    return joinCommunityRequest;
-  }
+  ): JoinCommunityRequest {}
 }
 

[NoCoverage] BooleanLiteral
src/communities/domain/JoinCommunityRequest.ts:72:20
     id?: UniqueEntityID,
   ): JoinCommunityRequest {
     const { userId, communityId, status, adminId } = props;
-    if (!userId || !communityId || !status || !adminId) {
+    if (!userId || communityId || !status || !adminId) {
       MissingPropertiesError.create();
     }

[NoCoverage] LogicalOperator
src/communities/domain/JoinCommunityRequest.ts:72:9
     id?: UniqueEntityID,
   ): JoinCommunityRequest {
     const { userId, communityId, status, adminId } = props;
-    if (!userId || !communityId || !status || !adminId) {
+    if ((!userId || !communityId) && !status || !adminId) {
       MissingPropertiesError.create();
     }

[NoCoverage] BooleanLiteral
src/communities/domain/JoinCommunityRequest.ts:76:9
       MissingPropertiesError.create();
     }
     const joinCommunityRequest = new JoinCommunityRequest(props, id);
-    if (!id) {
+    if (id) {
       joinCommunityRequest.apply(
         new JoinCommunityRequestCreatedEvent(userId, communityId, adminId),

[NoCoverage] BlockStatement
src/communities/domain/JoinCommunityRequest.ts:76:14
       MissingPropertiesError.create();
     }
     const joinCommunityRequest = new JoinCommunityRequest(props, id);
-    if (!id) {
-      joinCommunityRequest.apply(
-        new JoinCommunityRequestCreatedEvent(userId, communityId, adminId),
-      );
-    }
+    if (!id) {}
     return joinCommunityRequest;
   }
