[NoCoverage] BlockStatement
src/communities/exceptions/CommentIsMandatory.ts:5:25
 import { Result } from '@common-lib/common-lib/core/logic/Result';
 
 export class CommentIsMandatory extends Result<DomainError> {
-  private constructor() {
-    super(false, {
-      message: `The comment is mandatory when the request is denied`,
-    });
-  }
+  private constructor() {}
 
   public static create(): CommentIsMandatory {

[NoCoverage] BooleanLiteral
src/communities/exceptions/CommentIsMandatory.ts:6:11
 
 export class CommentIsMandatory extends Result<DomainError> {
   private constructor() {
-    super(false, {
+    super(true, {
       message: `The comment is mandatory when the request is denied`,
     });

[NoCoverage] BlockStatement
src/communities/exceptions/CommentIsMandatory.ts:11:46
     });
   }
 
-  public static create(): CommentIsMandatory {
-    return new CommentIsMandatory();
-  }
+  public static create(): CommentIsMandatory {}
 }
 
