[NoCoverage] BlockStatement
src/communities/exceptions/CreateCommunityRequestNotFound.ts:5:35
 import { Result } from '@common-lib/common-lib/core/logic/Result';
 
 export class CreateCommunityRequestNotFound extends Result<DomainError> {
-  private constructor(id: string) {
-    super(false, {
-      message: `The create community request with id "${id}" does not exist.`,
-    });
-  }
+  private constructor(id: string) {}
 
   public static create(id: string): CreateCommunityRequestNotFound {

[NoCoverage] BooleanLiteral
src/communities/exceptions/CreateCommunityRequestNotFound.ts:6:11
 
 export class CreateCommunityRequestNotFound extends Result<DomainError> {
   private constructor(id: string) {
-    super(false, {
+    super(true, {
       message: `The create community request with id "${id}" does not exist.`,
     });

[NoCoverage] StringLiteral
src/communities/exceptions/CreateCommunityRequestNotFound.ts:7:16
 export class CreateCommunityRequestNotFound extends Result<DomainError> {
   private constructor(id: string) {
     super(false, {
-      message: `The create community request with id "${id}" does not exist.`,
+      message: ``,
     });
   }

[NoCoverage] BlockStatement
src/communities/exceptions/CreateCommunityRequestNotFound.ts:11:68
     });
   }
 
-  public static create(id: string): CreateCommunityRequestNotFound {
-    return new CreateCommunityRequestNotFound(id);
-  }
+  public static create(id: string): CreateCommunityRequestNotFound {}
 }
 
