[NoCoverage] BlockStatement
src/communities/exceptions/InvalidDateProvided.ts:5:35
 import { Result } from '@common-lib/common-lib/core/logic/Result';
 
 export class InvalidDateProvided extends Result<DomainError> {
-  private constructor(date: Date) {
-    super(false, {
-      message: `The provided date is invalid: ${date.toString()}`,
-    });
-  }
+  private constructor(date: Date) {}
 
   public static create(date: Date): InvalidDateProvided {

[NoCoverage] BooleanLiteral
src/communities/exceptions/InvalidDateProvided.ts:6:11
 
 export class InvalidDateProvided extends Result<DomainError> {
   private constructor(date: Date) {
-    super(false, {
+    super(true, {
       message: `The provided date is invalid: ${date.toString()}`,
     });

[NoCoverage] BlockStatement
src/communities/exceptions/InvalidDateProvided.ts:11:57
     });
   }
 
-  public static create(date: Date): InvalidDateProvided {
-    return new InvalidDateProvided(date);
-  }
+  public static create(date: Date): InvalidDateProvided {}
 }
 
