[NoCoverage] BlockStatement
src/communities/exceptions/JoinCommunityRequestAlreadyExists.ts:5:60
 import { Result } from '@common-lib/common-lib/core/logic/Result';
 
 export class JoinCommunityRequestAlreadyExists extends Result<DomainError> {
-  private constructor(communityId: string, userId: string) {
-    super(false, {
-      message: `The user with ID ${userId} already has an existing request to join the community with ID ${communityId}.`,
-    });
-  }
+  private constructor(communityId: string, userId: string) {}
 
   public static create(

[NoCoverage] BooleanLiteral
src/communities/exceptions/JoinCommunityRequestAlreadyExists.ts:6:11
 
 export class JoinCommunityRequestAlreadyExists extends Result<DomainError> {
   private constructor(communityId: string, userId: string) {
-    super(false, {
+    super(true, {
       message: `The user with ID ${userId} already has an existing request to join the community with ID ${communityId}.`,
     });

[NoCoverage] StringLiteral
src/communities/exceptions/JoinCommunityRequestAlreadyExists.ts:7:16
 export class JoinCommunityRequestAlreadyExists extends Result<DomainError> {
   private constructor(communityId: string, userId: string) {
     super(false, {
-      message: `The user with ID ${userId} already has an existing request to join the community with ID ${communityId}.`,
+      message: ``,
     });
   }

[NoCoverage] BlockStatement
src/communities/exceptions/JoinCommunityRequestAlreadyExists.ts:14:40
   public static create(
     communityId: string,
     userId: string,
-  ): JoinCommunityRequestAlreadyExists {
-    return new JoinCommunityRequestAlreadyExists(communityId, userId);
-  }
+  ): JoinCommunityRequestAlreadyExists {}
 }
 
