[NoCoverage] BlockStatement
src/communities/exceptions/JoinCommunityRequestDenied.ts:5:60
 import { Result } from '@common-lib/common-lib/core/logic/Result';
 
 export class JoinCommunityRequestDenied extends Result<DomainError> {
-  private constructor(communityId: string, userId: string) {
-    super(false, {
-      message: `The user with ID ${userId} has already been denied access to the community with ID ${communityId} and cannot request access again.`,
-    });
-  }
+  private constructor(communityId: string, userId: string) {}
 
   public static create(

[NoCoverage] StringLiteral
src/communities/exceptions/JoinCommunityRequestDenied.ts:7:16
 export class JoinCommunityRequestDenied extends Result<DomainError> {
   private constructor(communityId: string, userId: string) {
     super(false, {
-      message: `The user with ID ${userId} has already been denied access to the community with ID ${communityId} and cannot request access again.`,
+      message: ``,
     });
   }

[NoCoverage] BlockStatement
src/communities/exceptions/JoinCommunityRequestDenied.ts:14:33
   public static create(
     communityId: string,
     userId: string,
-  ): JoinCommunityRequestDenied {
-    return new JoinCommunityRequestDenied(communityId, userId);
-  }
+  ): JoinCommunityRequestDenied {}
 }
 
