[NoCoverage] BlockStatement
src/communities/exceptions/JoinCommunityRequestNotFound.ts:5:35
 import { Result } from '@common-lib/common-lib/core/logic/Result';
 
 export class JoinCommunityRequestNotFound extends Result<DomainError> {
-  private constructor(id: string) {
-    super(false, {
-      message: `The join community request with id "${id}" does not exist.`,
-    });
-  }
+  private constructor(id: string) {}
 
   public static create(id: string): JoinCommunityRequestNotFound {

[NoCoverage] BlockStatement
src/communities/exceptions/JoinCommunityRequestNotFound.ts:11:66
     });
   }
 
-  public static create(id: string): JoinCommunityRequestNotFound {
-    return new JoinCommunityRequestNotFound(id);
-  }
+  public static create(id: string): JoinCommunityRequestNotFound {}
 }
 
