[NoCoverage] BlockStatement
src/communities/exceptions/MissingPropertiesError.ts:5:25
 import { Result } from '@common-lib/common-lib/core/logic/Result';
 
 export class MissingPropertiesError extends Result<DomainError> {
-  private constructor() {
-    super(false, {
-      message: `Properties are missing.`,
-    });
-  }
+  private constructor() {}
 
   public static create(): MissingPropertiesError {

[NoCoverage] BlockStatement
src/communities/exceptions/MissingPropertiesError.ts:11:50
     });
   }
 
-  public static create(): MissingPropertiesError {
-    return new MissingPropertiesError();
-  }
+  public static create(): MissingPropertiesError {}
 }
 
