[NoCoverage] BlockStatement
src/communities/exceptions/UserIsAlreadyMember.ts:5:60
 import { Result } from '@common-lib/common-lib/core/logic/Result';
 
 export class UserIsAlreadyMember extends Result<DomainError> {
-  private constructor(communityId: string, userId: string) {
-    super(false, {
-      message: `The user with ID ${userId} is already a member of the community with ID ${communityId}.`,
-    });
-  }
+  private constructor(communityId: string, userId: string) {}
 
   public static create(

[NoCoverage] ObjectLiteral
src/communities/exceptions/UserIsAlreadyMember.ts:6:18
 
 export class UserIsAlreadyMember extends Result<DomainError> {
   private constructor(communityId: string, userId: string) {
-    super(false, {
-      message: `The user with ID ${userId} is already a member of the community with ID ${communityId}.`,
-    });
+    super(false, {});
   }
 

[NoCoverage] BlockStatement
src/communities/exceptions/UserIsAlreadyMember.ts:14:26
   public static create(
     communityId: string,
     userId: string,
-  ): UserIsAlreadyMember {
-    return new UserIsAlreadyMember(communityId, userId);
-  }
+  ): UserIsAlreadyMember {}
 }
 
