[NoCoverage] BlockStatement
src/communities/exceptions/UserIsNotCommunityAdmin.ts:5:60
 import { Result } from '@common-lib/common-lib/core/logic/Result';
 
 export class UserIsNotCommunityAdmin extends Result<DomainError> {
-  private constructor(communityId: string, userId: string) {
-    super(false, {
-      message: `The user with ID ${userId} is not an admin of the community with ID ${communityId}.`,
-    });
-  }
+  private constructor(communityId: string, userId: string) {}
 
   public static create(

[NoCoverage] BlockStatement
src/communities/exceptions/UserIsNotCommunityAdmin.ts:14:30
   public static create(
     communityId: string,
     userId: string,
-  ): UserIsNotCommunityAdmin {
-    return new UserIsNotCommunityAdmin(communityId, userId);
-  }
+  ): UserIsNotCommunityAdmin {}
 }
 
