[NoCoverage] BlockStatement
src/communities/infra/community.repository.mongodb.ts:22:61
     super();
   }
 
-  async findByName(name: string): Promise<Domain.Community> {
-    const existsCommunity = await this.communityModel.findOne({ name });
-
-    if (!!existsCommunity === true) {
-      return CommunityMapper.toDomain(existsCommunity);
-    }
-
-    return null;
-  }
+  async findByName(name: string): Promise<Domain.Community> {}
 
   async isCommunityAdmin(

[NoCoverage] ObjectLiteral
src/communities/infra/community.repository.mongodb.ts:23:63
   }
 
   async findByName(name: string): Promise<Domain.Community> {
-    const existsCommunity = await this.communityModel.findOne({ name });
+    const existsCommunity = await this.communityModel.findOne({});
 
     if (!!existsCommunity === true) {

[NoCoverage] ConditionalExpression
src/communities/infra/community.repository.mongodb.ts:25:9
   async findByName(name: string): Promise<Domain.Community> {
     const existsCommunity = await this.communityModel.findOne({ name });
 
-    if (!!existsCommunity === true) {
+    if (false) {
       return CommunityMapper.toDomain(existsCommunity);
     }

[NoCoverage] BooleanLiteral
src/communities/infra/community.repository.mongodb.ts:25:10
   async findByName(name: string): Promise<Domain.Community> {
     const existsCommunity = await this.communityModel.findOne({ name });
 
-    if (!!existsCommunity === true) {
+    if (!existsCommunity === true) {
       return CommunityMapper.toDomain(existsCommunity);
     }

[NoCoverage] BlockStatement
src/communities/infra/community.repository.mongodb.ts:35:23
   async isCommunityAdmin(
     userId: string,
     communityId: string,
-  ): Promise<boolean> {
-    const existsCommunity = await this.communityModel.findOne({
-      adminId: userId,
-      id: communityId,
-    });
-
-    if (!!existsCommunity === true) {
-      return true;
-    }
-
-    return false;
-  }
+  ): Promise<boolean> {}
 
   async findById(id: string): Promise<Domain.Community> {

[NoCoverage] BlockStatement
src/communities/infra/community.repository.mongodb.ts:41:37
       id: communityId,
     });
 
-    if (!!existsCommunity === true) {
-      return true;
-    }
+    if (!!existsCommunity === true) {}
 
     return false;

[NoCoverage] BooleanLiteral
src/communities/infra/community.repository.mongodb.ts:42:14
     });
 
     if (!!existsCommunity === true) {
-      return true;
+      return false;
     }
 

[NoCoverage] BlockStatement
src/communities/infra/community.repository.mongodb.ts:48:57
     return false;
   }
 
-  async findById(id: string): Promise<Domain.Community> {
-    const existsCommunity = await this.communityModel.findOne({ id });
-
-    if (!!existsCommunity === true) {
-      return CommunityMapper.toDomain(existsCommunity);
-    }
-
-    return null;
-  }
+  async findById(id: string): Promise<Domain.Community> {}
 
   async save(entity: Domain.Community): Promise<Domain.Community> {

[NoCoverage] ObjectLiteral
src/communities/infra/community.repository.mongodb.ts:49:63
   }
 
   async findById(id: string): Promise<Domain.Community> {
-    const existsCommunity = await this.communityModel.findOne({ id });
+    const existsCommunity = await this.communityModel.findOne({});
 
     if (!!existsCommunity === true) {

[NoCoverage] BooleanLiteral
src/communities/infra/community.repository.mongodb.ts:51:31
   async findById(id: string): Promise<Domain.Community> {
     const existsCommunity = await this.communityModel.findOne({ id });
 
-    if (!!existsCommunity === true) {
+    if (!!existsCommunity === false) {
       return CommunityMapper.toDomain(existsCommunity);
     }

[NoCoverage] BlockStatement
src/communities/infra/community.repository.mongodb.ts:58:67
     return null;
   }
 
-  async save(entity: Domain.Community): Promise<Domain.Community> {
-    const existsCommunity = await this.communityModel.findOne({
-      id: entity.id.toString(),
-    });
-
-    const document = CommunityMapper.toPersistence(entity);
-
-    if (!!existsCommunity === false) {
-      return this.communityModel
-        .create(document)
-        .then((doc) => CommunityMapper.toDomain(doc));
-    }
-    return this.communityModel
-      .updateOne({ id: entity.id.toString() }, document)
-      .then(() => this.findById(entity.id.toString()));
-  }
+  async save(entity: Domain.Community): Promise<Domain.Community> {}
 
   async findAll(

[NoCoverage] BooleanLiteral
src/communities/infra/community.repository.mongodb.ts:65:31
 
     const document = CommunityMapper.toPersistence(entity);
 
-    if (!!existsCommunity === false) {
+    if (!!existsCommunity === true) {
       return this.communityModel
         .create(document)

[NoCoverage] ConditionalExpression
src/communities/infra/community.repository.mongodb.ts:65:9
 
     const document = CommunityMapper.toPersistence(entity);
 
-    if (!!existsCommunity === false) {
+    if (false) {
       return this.communityModel
         .create(document)

[NoCoverage] ArrowFunction
src/communities/infra/community.repository.mongodb.ts:68:15
     if (!!existsCommunity === false) {
       return this.communityModel
         .create(document)
-        .then((doc) => CommunityMapper.toDomain(doc));
+        .then(() => undefined);
     }
     return this.communityModel

[NoCoverage] ArrowFunction
src/communities/infra/community.repository.mongodb.ts:72:13
     }
     return this.communityModel
       .updateOne({ id: entity.id.toString() }, document)
-      .then(() => this.findById(entity.id.toString()));
+      .then(() => undefined);
   }
 

[NoCoverage] BlockStatement
src/communities/infra/community.repository.mongodb.ts:78:34
   async findAll(
     filter: CommunityFilter,
     pagination: PaginationParams,
-  ): Promise<Domain.Community[]> {
-    const communities = await this.communityModel
-      .find(filter)
-      .skip(pagination.skip)
-      .limit(pagination.limit)
-      .exec();
-
-    return communities.map(CommunityMapper.toDomain);
-  }
+  ): Promise<Domain.Community[]> {}
 
   async countDocuments(filter: CommunityFilter): Promise<number> {

[NoCoverage] BlockStatement
src/communities/infra/community.repository.mongodb.ts:88:66
     return communities.map(CommunityMapper.toDomain);
   }
 
-  async countDocuments(filter: CommunityFilter): Promise<number> {
-    return this.communityModel.countDocuments(filter).exec();
-  }
+  async countDocuments(filter: CommunityFilter): Promise<number> {}
 }
 
