[NoCoverage] BlockStatement
src/communities/infra/create-community.repository.mongodb.ts:23:70
     super();
   }
 
-  async findById(id: string): Promise<Domain.CreateCommunityRequest> {
-    const existsRequest = await this.createCommunityModel.findOne({ id });
-
-    if (!!existsRequest === true) {
-      return CreateCommunityRequestMapper.toDomain(existsRequest);
-    }
-
-    return null;
-  }
+  async findById(id: string): Promise<Domain.CreateCommunityRequest> {}
 
   async save(

[NoCoverage] BooleanLiteral
src/communities/infra/create-community.repository.mongodb.ts:26:9
   async findById(id: string): Promise<Domain.CreateCommunityRequest> {
     const existsRequest = await this.createCommunityModel.findOne({ id });
 
-    if (!!existsRequest === true) {
+    if (!existsRequest === true) {
       return CreateCommunityRequestMapper.toDomain(existsRequest);
     }

[NoCoverage] ConditionalExpression
src/communities/infra/create-community.repository.mongodb.ts:26:9
   async findById(id: string): Promise<Domain.CreateCommunityRequest> {
     const existsRequest = await this.createCommunityModel.findOne({ id });
 
-    if (!!existsRequest === true) {
+    if (false) {
       return CreateCommunityRequestMapper.toDomain(existsRequest);
     }

[NoCoverage] BlockStatement
src/communities/infra/create-community.repository.mongodb.ts:35:45
 
   async save(
     entity: Domain.CreateCommunityRequest,
-  ): Promise<Domain.CreateCommunityRequest> {
-    const existsRequest = await this.createCommunityModel.findOne({
-      id: entity.id.toString(),
-    });
-
-    const document = CreateCommunityRequestMapper.toPersistence(entity);
-
-    if (!!existsRequest === false) {
-      return this.createCommunityModel
-        .create(document)
-        .then((doc) => CreateCommunityRequestMapper.toDomain(doc));
-    }
-    return this.createCommunityModel
-      .updateOne({ id: entity.id.toString() }, document)
-      .then(() => this.findById(entity.id.toString()));
-  }
+  ): Promise<Domain.CreateCommunityRequest> {}
 
   async findAll(

[NoCoverage] ObjectLiteral
src/communities/infra/create-community.repository.mongodb.ts:36:67
   async save(
     entity: Domain.CreateCommunityRequest,
   ): Promise<Domain.CreateCommunityRequest> {
-    const existsRequest = await this.createCommunityModel.findOne({
-      id: entity.id.toString(),
-    });
+    const existsRequest = await this.createCommunityModel.findOne({});
 
     const document = CreateCommunityRequestMapper.toPersistence(entity);

[NoCoverage] BooleanLiteral
src/communities/infra/create-community.repository.mongodb.ts:42:9
 
     const document = CreateCommunityRequestMapper.toPersistence(entity);
 
-    if (!!existsRequest === false) {
+    if (!existsRequest === false) {
       return this.createCommunityModel
         .create(document)

[NoCoverage] BooleanLiteral
src/communities/infra/create-community.repository.mongodb.ts:42:29
 
     const document = CreateCommunityRequestMapper.toPersistence(entity);
 
-    if (!!existsRequest === false) {
+    if (!!existsRequest === true) {
       return this.createCommunityModel
         .create(document)

[NoCoverage] ArrowFunction
src/communities/infra/create-community.repository.mongodb.ts:45:15
     if (!!existsRequest === false) {
       return this.createCommunityModel
         .create(document)
-        .then((doc) => CreateCommunityRequestMapper.toDomain(doc));
+        .then(() => undefined);
     }
     return this.createCommunityModel

[NoCoverage] BlockStatement
src/communities/infra/create-community.repository.mongodb.ts:56:47
     filter: CreateCommunityFilter,
     sort: CreateCommunitySort,
     pagination: PaginationParams,
-  ): Promise<Domain.CreateCommunityRequest[]> {
-    const requests = await this.createCommunityModel
-      .find(filter)
-      .sort(sort)
-      .skip(pagination.skip)
-      .limit(pagination.limit)
-      .exec();
-
-    return requests.map(CreateCommunityRequestMapper.toDomain);
-  }
+  ): Promise<Domain.CreateCommunityRequest[]> {}
 
   async countDocuments(filter: CreateCommunityFilter): Promise<number> {

[NoCoverage] MethodExpression
src/communities/infra/create-community.repository.mongodb.ts:57:28
     sort: CreateCommunitySort,
     pagination: PaginationParams,
   ): Promise<Domain.CreateCommunityRequest[]> {
-    const requests = await this.createCommunityModel
-      .find(filter)
-      .sort(sort)
+    const requests = await this.createCommunityModel.find(filter)
       .skip(pagination.skip)
       .limit(pagination.limit)

[NoCoverage] BlockStatement
src/communities/infra/create-community.repository.mongodb.ts:67:72
     return requests.map(CreateCommunityRequestMapper.toDomain);
   }
 
-  async countDocuments(filter: CreateCommunityFilter): Promise<number> {
-    return this.createCommunityModel.countDocuments(filter).exec();
-  }
+  async countDocuments(filter: CreateCommunityFilter): Promise<number> {}
 }
 
