[NoCoverage] BlockStatement
communities/infra/filters/community-query.builder.ts:28:44
     limit: PaginationDefaults.DEFAULT_LIMIT,
   };
 
-  addNameFilter(nameFilter?: string): this {
-    if (nameFilter) {
-      this.filter.name = { $regex: nameFilter, $options: 'i' };
-    }
-    return this;
-  }
+  addNameFilter(nameFilter?: string): this {}
 
   addSort(

[NoCoverage] ObjectLiteral
communities/infra/filters/community-query.builder.ts:30:26
 
   addNameFilter(nameFilter?: string): this {
     if (nameFilter) {
-      this.filter.name = { $regex: nameFilter, $options: 'i' };
+      this.filter.name = {};
     }
     return this;

[NoCoverage] ConditionalExpression
communities/infra/filters/community-query.builder.ts:40:27
     sortDirection: SortDirection = SortDirection.ASC,
   ): this {
     if (sortBy) {
-      this.sort[sortBy] = sortDirection === SortDirection.DESC ? -1 : 1;
+      this.sort[sortBy] = true ? -1 : 1;
     }
     return this;

[NoCoverage] BlockStatement
communities/infra/filters/community-query.builder.ts:64:34
     return this;
   }
 
-  buildFilter(): CommunityFilter {
-    return this.filter;
-  }
+  buildFilter(): CommunityFilter {}
 
   buildSort(): CommunitySort {

[NoCoverage] BlockStatement
communities/infra/filters/community-query.builder.ts:68:30
     return this.filter;
   }
 
-  buildSort(): CommunitySort {
-    return this.sort;
-  }
+  buildSort(): CommunitySort {}
 
   buildPagination(): PaginationParams {
