[NoCoverage] BlockStatement
communities/infra/filters/create-community-query.builder.ts:29:48
     limit: PaginationDefaults.DEFAULT_LIMIT,
   };
 
-  addStatusFilter(statusFilter?: string): this {
-    if (statusFilter) {
-      this.filter.status = { $eq: statusFilter };
-    }
-    return this;
-  }
+  addStatusFilter(statusFilter?: string): this {}
 
   addCreatedAtFilter(fromDate?: Date): this {

[NoCoverage] ConditionalExpression
communities/infra/filters/create-community-query.builder.ts:30:9
   };
 
   addStatusFilter(statusFilter?: string): this {
-    if (statusFilter) {
+    if (false) {
       this.filter.status = { $eq: statusFilter };
     }

[NoCoverage] BlockStatement
communities/infra/filters/create-community-query.builder.ts:30:23
   };
 
   addStatusFilter(statusFilter?: string): this {
-    if (statusFilter) {
-      this.filter.status = { $eq: statusFilter };
-    }
+    if (statusFilter) {}
     return this;
   }

[NoCoverage] BlockStatement
communities/infra/filters/create-community-query.builder.ts:36:45
     return this;
   }
 
-  addCreatedAtFilter(fromDate?: Date): this {
-    if (fromDate) {
-      this.filter.createdAt = { $gte: fromDate };
-    }
-    return this;
-  }
+  addCreatedAtFilter(fromDate?: Date): this {}
 
   addSort(

[NoCoverage] ConditionalExpression
communities/infra/filters/create-community-query.builder.ts:37:9
   }
 
   addCreatedAtFilter(fromDate?: Date): this {
-    if (fromDate) {
+    if (false) {
       this.filter.createdAt = { $gte: fromDate };
     }

[NoCoverage] ConditionalExpression
communities/infra/filters/create-community-query.builder.ts:37:9
   }
 
   addCreatedAtFilter(fromDate?: Date): this {
-    if (fromDate) {
+    if (true) {
       this.filter.createdAt = { $gte: fromDate };
     }

[NoCoverage] ObjectLiteral
communities/infra/filters/create-community-query.builder.ts:38:31
 
   addCreatedAtFilter(fromDate?: Date): this {
     if (fromDate) {
-      this.filter.createdAt = { $gte: fromDate };
+      this.filter.createdAt = {};
     }
     return this;

[NoCoverage] BlockStatement
communities/infra/filters/create-community-query.builder.ts:72:40
     return this;
   }
 
-  buildFilter(): CreateCommunityFilter {
-    return this.filter;
-  }
+  buildFilter(): CreateCommunityFilter {}
 
   buildSort(): CreateCommunitySort {

[NoCoverage] BlockStatement
communities/infra/filters/create-community-query.builder.ts:76:36
     return this.filter;
   }
 
-  buildSort(): CreateCommunitySort {
-    return this.sort;
-  }
+  buildSort(): CreateCommunitySort {}
 
   buildPagination(): PaginationParams {
