[NoCoverage] ObjectLiteral
communities/infra/filters/join-community-query.builder.ts:23:42
 
   private sort: JoinCommunitySort = {};
 
-  private pagination: PaginationParams = {
-    skip: 0,
-    limit: PaginationDefaults.DEFAULT_LIMIT,
-  };
+  private pagination: PaginationParams = {};
 
   addNameFilter(nameFilter?: string): this {

[NoCoverage] BlockStatement
communities/infra/filters/join-community-query.builder.ts:64:38
     return this;
   }
 
-  buildFilter(): JoinCommunityFilter {
-    return this.filter;
-  }
+  buildFilter(): JoinCommunityFilter {}
 
   buildSort(): JoinCommunitySort {

[NoCoverage] BlockStatement
communities/infra/filters/join-community-query.builder.ts:68:34
     return this.filter;
   }
 
-  buildSort(): JoinCommunitySort {
-    return this.sort;
-  }
+  buildSort(): JoinCommunitySort {}
 
   buildPagination(): PaginationParams {
