[NoCoverage] BlockStatement
src/communities/infra/join-community.repository.mongodb.ts:20:68
     super();
   }
 
-  async findById(id: string): Promise<Domain.JoinCommunityRequest> {
-    const existsRequest = await this.joinCommunityModel.findOne({ id });
-
-    if (!!existsRequest === true) {
-      return JoinCommunityRequestMapper.toDomain(existsRequest);
-    }
-
-    return null;
-  }
+  async findById(id: string): Promise<Domain.JoinCommunityRequest> {}
 
   async save(

[NoCoverage] EqualityOperator
src/communities/infra/join-community.repository.mongodb.ts:23:9
   async findById(id: string): Promise<Domain.JoinCommunityRequest> {
     const existsRequest = await this.joinCommunityModel.findOne({ id });
 
-    if (!!existsRequest === true) {
+    if (!!existsRequest !== true) {
       return JoinCommunityRequestMapper.toDomain(existsRequest);
     }

[NoCoverage] BlockStatement
src/communities/infra/join-community.repository.mongodb.ts:23:35
   async findById(id: string): Promise<Domain.JoinCommunityRequest> {
     const existsRequest = await this.joinCommunityModel.findOne({ id });
 
-    if (!!existsRequest === true) {
-      return JoinCommunityRequestMapper.toDomain(existsRequest);
-    }
+    if (!!existsRequest === true) {}
 
     return null;

[NoCoverage] BlockStatement
src/communities/infra/join-community.repository.mongodb.ts:32:43
 
   async save(
     entity: Domain.JoinCommunityRequest,
-  ): Promise<Domain.JoinCommunityRequest> {
-    const existsRequest = await this.joinCommunityModel.findOne({
-      id: entity.id.toString(),
-    });
-
-    const document = JoinCommunityRequestMapper.toPersistence(entity);
-
-    if (!!existsRequest === false) {
-      return this.joinCommunityModel
-        .create(document)
-        .then((doc) => JoinCommunityRequestMapper.toDomain(doc));
-    }
-    return this.joinCommunityModel
-      .updateOne({ id: entity.id.toString() }, document)
-      .then(() => this.findById(entity.id.toString()));
-  }
+  ): Promise<Domain.JoinCommunityRequest> {}
 
   async findAll(

[NoCoverage] ObjectLiteral
src/communities/infra/join-community.repository.mongodb.ts:33:65
   async save(
     entity: Domain.JoinCommunityRequest,
   ): Promise<Domain.JoinCommunityRequest> {
-    const existsRequest = await this.joinCommunityModel.findOne({
-      id: entity.id.toString(),
-    });
+    const existsRequest = await this.joinCommunityModel.findOne({});
 
     const document = JoinCommunityRequestMapper.toPersistence(entity);

[NoCoverage] ArrowFunction
src/communities/infra/join-community.repository.mongodb.ts:42:15
     if (!!existsRequest === false) {
       return this.joinCommunityModel
         .create(document)
-        .then((doc) => JoinCommunityRequestMapper.toDomain(doc));
+        .then(() => undefined);
     }
     return this.joinCommunityModel

[NoCoverage] ObjectLiteral
src/communities/infra/join-community.repository.mongodb.ts:45:18
         .then((doc) => JoinCommunityRequestMapper.toDomain(doc));
     }
     return this.joinCommunityModel
-      .updateOne({ id: entity.id.toString() }, document)
+      .updateOne({}, document)
       .then(() => this.findById(entity.id.toString()));
   }

[NoCoverage] BlockStatement
src/communities/infra/join-community.repository.mongodb.ts:52:45
   async findAll(
     communityId: string,
     pagination: PaginationParams,
-  ): Promise<Domain.JoinCommunityRequest[]> {
-    const requests = await this.joinCommunityModel
-      .find({ status: StatusRequest.PENDING, communityId })
-      .skip(pagination.skip)
-      .limit(pagination.limit)
-      .exec();
-
-    return requests.map(JoinCommunityRequestMapper.toDomain);
-  }
+  ): Promise<Domain.JoinCommunityRequest[]> {}
 
   async countDocuments(communityId: string): Promise<number> {

[NoCoverage] BlockStatement
src/communities/infra/join-community.repository.mongodb.ts:62:62
     return requests.map(JoinCommunityRequestMapper.toDomain);
   }
 
-  async countDocuments(communityId: string): Promise<number> {
-    return this.joinCommunityModel.countDocuments({ communityId }).exec();
-  }
+  async countDocuments(communityId: string): Promise<number> {}
 
   async findByUserIdAndCommunityId(

[NoCoverage] BlockStatement
src/communities/infra/join-community.repository.mongodb.ts:69:43
   async findByUserIdAndCommunityId(
     userId: string,
     communityId: string,
-  ): Promise<Domain.JoinCommunityRequest> {
-    const existsRequest = await this.joinCommunityModel.findOne({
-      userId,
-      communityId,
-    });
-
-    if (!!existsRequest === true) {
-      return JoinCommunityRequestMapper.toDomain(existsRequest);
-    }
-
-    return null;
-  }
+  ): Promise<Domain.JoinCommunityRequest> {}
 }
 
