[NoCoverage] BlockStatement
src/communities/mapper/CommunityMapper.ts:7:65
 import { CommunityDto } from '../dto/community.dto';
 
 export class CommunityMapper {
-  static toDomain(raw: Persistence.Community): Domain.Community {
-    return Domain.Community.create(
-      {
-        adminId: raw.adminId,
-        name: raw.name,
-        description: raw.description,
-        members: raw.members,
-        causes: raw.causes,
-      },
-      new UniqueEntityID(raw.id),
-    );
-  }
+  static toDomain(raw: Persistence.Community): Domain.Community {}
 
   static toPersistence(entity: Domain.Community): Persistence.Community {

[NoCoverage] BlockStatement
src/communities/mapper/CommunityMapper.ts:20:73
     );
   }
 
-  static toPersistence(entity: Domain.Community): Persistence.Community {
-    return {
-      id: entity.id.toString(),
-      adminId: entity.adminId,
-      name: entity.name,
-      description: entity.description,
-      members: entity.members,
-      causes: entity.causes,
-    };
-  }
+  static toPersistence(entity: Domain.Community): Persistence.Community {}
 
   static toDto(entity: Domain.Community): CommunityDto {

[NoCoverage] BlockStatement
src/communities/mapper/CommunityMapper.ts:31:56
     };
   }
 
-  static toDto(entity: Domain.Community): CommunityDto {
-    return {
-      id: entity.id.toString(),
-      adminId: entity.adminId,
-      name: entity.name,
-      description: entity.description,
-    };
-  }
+  static toDto(entity: Domain.Community): CommunityDto {}
 }
 
