[NoCoverage] BlockStatement
src/communities/mapper/CreateCommunityRequestMapper.ts:10:36
 export class CreateCommunityRequestMapper {
   static toDomain(
     raw: Persistence.CreateCommunityRequest,
-  ): Domain.CreateCommunityRequest {
-    return Domain.CreateCommunityRequest.create(
-      {
-        userId: raw.userId,
-        communityName: raw.name,
-        communityDescription: raw.description,
-        causeTitle: raw.cause.title,
-        causeDescription: raw.cause.description,
-        causeEndDate: new Date(raw.cause.end),
-        causeOds: raw.cause.ods,
-        status: raw.status,
-        createdAt: raw.createdAt,
-        comment: raw.comment,
-      },
-      new UniqueEntityID(raw.id),
-    );
-  }
+  ): Domain.CreateCommunityRequest {}
 
   static toPersistence(

[NoCoverage] BlockStatement
src/communities/mapper/CreateCommunityRequestMapper.ts:30:41
 
   static toPersistence(
     entity: Domain.CreateCommunityRequest,
-  ): Persistence.CreateCommunityRequest {
-    return {
-      id: entity.id.toString(),
-      userId: entity.userId,
-      name: entity.communityName,
-      description: entity.communityDescription,
-      cause: {
-        title: entity.causeTitle,
-        description: entity.causeDescription,
-        end: entity.causeEndDate,
-        ods: entity.causeOds,
-      },
-      status: entity.status,
-      createdAt: entity.createdAt,
-      comment: entity.comment,
-    };
-  }
+  ): Persistence.CreateCommunityRequest {}
 
   static toDto(

[NoCoverage] ObjectLiteral
src/communities/mapper/CreateCommunityRequestMapper.ts:31:12
   static toPersistence(
     entity: Domain.CreateCommunityRequest,
   ): Persistence.CreateCommunityRequest {
-    return {
-      id: entity.id.toString(),
-      userId: entity.userId,
-      name: entity.communityName,
-      description: entity.communityDescription,
-      cause: {
-        title: entity.causeTitle,
-        description: entity.causeDescription,
-        end: entity.causeEndDate,
-        ods: entity.causeOds,
-      },
-      status: entity.status,
-      createdAt: entity.createdAt,
-      comment: entity.comment,
-    };
+    return {};
   }
 

[NoCoverage] BlockStatement
src/communities/mapper/CreateCommunityRequestMapper.ts:50:32
 
   static toDto(
     entity: Domain.CreateCommunityRequest,
-  ): CreateCommunityRequestDto {
-    return {
-      id: entity.id.toString(),
-      userId: entity.userId,
-      communityName: entity.communityName,
-      communityDescription: entity.communityDescription,
-      causeTitle: entity.causeTitle,
-      causeDescription: entity.causeDescription,
-      causeEndDate: entity.causeEndDate,
-      causeOds: mapODSEnumListToDetails(entity.causeOds),
-      status: entity.status,
-      createdAt: entity.createdAt,
-      comment: entity.comment,
-    };
-  }
+  ): CreateCommunityRequestDto {}
 }
 
