[NoCoverage] BlockStatement
src/communities/mapper/JoinCommunityRequestMapper.ts:9:34
 export class JoinCommunityRequestMapper {
   static toDomain(
     raw: Persistence.JoinCommunityRequest,
-  ): Domain.JoinCommunityRequest {
-    return Domain.JoinCommunityRequest.create(
-      {
-        userId: raw.userId,
-        communityId: raw.communityId,
-        adminId: raw.adminId,
-        status: raw.status,
-        comment: raw.comment,
-      },
-      new UniqueEntityID(raw.id),
-    );
-  }
+  ): Domain.JoinCommunityRequest {}
 
   static toPersistence(

[NoCoverage] BlockStatement
src/communities/mapper/JoinCommunityRequestMapper.ts:24:39
 
   static toPersistence(
     entity: Domain.JoinCommunityRequest,
-  ): Persistence.JoinCommunityRequest {
-    return {
-      id: entity.id.toString(),
-      userId: entity.userId,
-      communityId: entity.communityId,
-      adminId: entity.adminId,
-      status: entity.status,
-      comment: entity.comment,
-    };
-  }
+  ): Persistence.JoinCommunityRequest {}
 
   static toDto(entity: Domain.JoinCommunityRequest): JoinCommunityRequestDto {

[NoCoverage] BlockStatement
src/communities/mapper/JoinCommunityRequestMapper.ts:35:78
     };
   }
 
-  static toDto(entity: Domain.JoinCommunityRequest): JoinCommunityRequestDto {
-    return {
-      id: entity.id.toString(),
-      userId: entity.userId,
-      communityId: entity.communityId,
-      status: entity.status,
-      comment: entity.comment,
-    };
-  }
+  static toDto(entity: Domain.JoinCommunityRequest): JoinCommunityRequestDto {}
 }
 
