[NoCoverage] BlockStatement
src/community-reports/application/community-reports.controller.ts:28:5
     @Param('id', ParseUUIDPipe) communityId: string,
     @GetUserId() userId: string,
     @GetUserRole() userRole: string,
-  ) {
-    const communityReport =
-      await this.communityReportsService.findCommunityReport(communityId);
-
-    if (
-      // If not
-      !(
-        userRole === Role.ADMIN || // Is platform admin or
-        (userRole === Role.USER && userId === communityReport.adminId) // Is community admin
-      )
-    ) {
-      throw new UserNotAuthorizedError();
-    }
-
-    return CommunityByCommunityIdMapper.toDto(communityReport);
-  }
+  ) {}
 }
 

[NoCoverage] ConditionalExpression
src/community-reports/application/community-reports.controller.ts:34:7
 
     if (
       // If not
-      !(
-        userRole === Role.ADMIN || // Is platform admin or
-        (userRole === Role.USER && userId === communityReport.adminId) // Is community admin
-      )
+      true
     ) {
       throw new UserNotAuthorizedError();

[NoCoverage] BooleanLiteral
src/community-reports/application/community-reports.controller.ts:34:7
 
     if (
       // If not
-      !(
-        userRole === Role.ADMIN || // Is platform admin or
-        (userRole === Role.USER && userId === communityReport.adminId) // Is community admin
-      )
+      userRole === Role.ADMIN ||
+// Is platform admin or
+userRole === Role.USER && userId === communityReport.adminId // Is community admin
     ) {
       throw new UserNotAuthorizedError();

[NoCoverage] ConditionalExpression
src/community-reports/application/community-reports.controller.ts:35:9
     if (
       // If not
       !(
-        userRole === Role.ADMIN || // Is platform admin or
-        (userRole === Role.USER && userId === communityReport.adminId) // Is community admin
+        false // Is community admin
       )
     ) {

[NoCoverage] ConditionalExpression
src/community-reports/application/community-reports.controller.ts:35:9
     if (
       // If not
       !(
-        userRole === Role.ADMIN || // Is platform admin or
+        false || // Is platform admin or
         (userRole === Role.USER && userId === communityReport.adminId) // Is community admin
       )

[NoCoverage] EqualityOperator
src/community-reports/application/community-reports.controller.ts:36:10
       // If not
       !(
         userRole === Role.ADMIN || // Is platform admin or
-        (userRole === Role.USER && userId === communityReport.adminId) // Is community admin
+        (userRole !== Role.USER && userId === communityReport.adminId) // Is community admin
       )
     ) {

[NoCoverage] LogicalOperator
src/community-reports/application/community-reports.controller.ts:36:10
       // If not
       !(
         userRole === Role.ADMIN || // Is platform admin or
-        (userRole === Role.USER && userId === communityReport.adminId) // Is community admin
+        (// Is platform admin or
+userRole === Role.USER || userId === communityReport.adminId) // Is community admin
       )
     ) {

[NoCoverage] BlockStatement
src/community-reports/application/community-reports.controller.ts:38:7
         userRole === Role.ADMIN || // Is platform admin or
         (userRole === Role.USER && userId === communityReport.adminId) // Is community admin
       )
-    ) {
-      throw new UserNotAuthorizedError();
-    }
+    ) {}
 
     return CommunityByCommunityIdMapper.toDto(communityReport);
