[NoCoverage] BlockStatement
src/community-reports/application/community-reports.service.impl.ts:19:45
 
   async findCommunityReport(
     communityId: string,
-  ): Promise<Domain.CommunityByCommunityId> {
-    // Fetch community and causes
-    const [community, causes] = await Promise.all([
-      this.communityByCommunityIdRepository.findOneByCommunityId(communityId),
-      this.causeByCommunityIdRepository.findManyByCommunityId(communityId),
-    ]);
-
-    // Add causes to community
-    community.addCauses(causes);
-
-    // Fetch actions for each cause
-    await Promise.all(
-      causes.map(async (cause) => {
-        const actions = await this.actionByCauseIdRepository.findManyByCauseId(
-          cause.causeId,
-        );
-        cause.addActions(actions);
-        return cause;
-      }),
-    );
-
-    // Return community domain object
-    return community;
-  }
+  ): Promise<Domain.CommunityByCommunityId> {}
 
   registerCommunityCreation(

[NoCoverage] BlockStatement
src/community-reports/application/community-reports.service.impl.ts:31:35
 
     // Fetch actions for each cause
     await Promise.all(
-      causes.map(async (cause) => {
-        const actions = await this.actionByCauseIdRepository.findManyByCauseId(
-          cause.causeId,
-        );
-        cause.addActions(actions);
-        return cause;
-      }),
+      causes.map(async (cause) => {}),
     );
 

[NoCoverage] BlockStatement
src/community-reports/application/community-reports.service.impl.ts:48:20
     communityId: string,
     communityName: string,
     adminId: string,
-  ): Promise<void> {
-    // Create community
-    const community = Domain.CommunityByCommunityId.create(
-      communityId,
-      communityName,
-      adminId,
-    );
-
-    // Save
-    return this.communityByCommunityIdRepository.save(community);
-  }
+  ): Promise<void> {}
 
   async registerCommunityJoinMember(communityId: string): Promise<void> {

[NoCoverage] BlockStatement
src/community-reports/application/community-reports.service.impl.ts:60:73
     return this.communityByCommunityIdRepository.save(community);
   }
 
-  async registerCommunityJoinMember(communityId: string): Promise<void> {
-    // Fetch community
-    const community =
-      await this.communityByCommunityIdRepository.findOneByCommunityId(
-        communityId,
-      );
-
-    // Increment members count
-    community.incrementMembersCount();
-
-    // Save
-    return this.communityByCommunityIdRepository.save(community);
-  }
+  async registerCommunityJoinMember(communityId: string): Promise<void> {}
 
   async registerCauseCreation(

[NoCoverage] BlockStatement
src/community-reports/application/community-reports.service.impl.ts:79:20
     causeId: string,
     causeName: string,
     ods: Set<ODSEnum>,
-  ): Promise<void> {
-    // Fetch community
-    const community =
-      await this.communityByCommunityIdRepository.findOneByCommunityId(
-        communityId,
-      );
-
-    // Add ODS to community
-    community.addOds(ods);
-
-    // Save community
-    await this.communityByCommunityIdRepository.save(community);
-
-    // Create cause
-    const cause = Domain.CauseByCommunityId.create(
-      communityId,
-      causeId,
-      causeName,
-      ods,
-    );
-
-    // Save cause
-    return this.causeByCommunityIdRepository.save(cause);
-  }
+  ): Promise<void> {}
 
   async registerCauseAddSupporter(

[NoCoverage] BlockStatement
src/community-reports/application/community-reports.service.impl.ts:107:20
   async registerCauseAddSupporter(
     communityId: string,
     causeId: string,
-  ): Promise<void> {
-    // Fetch cause
-    const cause = await this.causeByCommunityIdRepository.findOneByCauseId(
-      communityId,
-      causeId,
-    );
-
-    // Increment supporters count
-    cause.incrementSupportsCount();
-
-    // Save
-    return this.causeByCommunityIdRepository.save(cause);
-  }
+  ): Promise<void> {}
 
   registerActionCreation(

[NoCoverage] BlockStatement
src/community-reports/application/community-reports.service.impl.ts:126:20
     actionId: string,
     actionName: string,
     target: number,
-  ): Promise<void> {
-    // Create action
-    const action = Domain.ActionByCauseId.create(
-      causeId,
-      actionId,
-      actionName,
-      target,
-    );
-
-    // Save
-    return this.actionByCauseIdRepository.save(action);
-  }
+  ): Promise<void> {}
 
   async registerActionContributed(

[NoCoverage] BlockStatement
src/community-reports/application/community-reports.service.impl.ts:143:20
     causeId: string,
     actionId: string,
     amount: number,
-  ): Promise<void> {
-    // Fetch action
-    const action = await this.actionByCauseIdRepository.findOneByActionId(
-      causeId,
-      actionId,
-    );
-
-    // Increment contributions count
-    action.incrementAchieved(amount);
-
-    // Save
-    return this.actionByCauseIdRepository.save(action);
-  }
+  ): Promise<void> {}
 }
 
