[NoCoverage] BlockStatement
src/community-reports/domain/ActionByCauseId.ts:13:52
 }
 
 export class ActionByCauseId extends Entity<ActionByCauseIdProps> {
-  private constructor(props: ActionByCauseIdProps) {
-    super(props);
-  }
+  private constructor(props: ActionByCauseIdProps) {}
 
   get causeId(): string {

[NoCoverage] BlockStatement
src/community-reports/domain/ActionByCauseId.ts:25:28
     return this.props.actionId;
   }
 
-  get actionName(): string {
-    return this.props.actionName;
-  }
+  get actionName(): string {}
 
   get target(): number {

[NoCoverage] BlockStatement
src/community-reports/domain/ActionByCauseId.ts:37:34
     return this.props.achieved;
   }
 
-  set achieved(achieved: number) {
-    this.props.achieved = achieved;
-  }
+  set achieved(achieved: number) {}
 
   public static create(

[NoCoverage] BlockStatement
src/community-reports/domain/ActionByCauseId.ts:47:22
     actionName: string,
     target: number = 0,
     achieved: number = 0,
-  ): ActionByCauseId {
-    if (target < 0) {
-      throw new NegativeCountError(
-        '[ActionByCauseId] Target value cannot be negative.',
-      );
-    }
-    if (achieved < 0) {
-      throw new NegativeCountError(
-        '[ActionByCauseId] Achieved value cannot be negative.',
-      );
-    }
-
-    return new ActionByCauseId({
-      causeId,
-      actionId,
-      actionName,
-      target,
-      achieved,
-    });
-  }
+  ): ActionByCauseId {}
 
   public incrementAchieved(amount: number = 1): number {

[NoCoverage] ConditionalExpression
src/community-reports/domain/ActionByCauseId.ts:48:9
     target: number = 0,
     achieved: number = 0,
   ): ActionByCauseId {
-    if (target < 0) {
+    if (false) {
       throw new NegativeCountError(
         '[ActionByCauseId] Target value cannot be negative.',

[NoCoverage] ConditionalExpression
src/community-reports/domain/ActionByCauseId.ts:48:9
     target: number = 0,
     achieved: number = 0,
   ): ActionByCauseId {
-    if (target < 0) {
+    if (true) {
       throw new NegativeCountError(
         '[ActionByCauseId] Target value cannot be negative.',

[NoCoverage] BlockStatement
src/community-reports/domain/ActionByCauseId.ts:53:23
         '[ActionByCauseId] Target value cannot be negative.',
       );
     }
-    if (achieved < 0) {
-      throw new NegativeCountError(
-        '[ActionByCauseId] Achieved value cannot be negative.',
-      );
-    }
+    if (achieved < 0) {}
 
     return new ActionByCauseId({

[NoCoverage] ConditionalExpression
src/community-reports/domain/ActionByCauseId.ts:53:9
         '[ActionByCauseId] Target value cannot be negative.',
       );
     }
-    if (achieved < 0) {
+    if (true) {
       throw new NegativeCountError(
         '[ActionByCauseId] Achieved value cannot be negative.',

[NoCoverage] StringLiteral
src/community-reports/domain/ActionByCauseId.ts:55:9
     }
     if (achieved < 0) {
       throw new NegativeCountError(
-        '[ActionByCauseId] Achieved value cannot be negative.',
+        "",
       );
     }

[NoCoverage] BlockStatement
src/community-reports/domain/ActionByCauseId.ts:68:56
     });
   }
 
-  public incrementAchieved(amount: number = 1): number {
-    if (amount < 0) {
-      throw new NegativeCountError(
-        '[ActionByCauseId] Increment amount cannot be negative.',
-      );
-    }
-    this.achieved += amount;
-    return this.achieved;
-  }
+  public incrementAchieved(amount: number = 1): number {}
 }
 

[NoCoverage] ConditionalExpression
src/community-reports/domain/ActionByCauseId.ts:69:9
   }
 
   public incrementAchieved(amount: number = 1): number {
-    if (amount < 0) {
+    if (false) {
       throw new NegativeCountError(
         '[ActionByCauseId] Increment amount cannot be negative.',

[NoCoverage] ConditionalExpression
src/community-reports/domain/ActionByCauseId.ts:69:9
   }
 
   public incrementAchieved(amount: number = 1): number {
-    if (amount < 0) {
+    if (true) {
       throw new NegativeCountError(
         '[ActionByCauseId] Increment amount cannot be negative.',

[NoCoverage] AssignmentOperator
src/community-reports/domain/ActionByCauseId.ts:74:5
         '[ActionByCauseId] Increment amount cannot be negative.',
       );
     }
-    this.achieved += amount;
+    this.achieved -= amount;
     return this.achieved;
   }
