[NoCoverage] BlockStatement
src/community-reports/domain/CauseByCommunityId.ts:16:55
 }
 
 export class CauseByCommunityId extends Entity<CauseByCommunityIdProps> {
-  private constructor(props: CauseByCommunityIdProps) {
-    super(props);
-  }
+  private constructor(props: CauseByCommunityIdProps) {}
 
   get communityId(): string {

[NoCoverage] BlockStatement
src/community-reports/domain/CauseByCommunityId.ts:28:27
     return this.props.causeId;
   }
 
-  get causeName(): string {
-    return this.props.causeName;
-  }
+  get causeName(): string {}
 
   get ods(): Set<ODSEnum> {

[NoCoverage] BlockStatement
src/community-reports/domain/CauseByCommunityId.ts:32:27
     return this.props.causeName;
   }
 
-  get ods(): Set<ODSEnum> {
-    return this.props.ods;
-  }
+  get ods(): Set<ODSEnum> {}
 
   get supportsCount(): number {

[NoCoverage] BlockStatement
src/community-reports/domain/CauseByCommunityId.ts:36:31
     return this.props.ods;
   }
 
-  get supportsCount(): number {
-    return this.props.supportsCount;
-  }
+  get supportsCount(): number {}
 
   set supportsCount(supportsCount: number) {

[NoCoverage] BlockStatement
src/community-reports/domain/CauseByCommunityId.ts:40:44
     return this.props.supportsCount;
   }
 
-  set supportsCount(supportsCount: number) {
-    this.props.supportsCount = supportsCount;
-  }
+  set supportsCount(supportsCount: number) {}
 
   get actions(): ActionByCauseId[] {

[NoCoverage] BlockStatement
src/community-reports/domain/CauseByCommunityId.ts:44:36
     this.props.supportsCount = supportsCount;
   }
 
-  get actions(): ActionByCauseId[] {
-    return this.props.actions;
-  }
+  get actions(): ActionByCauseId[] {}
 
   public static create(

[NoCoverage] ArrayDeclaration
src/community-reports/domain/CauseByCommunityId.ts:54:34
     causeName: string,
     ods: Set<ODSEnum> = new Set<ODSEnum>(),
     supportsCount: number = 0,
-    actions: ActionByCauseId[] = [],
+    actions: ActionByCauseId[] = ["Stryker was here"],
   ): CauseByCommunityId {
     if (supportsCount < 0) {

[NoCoverage] BlockStatement
src/community-reports/domain/CauseByCommunityId.ts:55:25
     ods: Set<ODSEnum> = new Set<ODSEnum>(),
     supportsCount: number = 0,
     actions: ActionByCauseId[] = [],
-  ): CauseByCommunityId {
-    if (supportsCount < 0) {
-      throw new NegativeCountError(
-        '[CauseByCommunityId] Supports count cannot be negative.',
-      );
-    }
-
-    return new CauseByCommunityId({
-      communityId,
-      causeId,
-      causeName,
-      ods,
-      supportsCount,
-      actions,
-    });
-  }
+  ): CauseByCommunityId {}
 
   public incrementSupportsCount(amount: number = 1): number {

[NoCoverage] ConditionalExpression
src/community-reports/domain/CauseByCommunityId.ts:56:9
     supportsCount: number = 0,
     actions: ActionByCauseId[] = [],
   ): CauseByCommunityId {
-    if (supportsCount < 0) {
+    if (false) {
       throw new NegativeCountError(
         '[CauseByCommunityId] Supports count cannot be negative.',

[NoCoverage] EqualityOperator
src/community-reports/domain/CauseByCommunityId.ts:56:9
     supportsCount: number = 0,
     actions: ActionByCauseId[] = [],
   ): CauseByCommunityId {
-    if (supportsCount < 0) {
+    if (supportsCount >= 0) {
       throw new NegativeCountError(
         '[CauseByCommunityId] Supports count cannot be negative.',

[NoCoverage] StringLiteral
src/community-reports/domain/CauseByCommunityId.ts:58:9
   ): CauseByCommunityId {
     if (supportsCount < 0) {
       throw new NegativeCountError(
-        '[CauseByCommunityId] Supports count cannot be negative.',
+        "",
       );
     }

[NoCoverage] ObjectLiteral
src/community-reports/domain/CauseByCommunityId.ts:62:35
       );
     }
 
-    return new CauseByCommunityId({
-      communityId,
-      causeId,
-      causeName,
-      ods,
-      supportsCount,
-      actions,
-    });
+    return new CauseByCommunityId({});
   }
 

[NoCoverage] BlockStatement
src/community-reports/domain/CauseByCommunityId.ts:72:61
     });
   }
 
-  public incrementSupportsCount(amount: number = 1): number {
-    this.supportsCount += amount;
-    return this.supportsCount;
-  }
+  public incrementSupportsCount(amount: number = 1): number {}
 
   public addODS(ods: ODSEnum | Set<ODSEnum>): void {

[NoCoverage] AssignmentOperator
src/community-reports/domain/CauseByCommunityId.ts:73:5
   }
 
   public incrementSupportsCount(amount: number = 1): number {
-    this.supportsCount += amount;
+    this.supportsCount -= amount;
     return this.supportsCount;
   }

[NoCoverage] BlockStatement
src/community-reports/domain/CauseByCommunityId.ts:77:52
     return this.supportsCount;
   }
 
-  public addODS(ods: ODSEnum | Set<ODSEnum>): void {
-    if (ods instanceof Set) {
-      ods.forEach((item) => this.ods.add(item));
-    } else {
-      this.ods.add(ods);
-    }
-  }
+  public addODS(ods: ODSEnum | Set<ODSEnum>): void {}
 
   public addActions(actions: ActionByCauseId | ActionByCauseId[]): void {

[NoCoverage] ConditionalExpression
src/community-reports/domain/CauseByCommunityId.ts:78:9
   }
 
   public addODS(ods: ODSEnum | Set<ODSEnum>): void {
-    if (ods instanceof Set) {
+    if (true) {
       ods.forEach((item) => this.ods.add(item));
     } else {

[NoCoverage] BlockStatement
src/community-reports/domain/CauseByCommunityId.ts:78:29
   }
 
   public addODS(ods: ODSEnum | Set<ODSEnum>): void {
-    if (ods instanceof Set) {
-      ods.forEach((item) => this.ods.add(item));
-    } else {
+    if (ods instanceof Set) {} else {
       this.ods.add(ods);
     }

[NoCoverage] ArrowFunction
src/community-reports/domain/CauseByCommunityId.ts:79:19
 
   public addODS(ods: ODSEnum | Set<ODSEnum>): void {
     if (ods instanceof Set) {
-      ods.forEach((item) => this.ods.add(item));
+      ods.forEach(() => undefined);
     } else {
       this.ods.add(ods);

[NoCoverage] BlockStatement
src/community-reports/domain/CauseByCommunityId.ts:80:12
   public addODS(ods: ODSEnum | Set<ODSEnum>): void {
     if (ods instanceof Set) {
       ods.forEach((item) => this.ods.add(item));
-    } else {
-      this.ods.add(ods);
-    }
+    } else {}
   }
 

[NoCoverage] BlockStatement
src/community-reports/domain/CauseByCommunityId.ts:85:73
     }
   }
 
-  public addActions(actions: ActionByCauseId | ActionByCauseId[]): void {
-    if (Array.isArray(actions)) {
-      this.actions.push(...actions);
-    } else {
-      this.actions.push(actions);
-    }
-  }
+  public addActions(actions: ActionByCauseId | ActionByCauseId[]): void {}
 }
 

[NoCoverage] ConditionalExpression
src/community-reports/domain/CauseByCommunityId.ts:86:9
   }
 
   public addActions(actions: ActionByCauseId | ActionByCauseId[]): void {
-    if (Array.isArray(actions)) {
+    if (false) {
       this.actions.push(...actions);
     } else {

[NoCoverage] ConditionalExpression
src/community-reports/domain/CauseByCommunityId.ts:86:9
   }
 
   public addActions(actions: ActionByCauseId | ActionByCauseId[]): void {
-    if (Array.isArray(actions)) {
+    if (true) {
       this.actions.push(...actions);
     } else {

[NoCoverage] BlockStatement
src/community-reports/domain/CauseByCommunityId.ts:88:12
   public addActions(actions: ActionByCauseId | ActionByCauseId[]): void {
     if (Array.isArray(actions)) {
       this.actions.push(...actions);
-    } else {
-      this.actions.push(actions);
-    }
+    } else {}
   }
 }
