[NoCoverage] BlockStatement
src/community-reports/domain/CommunityByCommunityId.ts:16:59
 }
 
 export class CommunityByCommunityId extends Entity<CommunityByCommunityIdProps> {
-  private constructor(props: CommunityByCommunityIdProps) {
-    super(props);
-  }
+  private constructor(props: CommunityByCommunityIdProps) {}
 
   get communityId(): string {

[NoCoverage] BlockStatement
src/community-reports/domain/CommunityByCommunityId.ts:32:30
     return this.props.adminId;
   }
 
-  get membersCount(): number {
-    return this.props.membersCount;
-  }
+  get membersCount(): number {}
 
   set membersCount(membersCount: number) {

[NoCoverage] BlockStatement
src/community-reports/domain/CommunityByCommunityId.ts:36:42
     return this.props.membersCount;
   }
 
-  set membersCount(membersCount: number) {
-    this.props.membersCount = membersCount;
-  }
+  set membersCount(membersCount: number) {}
 
   get ods(): Set<ODSEnum> {

[NoCoverage] BlockStatement
src/community-reports/domain/CommunityByCommunityId.ts:44:38
     return this.props.ods;
   }
 
-  get causes(): CauseByCommunityId[] {
-    return this.props.causes;
-  }
+  get causes(): CauseByCommunityId[] {}
 
   public static create(

[NoCoverage] BlockStatement
src/community-reports/domain/CommunityByCommunityId.ts:55:29
     membersCount: number = 1,
     ods: Set<ODSEnum> = new Set<ODSEnum>(),
     causes: CauseByCommunityId[] = [],
-  ): CommunityByCommunityId {
-    if (membersCount < 0) {
-      throw new NegativeCountError(
-        '[CommunityByCommunityId] Members count cannot be negative.',
-      );
-    }
-
-    return new CommunityByCommunityId({
-      communityId,
-      communityName,
-      adminId,
-      membersCount,
-      ods,
-      causes,
-    });
-  }
+  ): CommunityByCommunityId {}
 
   public incrementMembersCount(amount: number = 1): number {

[NoCoverage] ConditionalExpression
src/community-reports/domain/CommunityByCommunityId.ts:56:9
     ods: Set<ODSEnum> = new Set<ODSEnum>(),
     causes: CauseByCommunityId[] = [],
   ): CommunityByCommunityId {
-    if (membersCount < 0) {
+    if (true) {
       throw new NegativeCountError(
         '[CommunityByCommunityId] Members count cannot be negative.',

[NoCoverage] EqualityOperator
src/community-reports/domain/CommunityByCommunityId.ts:56:9
     ods: Set<ODSEnum> = new Set<ODSEnum>(),
     causes: CauseByCommunityId[] = [],
   ): CommunityByCommunityId {
-    if (membersCount < 0) {
+    if (membersCount <= 0) {
       throw new NegativeCountError(
         '[CommunityByCommunityId] Members count cannot be negative.',

[NoCoverage] BlockStatement
src/community-reports/domain/CommunityByCommunityId.ts:72:60
     });
   }
 
-  public incrementMembersCount(amount: number = 1): number {
-    this.membersCount += amount;
-    return this.membersCount;
-  }
+  public incrementMembersCount(amount: number = 1): number {}
 
   public addOds(ods: ODSEnum | Set<ODSEnum>): void {

[NoCoverage] AssignmentOperator
src/community-reports/domain/CommunityByCommunityId.ts:73:5
   }
 
   public incrementMembersCount(amount: number = 1): number {
-    this.membersCount += amount;
+    this.membersCount -= amount;
     return this.membersCount;
   }

[NoCoverage] BlockStatement
src/community-reports/domain/CommunityByCommunityId.ts:77:52
     return this.membersCount;
   }
 
-  public addOds(ods: ODSEnum | Set<ODSEnum>): void {
-    if (ods instanceof Set) {
-      ods.forEach((item) => this.ods.add(item));
-    } else {
-      this.ods.add(ods);
-    }
-  }
+  public addOds(ods: ODSEnum | Set<ODSEnum>): void {}
 
   public addCauses(causes: CauseByCommunityId | CauseByCommunityId[]): void {

[NoCoverage] ConditionalExpression
src/community-reports/domain/CommunityByCommunityId.ts:78:9
   }
 
   public addOds(ods: ODSEnum | Set<ODSEnum>): void {
-    if (ods instanceof Set) {
+    if (true) {
       ods.forEach((item) => this.ods.add(item));
     } else {

[NoCoverage] BlockStatement
src/community-reports/domain/CommunityByCommunityId.ts:78:29
   }
 
   public addOds(ods: ODSEnum | Set<ODSEnum>): void {
-    if (ods instanceof Set) {
-      ods.forEach((item) => this.ods.add(item));
-    } else {
+    if (ods instanceof Set) {} else {
       this.ods.add(ods);
     }

[NoCoverage] BlockStatement
src/community-reports/domain/CommunityByCommunityId.ts:85:77
     }
   }
 
-  public addCauses(causes: CauseByCommunityId | CauseByCommunityId[]): void {
-    if (Array.isArray(causes)) {
-      this.causes.push(...causes);
-    } else {
-      this.causes.push(causes);
-    }
-  }
+  public addCauses(causes: CauseByCommunityId | CauseByCommunityId[]): void {}
 }
 

[NoCoverage] ConditionalExpression
src/community-reports/domain/CommunityByCommunityId.ts:86:9
   }
 
   public addCauses(causes: CauseByCommunityId | CauseByCommunityId[]): void {
-    if (Array.isArray(causes)) {
+    if (true) {
       this.causes.push(...causes);
     } else {

[NoCoverage] ConditionalExpression
src/community-reports/domain/CommunityByCommunityId.ts:86:9
   }
 
   public addCauses(causes: CauseByCommunityId | CauseByCommunityId[]): void {
-    if (Array.isArray(causes)) {
+    if (false) {
       this.causes.push(...causes);
     } else {

[NoCoverage] BlockStatement
src/community-reports/domain/CommunityByCommunityId.ts:88:12
   public addCauses(causes: CauseByCommunityId | CauseByCommunityId[]): void {
     if (Array.isArray(causes)) {
       this.causes.push(...causes);
-    } else {
-      this.causes.push(causes);
-    }
+    } else {}
   }
 }
