[NoCoverage] BlockStatement
src/community-reports/exceptions/community-not-found.error.ts:12:27
 import { BaseDomainError } from '@common-lib/common-lib/core/exceptions/base-domain.error';
 
 export class CommunityNotFoundError extends BaseDomainError {
-  constructor(id: string) {
-    super(`The community with the id "${id}" does not exist.`);
-  }
+  constructor(id: string) {}
 }
 
