[NoCoverage] BlockStatement
src/community-reports/infra/action-by-cause-id.repository.cassandra.ts:13:5
   constructor(
     @InjectClient() client: Client, // Inyect the Cassandra client
     @InjectMapper(Persistence.ActionByCauseId) mapper: mapping.Mapper, // Inyect the Cassandra mapper
-  ) {
-    super(client, mapper, Persistence.ActionByCauseId);
-  }
+  ) {}
 
   async findManyByCauseId(causeId: string): Promise<Domain.ActionByCauseId[]> {

[NoCoverage] BlockStatement
src/community-reports/infra/action-by-cause-id.repository.cassandra.ts:17:79
     super(client, mapper, Persistence.ActionByCauseId);
   }
 
-  async findManyByCauseId(causeId: string): Promise<Domain.ActionByCauseId[]> {
-    const entities = await this.findMany({ causeId });
-    return entities.map(ActionByCauseIdMapper.toDomain);
-  }
+  async findManyByCauseId(causeId: string): Promise<Domain.ActionByCauseId[]> {}
 
   async findOneByActionId(

[NoCoverage] BlockStatement
src/community-reports/infra/action-by-cause-id.repository.cassandra.ts:25:38
   async findOneByActionId(
     causeId: string,
     actionId: string,
-  ): Promise<Domain.ActionByCauseId> {
-    const entity = await this.findOne({ causeId, actionId });
-    return ActionByCauseIdMapper.toDomain(entity);
-  }
+  ): Promise<Domain.ActionByCauseId> {}
 
   async save(action: Domain.ActionByCauseId): Promise<void> {

[NoCoverage] ObjectLiteral
src/community-reports/infra/action-by-cause-id.repository.cassandra.ts:26:39
     causeId: string,
     actionId: string,
   ): Promise<Domain.ActionByCauseId> {
-    const entity = await this.findOne({ causeId, actionId });
+    const entity = await this.findOne({});
     return ActionByCauseIdMapper.toDomain(entity);
   }

[NoCoverage] BlockStatement
src/community-reports/infra/action-by-cause-id.repository.cassandra.ts:30:61
     return ActionByCauseIdMapper.toDomain(entity);
   }
 
-  async save(action: Domain.ActionByCauseId): Promise<void> {
-    const entity = ActionByCauseIdMapper.toPersistence(action);
-    return this.saveOne(entity);
-  }
+  async save(action: Domain.ActionByCauseId): Promise<void> {}
 }
 
