[NoCoverage] BlockStatement
src/community-reports/infra/cause-by-community-id.repository.cassandra.ts:13:5
   constructor(
     @InjectClient() client: Client, // Inyect the Cassandra client
     @InjectMapper(Persistence.CauseByCommunityId) mapper: mapping.Mapper, // Inyect the Cassandra mapper
-  ) {
-    super(client, mapper, Persistence.CauseByCommunityId);
-  }
+  ) {}
 
   async findManyByCommunityId(

[NoCoverage] BlockStatement
src/community-reports/infra/cause-by-community-id.repository.cassandra.ts:19:43
 
   async findManyByCommunityId(
     communityId: string,
-  ): Promise<Domain.CauseByCommunityId[]> {
-    const entity = await this.findMany({ communityId });
-    return entity.map(CauseByCommunityIdMapper.toDomain);
-  }
+  ): Promise<Domain.CauseByCommunityId[]> {}
 
   async findOneByCauseId(

[NoCoverage] BlockStatement
src/community-reports/infra/cause-by-community-id.repository.cassandra.ts:27:41
   async findOneByCauseId(
     communityId: string,
     causeId: string,
-  ): Promise<Domain.CauseByCommunityId> {
-    const entity = await this.findOne({ communityId, causeId });
-    return CauseByCommunityIdMapper.toDomain(entity);
-  }
+  ): Promise<Domain.CauseByCommunityId> {}
 
   async save(cause: Domain.CauseByCommunityId): Promise<void> {

[NoCoverage] BlockStatement
src/community-reports/infra/cause-by-community-id.repository.cassandra.ts:32:63
     return CauseByCommunityIdMapper.toDomain(entity);
   }
 
-  async save(cause: Domain.CauseByCommunityId): Promise<void> {
-    const entity = CauseByCommunityIdMapper.toPersistence(cause);
-    return this.saveOne(entity);
-  }
+  async save(cause: Domain.CauseByCommunityId): Promise<void> {}
 }
 
