[NoCoverage] BlockStatement
src/community-reports/infra/community-by-community-id.repository.cassandra.ts:14:5
   constructor(
     @InjectClient() client: Client, // Inyect the Cassandra client
     @InjectMapper(Persistence.CommunityByCommunityId) mapper: mapping.Mapper, // Inyect the Cassandra mapper
-  ) {
-    super(client, mapper, Persistence.CommunityByCommunityId);
-  }
+  ) {}
 
   async findOneByCommunityId(

[NoCoverage] BlockStatement
src/community-reports/infra/community-by-community-id.repository.cassandra.ts:20:45
 
   async findOneByCommunityId(
     communityId: string,
-  ): Promise<Domain.CommunityByCommunityId> {
-    const entity = await this.findOne({ communityId });
-
-    // If the entity is not found, throw a CommunityNotFoundError
-    if (!entity) {
-      throw new CommunityNotFoundError(communityId);
-    }
-
-    return CommunityByCommunityIdMapper.toDomain(entity);
-  }
+  ): Promise<Domain.CommunityByCommunityId> {}
 
   async save(community: Domain.CommunityByCommunityId): Promise<void> {

[NoCoverage] BlockStatement
src/community-reports/infra/community-by-community-id.repository.cassandra.ts:24:18
     const entity = await this.findOne({ communityId });
 
     // If the entity is not found, throw a CommunityNotFoundError
-    if (!entity) {
-      throw new CommunityNotFoundError(communityId);
-    }
+    if (!entity) {}
 
     return CommunityByCommunityIdMapper.toDomain(entity);

[NoCoverage] ConditionalExpression
src/community-reports/infra/community-by-community-id.repository.cassandra.ts:24:9
     const entity = await this.findOne({ communityId });
 
     // If the entity is not found, throw a CommunityNotFoundError
-    if (!entity) {
+    if (true) {
       throw new CommunityNotFoundError(communityId);
     }

[NoCoverage] BlockStatement
src/community-reports/infra/community-by-community-id.repository.cassandra.ts:31:71
     return CommunityByCommunityIdMapper.toDomain(entity);
   }
 
-  async save(community: Domain.CommunityByCommunityId): Promise<void> {
-    const entity = CommunityByCommunityIdMapper.toPersistence(community);
-    return this.saveOne(entity);
-  }
+  async save(community: Domain.CommunityByCommunityId): Promise<void> {}
 }
 
