[NoCoverage] ArrayDeclaration
community-reports/infra/filters/community-reports-domain-exception.filter.ts:28:5
   private readonly exceptionStatusMap = new Map<
     ExceptionConstructor,
     HttpStatus
-  >([
-    [CommunityNotFoundError, HttpStatus.NOT_FOUND],
-    [UserNotAuthorizedError, HttpStatus.FORBIDDEN],
-  ]);
+  >([]);
 
   catch(exception: Error, host: ArgumentsHost) {

[NoCoverage] ArrayDeclaration
community-reports/infra/filters/community-reports-domain-exception.filter.ts:29:5
     ExceptionConstructor,
     HttpStatus
   >([
-    [CommunityNotFoundError, HttpStatus.NOT_FOUND],
+    [],
     [UserNotAuthorizedError, HttpStatus.FORBIDDEN],
   ]);
