[NoCoverage] BlockStatement
platform-statistics/community-statistics/application/community-statistics.service.impl.ts:14:44
     private readonly communityStatisticsRepository: CommunityStatisticsRepository,
   ) {}
 
-  getAll(): Promise<CommunityStatistics[]> {
-    return this.communityStatisticsRepository.findAllEntities();
-  }
+  getAll(): Promise<CommunityStatistics[]> {}
 
   getTotalSupports(): Promise<number> {

[NoCoverage] BlockStatement
platform-statistics/community-statistics/application/community-statistics.service.impl.ts:18:39
     return this.communityStatisticsRepository.findAllEntities();
   }
 
-  getTotalSupports(): Promise<number> {
-    return this.communityStatisticsRepository.getTotalSupports();
-  }
+  getTotalSupports(): Promise<number> {}
 
   registerComunityCreation(

[NoCoverage] BlockStatement
platform-statistics/community-statistics/application/community-statistics.service.impl.ts:25:20
   registerComunityCreation(
     communityId: string,
     communityName: string,
-  ): Promise<void> {
-    // Create a new community statistics
-    const communityStatistics = CommunityStatistics.create(
-      communityId,
-      communityName,
-    );
-
-    // Save
-    return this.communityStatisticsRepository.save(communityStatistics);
-  }
+  ): Promise<void> {}
 
   async registerCauseSupport(communityId: string): Promise<void> {

[NoCoverage] BlockStatement
platform-statistics/community-statistics/application/community-statistics.service.impl.ts:36:66
     return this.communityStatisticsRepository.save(communityStatistics);
   }
 
-  async registerCauseSupport(communityId: string): Promise<void> {
-    // Fetch the community statistics
-    const communityStatistics =
-      await this.communityStatisticsRepository.findOneEntity(communityId);
-
-    // Increment the support count
-    communityStatistics.incrementSupportCount();
-
-    // Save
-    return this.communityStatisticsRepository.save(communityStatistics);
-  }
+  async registerCauseSupport(communityId: string): Promise<void> {}
 
   async registerCausesTargeted(

[NoCoverage] BlockStatement
platform-statistics/community-statistics/application/community-statistics.service.impl.ts:51:20
   async registerCausesTargeted(
     communityId: string,
     amount: number,
-  ): Promise<void> {
-    // Fetch the community statistics
-    const communityStatistics =
-      await this.communityStatisticsRepository.findOneEntity(communityId);
-
-    // Increment the counter
-    communityStatistics.incrementActionsTargetTotal(amount);
-
-    // Save
-    return this.communityStatisticsRepository.save(communityStatistics);
-  }
+  ): Promise<void> {}
 
   async registerCausesAchieved(

[NoCoverage] BlockStatement
platform-statistics/community-statistics/application/community-statistics.service.impl.ts:66:20
   async registerCausesAchieved(
     communityId: string,
     amount: number,
-  ): Promise<void> {
-    // Fetch the community statistics
-    const communityStatistics =
-      await this.communityStatisticsRepository.findOneEntity(communityId);
-
-    // Increment the counter
-    communityStatistics.incrementActionsAchievedTotal(amount);
-
-    // Save
-    return this.communityStatisticsRepository.save(communityStatistics);
-  }
+  ): Promise<void> {}
 }
 
