[NoCoverage] BlockStatement
platform-statistics/community-statistics/domain/CommunityStatistics.ts:13:56
 }
 
 export class CommunityStatistics extends Entity<CommunityStatisticsProps> {
-  private constructor(props: CommunityStatisticsProps) {
-    super(props);
-  }
+  private constructor(props: CommunityStatisticsProps) {}
 
   get communityId(): string {

[NoCoverage] BlockStatement
platform-statistics/community-statistics/domain/CommunityStatistics.ts:25:30
     return this.props.communityName;
   }
 
-  get supportCount(): number {
-    return this.props.supportCount;
-  }
+  get supportCount(): number {}
 
   get actionsTargetTotal(): number {

[NoCoverage] BlockStatement
platform-statistics/community-statistics/domain/CommunityStatistics.ts:29:36
     return this.props.supportCount;
   }
 
-  get actionsTargetTotal(): number {
-    return this.props.actionsTargetTotal;
-  }
+  get actionsTargetTotal(): number {}
 
   get actionsAchievedTotal(): number {

[NoCoverage] BlockStatement
platform-statistics/community-statistics/domain/CommunityStatistics.ts:33:38
     return this.props.actionsTargetTotal;
   }
 
-  get actionsAchievedTotal(): number {
-    return this.props.actionsAchievedTotal;
-  }
+  get actionsAchievedTotal(): number {}
 
   public static create(

[NoCoverage] BlockStatement
platform-statistics/community-statistics/domain/CommunityStatistics.ts:43:26
     supportCount: number = 0,
     actionsTargetTotal: number = 0,
     actionsAchievedTotal: number = 0,
-  ): CommunityStatistics {
-    if (supportCount < 0) {
-      throw new NegativeCountError(
-        '[CommunityStatistics] Support count cannot be negative.',
-      );
-    }
-    if (actionsTargetTotal < 0) {
-      throw new NegativeCountError(
-        '[CommunityStatistics] Actions target total cannot be negative.',
-      );
-    }
-    if (actionsAchievedTotal < 0) {
-      throw new NegativeCountError(
-        '[CommunityStatistics] Actions achieved total cannot be negative.',
-      );
-    }
-
-    return new CommunityStatistics({
-      communityId,
-      communityName,
-      supportCount,
-      actionsTargetTotal,
-      actionsAchievedTotal,
-    });
-  }
+  ): CommunityStatistics {}
 
   public incrementSupportCount(amount: number = 1): number {

[NoCoverage] ConditionalExpression
platform-statistics/community-statistics/domain/CommunityStatistics.ts:44:9
     actionsTargetTotal: number = 0,
     actionsAchievedTotal: number = 0,
   ): CommunityStatistics {
-    if (supportCount < 0) {
+    if (false) {
       throw new NegativeCountError(
         '[CommunityStatistics] Support count cannot be negative.',

[NoCoverage] BlockStatement
platform-statistics/community-statistics/domain/CommunityStatistics.ts:44:27
     actionsTargetTotal: number = 0,
     actionsAchievedTotal: number = 0,
   ): CommunityStatistics {
-    if (supportCount < 0) {
-      throw new NegativeCountError(
-        '[CommunityStatistics] Support count cannot be negative.',
-      );
-    }
+    if (supportCount < 0) {}
     if (actionsTargetTotal < 0) {
       throw new NegativeCountError(

[NoCoverage] ConditionalExpression
platform-statistics/community-statistics/domain/CommunityStatistics.ts:49:9
         '[CommunityStatistics] Support count cannot be negative.',
       );
     }
-    if (actionsTargetTotal < 0) {
+    if (false) {
       throw new NegativeCountError(
         '[CommunityStatistics] Actions target total cannot be negative.',

[NoCoverage] EqualityOperator
platform-statistics/community-statistics/domain/CommunityStatistics.ts:49:9
         '[CommunityStatistics] Support count cannot be negative.',
       );
     }
-    if (actionsTargetTotal < 0) {
+    if (actionsTargetTotal <= 0) {
       throw new NegativeCountError(
         '[CommunityStatistics] Actions target total cannot be negative.',

[NoCoverage] EqualityOperator
platform-statistics/community-statistics/domain/CommunityStatistics.ts:54:9
         '[CommunityStatistics] Actions target total cannot be negative.',
       );
     }
-    if (actionsAchievedTotal < 0) {
+    if (actionsAchievedTotal <= 0) {
       throw new NegativeCountError(
         '[CommunityStatistics] Actions achieved total cannot be negative.',

[NoCoverage] BlockStatement
platform-statistics/community-statistics/domain/CommunityStatistics.ts:54:35
         '[CommunityStatistics] Actions target total cannot be negative.',
       );
     }
-    if (actionsAchievedTotal < 0) {
-      throw new NegativeCountError(
-        '[CommunityStatistics] Actions achieved total cannot be negative.',
-      );
-    }
+    if (actionsAchievedTotal < 0) {}
 
     return new CommunityStatistics({

[NoCoverage] BlockStatement
platform-statistics/community-statistics/domain/CommunityStatistics.ts:69:60
     });
   }
 
-  public incrementSupportCount(amount: number = 1): number {
-    this.props.supportCount += amount;
-    return this.props.supportCount;
-  }
+  public incrementSupportCount(amount: number = 1): number {}
 
   public incrementActionsTargetTotal(amount: number): number {

[NoCoverage] AssignmentOperator
platform-statistics/community-statistics/domain/CommunityStatistics.ts:70:5
   }
 
   public incrementSupportCount(amount: number = 1): number {
-    this.props.supportCount += amount;
+    this.props.supportCount -= amount;
     return this.props.supportCount;
   }

[NoCoverage] BlockStatement
platform-statistics/community-statistics/domain/CommunityStatistics.ts:74:62
     return this.props.supportCount;
   }
 
-  public incrementActionsTargetTotal(amount: number): number {
-    this.props.actionsTargetTotal += amount;
-    return this.props.actionsTargetTotal;
-  }
+  public incrementActionsTargetTotal(amount: number): number {}
 
   public incrementActionsAchievedTotal(amount: number): number {

[NoCoverage] AssignmentOperator
platform-statistics/community-statistics/domain/CommunityStatistics.ts:75:5
   }
 
   public incrementActionsTargetTotal(amount: number): number {
-    this.props.actionsTargetTotal += amount;
+    this.props.actionsTargetTotal -= amount;
     return this.props.actionsTargetTotal;
   }

[NoCoverage] BlockStatement
platform-statistics/community-statistics/domain/CommunityStatistics.ts:79:64
     return this.props.actionsTargetTotal;
   }
 
-  public incrementActionsAchievedTotal(amount: number): number {
-    this.props.actionsAchievedTotal += amount;
-    return this.props.actionsAchievedTotal;
-  }
+  public incrementActionsAchievedTotal(amount: number): number {}
 }
 

[NoCoverage] AssignmentOperator
platform-statistics/community-statistics/domain/CommunityStatistics.ts:80:5
   }
 
   public incrementActionsAchievedTotal(amount: number): number {
-    this.props.actionsAchievedTotal += amount;
+    this.props.actionsAchievedTotal -= amount;
     return this.props.actionsAchievedTotal;
   }
