[NoCoverage] BlockStatement
platform-statistics/community-statistics/infra/community-statistics.repository.cassandra.ts:13:5
   constructor(
     @InjectClient() client: Client, // Inyect the Cassandra client
     @InjectMapper(Persistence.CommunityStatistics) mapper: mapping.Mapper, // Inyect the Cassandra mapper
-  ) {
-    super(client, mapper, Persistence.CommunityStatistics);
-  }
+  ) {}
 
   public async findOneEntity(

[NoCoverage] BlockStatement
platform-statistics/community-statistics/infra/community-statistics.repository.cassandra.ts:19:42
 
   public async findOneEntity(
     communityId: string,
-  ): Promise<Domain.CommunityStatistics> {
-    const entity = await this.findOne({ communityId });
-
-    if (!entity) {
-      throw new Error(`Community statistics with id:${communityId} not found`);
-    }
-
-    return CommunityStatisticsMapper.toDomain(entity);
-  }
+  ): Promise<Domain.CommunityStatistics> {}
 
   public async findAllEntities(): Promise<Domain.CommunityStatistics[]> {

[NoCoverage] ObjectLiteral
platform-statistics/community-statistics/infra/community-statistics.repository.cassandra.ts:20:39
   public async findOneEntity(
     communityId: string,
   ): Promise<Domain.CommunityStatistics> {
-    const entity = await this.findOne({ communityId });
+    const entity = await this.findOne({});
 
     if (!entity) {

[NoCoverage] ConditionalExpression
platform-statistics/community-statistics/infra/community-statistics.repository.cassandra.ts:22:9
   ): Promise<Domain.CommunityStatistics> {
     const entity = await this.findOne({ communityId });
 
-    if (!entity) {
+    if (false) {
       throw new Error(`Community statistics with id:${communityId} not found`);
     }

[NoCoverage] StringLiteral
platform-statistics/community-statistics/infra/community-statistics.repository.cassandra.ts:23:23
     const entity = await this.findOne({ communityId });
 
     if (!entity) {
-      throw new Error(`Community statistics with id:${communityId} not found`);
+      throw new Error(``);
     }
 

[NoCoverage] BlockStatement
platform-statistics/community-statistics/infra/community-statistics.repository.cassandra.ts:29:73
     return CommunityStatisticsMapper.toDomain(entity);
   }
 
-  public async findAllEntities(): Promise<Domain.CommunityStatistics[]> {
-    const entities = await this.findAll();
-    return entities.map(CommunityStatisticsMapper.toDomain);
-  }
+  public async findAllEntities(): Promise<Domain.CommunityStatistics[]> {}
 
   async getTotalSupports(): Promise<number> {

[NoCoverage] BlockStatement
platform-statistics/community-statistics/infra/community-statistics.repository.cassandra.ts:34:45
     return entities.map(CommunityStatisticsMapper.toDomain);
   }
 
-  async getTotalSupports(): Promise<number> {
-    const cql = `SELECT SUM(support_count) AS total_supports FROM ${this.keyspaceName}.${this.tableName}`;
-    const result = await this.mapCqlAsExecution(cql, undefined, undefined)({});
-    const totalSupports = result.first()?.['total_supports'] || 0;
-    return totalSupports;
-  }
+  async getTotalSupports(): Promise<number> {}
 
   async save(communityStatistics: Domain.CommunityStatistics): Promise<void> {

[NoCoverage] StringLiteral
platform-statistics/community-statistics/infra/community-statistics.repository.cassandra.ts:35:17
   }
 
   async getTotalSupports(): Promise<number> {
-    const cql = `SELECT SUM(support_count) AS total_supports FROM ${this.keyspaceName}.${this.tableName}`;
+    const cql = ``;
     const result = await this.mapCqlAsExecution(cql, undefined, undefined)({});
     const totalSupports = result.first()?.['total_supports'] || 0;

[NoCoverage] ConditionalExpression
platform-statistics/community-statistics/infra/community-statistics.repository.cassandra.ts:37:27
   async getTotalSupports(): Promise<number> {
     const cql = `SELECT SUM(support_count) AS total_supports FROM ${this.keyspaceName}.${this.tableName}`;
     const result = await this.mapCqlAsExecution(cql, undefined, undefined)({});
-    const totalSupports = result.first()?.['total_supports'] || 0;
+    const totalSupports = false;
     return totalSupports;
   }

[NoCoverage] LogicalOperator
platform-statistics/community-statistics/infra/community-statistics.repository.cassandra.ts:37:27
   async getTotalSupports(): Promise<number> {
     const cql = `SELECT SUM(support_count) AS total_supports FROM ${this.keyspaceName}.${this.tableName}`;
     const result = await this.mapCqlAsExecution(cql, undefined, undefined)({});
-    const totalSupports = result.first()?.['total_supports'] || 0;
+    const totalSupports = result.first()?.['total_supports'] && 0;
     return totalSupports;
   }

[NoCoverage] BlockStatement
platform-statistics/community-statistics/infra/community-statistics.repository.cassandra.ts:41:78
     return totalSupports;
   }
 
-  async save(communityStatistics: Domain.CommunityStatistics): Promise<void> {
-    const entity = CommunityStatisticsMapper.toPersistence(communityStatistics);
-    await this.saveOne(entity);
-  }
+  async save(communityStatistics: Domain.CommunityStatistics): Promise<void> {}
 }
 
