[NoCoverage] BlockStatement
platform-statistics/ods-statistics/application/ods-statistics.service.impl.ts:18:45
     private readonly odsCommunityRepository: OdsCommunityRepository,
   ) {}
 
-  getAll(): Promise<Domain.OdsStatistics[]> {
-    return this.odsStatisticsRepository.findAllEntities();
-  }
+  getAll(): Promise<Domain.OdsStatistics[]> {}
 
   getTotalSupports(): Promise<number> {

[NoCoverage] BlockStatement
platform-statistics/ods-statistics/application/ods-statistics.service.impl.ts:22:39
     return this.odsStatisticsRepository.findAllEntities();
   }
 
-  getTotalSupports(): Promise<number> {
-    return this.odsStatisticsRepository.getTotalSupports();
-  }
+  getTotalSupports(): Promise<number> {}
 
   async registerCauseCreation(

[NoCoverage] ConditionalExpression
platform-statistics/ods-statistics/application/ods-statistics.service.impl.ts:38:13
           await this.odsStatisticsRepository.findOneEntity(odsId);
 
         // If it doesn't exist, create it
-        if (!odsStatistic) {
+        if (false) {
           odsStatistic = Domain.OdsStatistics.create(odsId as ODSEnum);
         }

[NoCoverage] BooleanLiteral
platform-statistics/ods-statistics/application/ods-statistics.service.impl.ts:38:13
           await this.odsStatisticsRepository.findOneEntity(odsId);
 
         // If it doesn't exist, create it
-        if (!odsStatistic) {
+        if (odsStatistic) {
           odsStatistic = Domain.OdsStatistics.create(odsId as ODSEnum);
         }

[NoCoverage] BlockStatement
platform-statistics/ods-statistics/application/ods-statistics.service.impl.ts:50:25
           odsId,
           communityId,
         );
-        if (!community) {
-          const newCommunity = Domain.OdsCommunity.create(
-            odsStatistic.odsId,
-            communityId,
-          );
-
-          // Save the community
-          await this.odsCommunityRepository.save(newCommunity);
-
-          // We only increment the communities count the first time for each ODS
-          odsStatistic.incrementCommunitiesCount();
-        }
+        if (!community) {}
 
         // Save the ODS statistics

[NoCoverage] ConditionalExpression
platform-statistics/ods-statistics/application/ods-statistics.service.impl.ts:50:13
           odsId,
           communityId,
         );
-        if (!community) {
+        if (false) {
           const newCommunity = Domain.OdsCommunity.create(
             odsStatistic.odsId,

[NoCoverage] BlockStatement
platform-statistics/ods-statistics/application/ods-statistics.service.impl.ts:69:64
     );
   }
 
-  async registerCauseSupport(ods: Set<ODSEnum>): Promise<void> {
-    // For each ODS
-    mapODSEnumSetToNumberArray(ods).map(async (odsId) => {
-      // Fetch the ODS statistics
-      let odsStatistic =
-        await this.odsStatisticsRepository.findOneEntity(odsId);
-
-      // If it doesn't exist, create it
-      if (!odsStatistic) {
-        odsStatistic = Domain.OdsStatistics.create(odsId as ODSEnum);
-      }
-
-      // Increment the supports count
-      odsStatistic.incrementSupportsCount();
-
-      // Save the ODS statistics
-      await this.odsStatisticsRepository.saveOneEntity(odsStatistic);
-    });
-  }
+  async registerCauseSupport(ods: Set<ODSEnum>): Promise<void> {}
 }
 

[NoCoverage] BlockStatement
platform-statistics/ods-statistics/application/ods-statistics.service.impl.ts:71:58
 
   async registerCauseSupport(ods: Set<ODSEnum>): Promise<void> {
     // For each ODS
-    mapODSEnumSetToNumberArray(ods).map(async (odsId) => {
-      // Fetch the ODS statistics
-      let odsStatistic =
-        await this.odsStatisticsRepository.findOneEntity(odsId);
-
-      // If it doesn't exist, create it
-      if (!odsStatistic) {
-        odsStatistic = Domain.OdsStatistics.create(odsId as ODSEnum);
-      }
-
-      // Increment the supports count
-      odsStatistic.incrementSupportsCount();
-
-      // Save the ODS statistics
-      await this.odsStatisticsRepository.saveOneEntity(odsStatistic);
-    });
+    mapODSEnumSetToNumberArray(ods).map(async (odsId) => {});
   }
 }

[NoCoverage] ConditionalExpression
platform-statistics/ods-statistics/application/ods-statistics.service.impl.ts:77:11
         await this.odsStatisticsRepository.findOneEntity(odsId);
 
       // If it doesn't exist, create it
-      if (!odsStatistic) {
+      if (true) {
         odsStatistic = Domain.OdsStatistics.create(odsId as ODSEnum);
       }

[NoCoverage] BlockStatement
platform-statistics/ods-statistics/application/ods-statistics.service.impl.ts:77:26
         await this.odsStatisticsRepository.findOneEntity(odsId);
 
       // If it doesn't exist, create it
-      if (!odsStatistic) {
-        odsStatistic = Domain.OdsStatistics.create(odsId as ODSEnum);
-      }
+      if (!odsStatistic) {}
 
       // Increment the supports count
