[NoCoverage] BlockStatement
platform-statistics/ods-statistics/domain/OdsCommunity.ts:11:49
 }
 
 export class OdsCommunity extends Entity<OdsCommunityProps> {
-  private constructor(props: OdsCommunityProps) {
-    super(props);
-  }
+  private constructor(props: OdsCommunityProps) {}
 
   get odsId(): ODSEnum {

[NoCoverage] BlockStatement
platform-statistics/ods-statistics/domain/OdsCommunity.ts:15:24
     super(props);
   }
 
-  get odsId(): ODSEnum {
-    return this.props.odsId;
-  }
+  get odsId(): ODSEnum {}
 
   get communityId(): string {

[NoCoverage] BlockStatement
platform-statistics/ods-statistics/domain/OdsCommunity.ts:23:75
     return this.props.communityId;
   }
 
-  public static create(odsId: ODSEnum, communityId: string): OdsCommunity {
-    if (!odsId || !communityId) {
-      throw new MissingPropertiesError(
-        '[OdsCommunity] OdsId and communityId are required.',
-      );
-    }
-    return new OdsCommunity({ odsId, communityId });
-  }
+  public static create(odsId: ODSEnum, communityId: string): OdsCommunity {}
 }
 

[NoCoverage] ConditionalExpression
platform-statistics/ods-statistics/domain/OdsCommunity.ts:24:9
   }
 
   public static create(odsId: ODSEnum, communityId: string): OdsCommunity {
-    if (!odsId || !communityId) {
+    if (false) {
       throw new MissingPropertiesError(
         '[OdsCommunity] OdsId and communityId are required.',

[NoCoverage] ConditionalExpression
platform-statistics/ods-statistics/domain/OdsCommunity.ts:24:9
   }
 
   public static create(odsId: ODSEnum, communityId: string): OdsCommunity {
-    if (!odsId || !communityId) {
+    if (true) {
       throw new MissingPropertiesError(
         '[OdsCommunity] OdsId and communityId are required.',

[NoCoverage] ObjectLiteral
platform-statistics/ods-statistics/domain/OdsCommunity.ts:29:29
         '[OdsCommunity] OdsId and communityId are required.',
       );
     }
-    return new OdsCommunity({ odsId, communityId });
+    return new OdsCommunity({});
   }
 }
