[NoCoverage] BlockStatement
platform-statistics/ods-statistics/domain/OdsStatistics.ts:13:50
 }
 
 export class OdsStatistics extends Entity<OdsStatisticsProps> {
-  private constructor(props: OdsStatisticsProps) {
-    super(props);
-  }
+  private constructor(props: OdsStatisticsProps) {}
 
   get odsId(): ODSEnum {

[NoCoverage] BlockStatement
platform-statistics/ods-statistics/domain/OdsStatistics.ts:21:34
     return this.props.odsId;
   }
 
-  get communitiesCount(): number {
-    return this.props.communitiesCount;
-  }
+  get communitiesCount(): number {}
 
   get causesCount(): number {

[NoCoverage] BlockStatement
platform-statistics/ods-statistics/domain/OdsStatistics.ts:25:29
     return this.props.communitiesCount;
   }
 
-  get causesCount(): number {
-    return this.props.causesCount;
-  }
+  get causesCount(): number {}
 
   get supportsCount(): number {

[NoCoverage] BlockStatement
platform-statistics/ods-statistics/domain/OdsStatistics.ts:38:20
     communitiesCount: number = 0,
     causesCount: number = 0,
     supportsCount: number = 0,
-  ): OdsStatistics {
-    if (communitiesCount < 0) {
-      throw new NegativeCountError(
-        '[OdsStatistics] Communities count cannot be negative.',
-      );
-    }
-    if (causesCount < 0) {
-      throw new NegativeCountError(
-        '[OdsStatistics] Causes count cannot be negative.',
-      );
-    }
-    if (supportsCount < 0) {
-      throw new NegativeCountError(
-        '[OdsStatistics] Supports count cannot be negative.',
-      );
-    }
-
-    return new OdsStatistics({
-      odsId,
-      communitiesCount,
-      causesCount,
-      supportsCount,
-    });
-  }
+  ): OdsStatistics {}
 
   public incrementCommunitiesCount(amount: number = 1): number {

[NoCoverage] ConditionalExpression
platform-statistics/ods-statistics/domain/OdsStatistics.ts:39:9
     causesCount: number = 0,
     supportsCount: number = 0,
   ): OdsStatistics {
-    if (communitiesCount < 0) {
+    if (true) {
       throw new NegativeCountError(
         '[OdsStatistics] Communities count cannot be negative.',

[NoCoverage] EqualityOperator
platform-statistics/ods-statistics/domain/OdsStatistics.ts:39:9
     causesCount: number = 0,
     supportsCount: number = 0,
   ): OdsStatistics {
-    if (communitiesCount < 0) {
+    if (communitiesCount >= 0) {
       throw new NegativeCountError(
         '[OdsStatistics] Communities count cannot be negative.',

[NoCoverage] StringLiteral
platform-statistics/ods-statistics/domain/OdsStatistics.ts:41:9
   ): OdsStatistics {
     if (communitiesCount < 0) {
       throw new NegativeCountError(
-        '[OdsStatistics] Communities count cannot be negative.',
+        "",
       );
     }

[NoCoverage] BlockStatement
platform-statistics/ods-statistics/domain/OdsStatistics.ts:44:26
         '[OdsStatistics] Communities count cannot be negative.',
       );
     }
-    if (causesCount < 0) {
-      throw new NegativeCountError(
-        '[OdsStatistics] Causes count cannot be negative.',
-      );
-    }
+    if (causesCount < 0) {}
     if (supportsCount < 0) {
       throw new NegativeCountError(

[NoCoverage] EqualityOperator
platform-statistics/ods-statistics/domain/OdsStatistics.ts:44:9
         '[OdsStatistics] Communities count cannot be negative.',
       );
     }
-    if (causesCount < 0) {
+    if (causesCount <= 0) {
       throw new NegativeCountError(
         '[OdsStatistics] Causes count cannot be negative.',

[NoCoverage] StringLiteral
platform-statistics/ods-statistics/domain/OdsStatistics.ts:46:9
     }
     if (causesCount < 0) {
       throw new NegativeCountError(
-        '[OdsStatistics] Causes count cannot be negative.',
+        "",
       );
     }

[NoCoverage] EqualityOperator
platform-statistics/ods-statistics/domain/OdsStatistics.ts:49:9
         '[OdsStatistics] Causes count cannot be negative.',
       );
     }
-    if (supportsCount < 0) {
+    if (supportsCount >= 0) {
       throw new NegativeCountError(
         '[OdsStatistics] Supports count cannot be negative.',

[NoCoverage] BlockStatement
platform-statistics/ods-statistics/domain/OdsStatistics.ts:49:28
         '[OdsStatistics] Causes count cannot be negative.',
       );
     }
-    if (supportsCount < 0) {
-      throw new NegativeCountError(
-        '[OdsStatistics] Supports count cannot be negative.',
-      );
-    }
+    if (supportsCount < 0) {}
 
     return new OdsStatistics({

[NoCoverage] BlockStatement
platform-statistics/ods-statistics/domain/OdsStatistics.ts:63:64
     });
   }
 
-  public incrementCommunitiesCount(amount: number = 1): number {
-    this.props.communitiesCount += amount;
-    return this.props.communitiesCount;
-  }
+  public incrementCommunitiesCount(amount: number = 1): number {}
 
   public incrementCausesCount(amount: number = 1): number {

[NoCoverage] AssignmentOperator
platform-statistics/ods-statistics/domain/OdsStatistics.ts:64:5
   }
 
   public incrementCommunitiesCount(amount: number = 1): number {
-    this.props.communitiesCount += amount;
+    this.props.communitiesCount -= amount;
     return this.props.communitiesCount;
   }

[NoCoverage] BlockStatement
platform-statistics/ods-statistics/domain/OdsStatistics.ts:68:59
     return this.props.communitiesCount;
   }
 
-  public incrementCausesCount(amount: number = 1): number {
-    this.props.causesCount += amount;
-    return this.props.causesCount;
-  }
+  public incrementCausesCount(amount: number = 1): number {}
 
   public incrementSupportsCount(amount: number = 1): number {

[NoCoverage] AssignmentOperator
platform-statistics/ods-statistics/domain/OdsStatistics.ts:69:5
   }
 
   public incrementCausesCount(amount: number = 1): number {
-    this.props.causesCount += amount;
+    this.props.causesCount -= amount;
     return this.props.causesCount;
   }

[NoCoverage] BlockStatement
platform-statistics/ods-statistics/domain/OdsStatistics.ts:73:61
     return this.props.causesCount;
   }
 
-  public incrementSupportsCount(amount: number = 1): number {
-    this.props.supportsCount += amount;
-    return this.props.supportsCount;
-  }
+  public incrementSupportsCount(amount: number = 1): number {}
 }
 

[NoCoverage] AssignmentOperator
platform-statistics/ods-statistics/domain/OdsStatistics.ts:74:5
   }
 
   public incrementSupportsCount(amount: number = 1): number {
-    this.props.supportsCount += amount;
+    this.props.supportsCount -= amount;
     return this.props.supportsCount;
   }
