[NoCoverage] BlockStatement
platform-statistics/ods-statistics/infra/ods-community.repository.cassandra.ts:13:5
   constructor(
     @InjectClient() client: Client, // Inyect the Cassandra client
     @InjectMapper(Persistence.OdsCommunity) mapper: mapping.Mapper, // Inyect the Cassandra mapper
-  ) {
-    super(client, mapper, Persistence.OdsCommunity);
-  }
+  ) {}
 
   async findOneEntity(

[NoCoverage] BlockStatement
platform-statistics/ods-statistics/infra/ods-community.repository.cassandra.ts:20:42
   async findOneEntity(
     odsId: number,
     communityId: string,
-  ): Promise<Domain.OdsCommunity | null> {
-    const community = await this.findOne({ odsId, communityId });
-    if (!community) {
-      return null;
-    }
-    return OdsCommunityMapper.toDomain(community);
-  }
+  ): Promise<Domain.OdsCommunity | null> {}
 
   async save(community: Domain.OdsCommunity): Promise<void> {

[NoCoverage] ConditionalExpression
platform-statistics/ods-statistics/infra/ods-community.repository.cassandra.ts:22:9
     communityId: string,
   ): Promise<Domain.OdsCommunity | null> {
     const community = await this.findOne({ odsId, communityId });
-    if (!community) {
+    if (true) {
       return null;
     }

[NoCoverage] BooleanLiteral
platform-statistics/ods-statistics/infra/ods-community.repository.cassandra.ts:22:9
     communityId: string,
   ): Promise<Domain.OdsCommunity | null> {
     const community = await this.findOne({ odsId, communityId });
-    if (!community) {
+    if (community) {
       return null;
     }

[NoCoverage] BlockStatement
platform-statistics/ods-statistics/infra/ods-community.repository.cassandra.ts:28:61
     return OdsCommunityMapper.toDomain(community);
   }
 
-  async save(community: Domain.OdsCommunity): Promise<void> {
-    const entity = OdsCommunityMapper.toPersistence(community);
-    await this.saveOne(entity);
-  }
+  async save(community: Domain.OdsCommunity): Promise<void> {}
 }
 
