[NoCoverage] BlockStatement
platform-statistics/ods-statistics/infra/ods-statistics.repository.cassandra.ts:13:5
   constructor(
     @InjectClient() client: Client, // Inyect the Cassandra client
     @InjectMapper(Persistence.OdsStatistics) mapper: mapping.Mapper, // Inyect the Cassandra mapper
-  ) {
-    super(client, mapper, Persistence.OdsStatistics);
-  }
+  ) {}
 
   public async findAllEntities(): Promise<Domain.OdsStatistics[]> {

[NoCoverage] BlockStatement
platform-statistics/ods-statistics/infra/ods-statistics.repository.cassandra.ts:17:67
     super(client, mapper, Persistence.OdsStatistics);
   }
 
-  public async findAllEntities(): Promise<Domain.OdsStatistics[]> {
-    const results = await this.findAll();
-    return results.map(OdsStatisticsMapper.toDomain);
-  }
+  public async findAllEntities(): Promise<Domain.OdsStatistics[]> {}
 
   async findOneEntity(odsId: number): Promise<Domain.OdsStatistics> | null {

[NoCoverage] BlockStatement
platform-statistics/ods-statistics/infra/ods-statistics.repository.cassandra.ts:22:76
     return results.map(OdsStatisticsMapper.toDomain);
   }
 
-  async findOneEntity(odsId: number): Promise<Domain.OdsStatistics> | null {
-    const entity = await this.findOne({ odsId });
-    if (!entity) {
-      return null;
-    }
-    return OdsStatisticsMapper.toDomain(entity);
-  }
+  async findOneEntity(odsId: number): Promise<Domain.OdsStatistics> | null {}
 
   async getTotalSupports(): Promise<number> {

[NoCoverage] BooleanLiteral
platform-statistics/ods-statistics/infra/ods-statistics.repository.cassandra.ts:24:9
 
   async findOneEntity(odsId: number): Promise<Domain.OdsStatistics> | null {
     const entity = await this.findOne({ odsId });
-    if (!entity) {
+    if (entity) {
       return null;
     }

[NoCoverage] ConditionalExpression
platform-statistics/ods-statistics/infra/ods-statistics.repository.cassandra.ts:24:9
 
   async findOneEntity(odsId: number): Promise<Domain.OdsStatistics> | null {
     const entity = await this.findOne({ odsId });
-    if (!entity) {
+    if (true) {
       return null;
     }

[NoCoverage] BlockStatement
platform-statistics/ods-statistics/infra/ods-statistics.repository.cassandra.ts:30:45
     return OdsStatisticsMapper.toDomain(entity);
   }
 
-  async getTotalSupports(): Promise<number> {
-    const cql = `SELECT SUM(supports_count) AS total_supports FROM ${this.keyspaceName}.${this.tableName}`;
-    const result = await this.mapCqlAsExecution(cql, undefined, undefined)({});
-    const totalSupports = result.first()?.['total_supports'] || 0;
-    return totalSupports;
-  }
+  async getTotalSupports(): Promise<number> {}
 
   async saveOneEntity(odsStatistics: Domain.OdsStatistics): Promise<void> {

[NoCoverage] OptionalChaining
platform-statistics/ods-statistics/infra/ods-statistics.repository.cassandra.ts:33:27
   async getTotalSupports(): Promise<number> {
     const cql = `SELECT SUM(supports_count) AS total_supports FROM ${this.keyspaceName}.${this.tableName}`;
     const result = await this.mapCqlAsExecution(cql, undefined, undefined)({});
-    const totalSupports = result.first()?.['total_supports'] || 0;
+    const totalSupports = result.first()['total_supports'] || 0;
     return totalSupports;
   }

[NoCoverage] BlockStatement
platform-statistics/ods-statistics/infra/ods-statistics.repository.cassandra.ts:37:75
     return totalSupports;
   }
 
-  async saveOneEntity(odsStatistics: Domain.OdsStatistics): Promise<void> {
-    const entity = OdsStatisticsMapper.toPersistence(odsStatistics);
-    await this.saveOne(entity);
-  }
+  async saveOneEntity(odsStatistics: Domain.OdsStatistics): Promise<void> {}
 }
 
