[NoCoverage] BlockStatement
statistics-ms/src/platform-statistics/platform-statistics.controller.ts:22:69
   @Roles(Role.ADMIN)
   @UseGuards(RolesGuard)
   @Get('ods')
-  async findAllOdsStatistics(): Promise<OdsStatisticsResponseDto[]> {
-    const odsStatistics = await this.odsStatisticsService.getAll();
-
-    const totalSupports = await this.odsStatisticsService.getTotalSupports();
-
-    return odsStatistics.map((entity) =>
-      OdsStatisticsMapper.toDto(entity, totalSupports),
-    );
-  }
+  async findAllOdsStatistics(): Promise<OdsStatisticsResponseDto[]> {}
 
   @Roles(Role.ADMIN)

[NoCoverage] ArrowFunction
statistics-ms/src/platform-statistics/platform-statistics.controller.ts:27:30
 
     const totalSupports = await this.odsStatisticsService.getTotalSupports();
 
-    return odsStatistics.map((entity) =>
-      OdsStatisticsMapper.toDto(entity, totalSupports),
+    return odsStatistics.map(() => undefined,
     );
   }

[NoCoverage] BlockStatement
statistics-ms/src/platform-statistics/platform-statistics.controller.ts:37:5
   @Get('community')
   async findAllCommunityStatistics(): Promise<
     CommunityStatisticsResponseDto[]
-  > {
-    const communityStatistics = await this.communityStatisticsService.getAll();
-
-    const totalSupports =
-      await this.communityStatisticsService.getTotalSupports();
-
-    return communityStatistics.map((entity) =>
-      CommunityStatisticsMapper.toDto(entity, totalSupports),
-    );
-  }
+  > {}
 }
 

[NoCoverage] ArrowFunction
statistics-ms/src/platform-statistics/platform-statistics.controller.ts:43:36
     const totalSupports =
       await this.communityStatisticsService.getTotalSupports();
 
-    return communityStatistics.map((entity) =>
-      CommunityStatisticsMapper.toDto(entity, totalSupports),
+    return communityStatistics.map(() => undefined,
     );
   }
