[NoCoverage] BlockStatement
apps/statistics-ms/src/statistics-ms.event-listener.controller.ts:30:75
   ) {}
 
   @EventPattern(CommunityCreatedEvent.TOPIC)
-  async handleCommunityCreated(@Payload() message: CommunityCreatedEvent) {
-    this.logger.log(
-      `Community created event handled: ${JSON.stringify(message)}`,
-    );
-
-    // CommunityReports and PlatformStatistics logic
-    await Promise.all([
-      this.communityReportsService.registerCommunityCreation(
-        message.communityId,
-        message.name,
-        message.adminId,
-      ),
-      this.communityStatisticsService.registerComunityCreation(
-        message.communityId,
-        message.name,
-      ),
-    ]);
-  }
+  async handleCommunityCreated(@Payload() message: CommunityCreatedEvent) {}
 
   @EventPattern(UserJoinedCommunity.TOPIC)

[NoCoverage] ArrayDeclaration
apps/statistics-ms/src/statistics-ms.event-listener.controller.ts:36:23
     );
 
     // CommunityReports and PlatformStatistics logic
-    await Promise.all([
-      this.communityReportsService.registerCommunityCreation(
-        message.communityId,
-        message.name,
-        message.adminId,
-      ),
-      this.communityStatisticsService.registerComunityCreation(
-        message.communityId,
-        message.name,
-      ),
-    ]);
+    await Promise.all([]);
   }
 

[NoCoverage] BlockStatement
apps/statistics-ms/src/statistics-ms.event-listener.controller.ts:50:76
   }
 
   @EventPattern(UserJoinedCommunity.TOPIC)
-  async handleJoinCommunityMember(@Payload() message: UserJoinedCommunity) {
-    this.logger.log(
-      `User joined community event handled: ${JSON.stringify(message)}`,
-    );
-
-    // Only CommunityReports handles this logic
-    await this.communityReportsService.registerCommunityJoinMember(
-      message.communityId,
-    );
-  }
+  async handleJoinCommunityMember(@Payload() message: UserJoinedCommunity) {}
 
   @EventPattern(CauseCreatedEvent.TOPIC)

[NoCoverage] BlockStatement
apps/statistics-ms/src/statistics-ms.event-listener.controller.ts:62:67
   }
 
   @EventPattern(CauseCreatedEvent.TOPIC)
-  async handleCauseCreated(@Payload() message: CauseCreatedEvent) {
-    this.logger.log(`Cause created event handled: ${JSON.stringify(message)}`);
-
-    // CommunityReports and PlatformStatistics logic
-    await Promise.all([
-      this.communityReportsService.registerCauseCreation(
-        message.communityId,
-        message.causeId,
-        message.causeName,
-        new Set(message.ods),
-      ),
-      this.odsStatisticsService.registerCauseCreation(
-        new Set(message.ods),
-        message.communityId,
-      ),
-    ]);
-  }
+  async handleCauseCreated(@Payload() message: CauseCreatedEvent) {}
 
   @EventPattern(CauseSupportedEvent.TOPIC)

[NoCoverage] StringLiteral
apps/statistics-ms/src/statistics-ms.event-listener.controller.ts:63:21
 
   @EventPattern(CauseCreatedEvent.TOPIC)
   async handleCauseCreated(@Payload() message: CauseCreatedEvent) {
-    this.logger.log(`Cause created event handled: ${JSON.stringify(message)}`);
+    this.logger.log(``);
 
     // CommunityReports and PlatformStatistics logic

[NoCoverage] BlockStatement
apps/statistics-ms/src/statistics-ms.event-listener.controller.ts:81:74
   }
 
   @EventPattern(CauseSupportedEvent.TOPIC)
-  async handleCauseAddSupporter(@Payload() message: CauseSupportedEvent) {
-    this.logger.log(
-      `Cause add supporter event handled: ${JSON.stringify(message)}`,
-    );
-
-    // CommunityReports and PlatformStatistics logic
-    await Promise.all([
-      this.communityReportsService.registerCauseAddSupporter(
-        message.communityId,
-        message.causeId,
-      ),
-      this.communityStatisticsService.registerCauseSupport(message.communityId),
-      this.odsStatisticsService.registerCauseSupport(new Set(message.ods)),
-    ]);
-  }
+  async handleCauseAddSupporter(@Payload() message: CauseSupportedEvent) {}
 
   @EventPattern(ActionCreatedEvent.TOPIC)

[NoCoverage] StringLiteral
apps/statistics-ms/src/statistics-ms.event-listener.controller.ts:83:7
   @EventPattern(CauseSupportedEvent.TOPIC)
   async handleCauseAddSupporter(@Payload() message: CauseSupportedEvent) {
     this.logger.log(
-      `Cause add supporter event handled: ${JSON.stringify(message)}`,
+      ``,
     );
 

[NoCoverage] BlockStatement
apps/statistics-ms/src/statistics-ms.event-listener.controller.ts:98:69
   }
 
   @EventPattern(ActionCreatedEvent.TOPIC)
-  async handleActionCreated(@Payload() message: ActionCreatedEvent) {
-    this.logger.log(`Action created event handled: ${JSON.stringify(message)}`);
-
-    // CommunityReports and PlatformStatistics logic
-    await Promise.all([
-      this.communityReportsService.registerActionCreation(
-        message.causeId,
-        message.id,
-        message.title,
-        message.target,
-      ),
-      this.communityStatisticsService.registerCausesTargeted(
-        message.communityId,
-        message.target,
-      ),
-    ]);
-  }
+  async handleActionCreated(@Payload() message: ActionCreatedEvent) {}
 
   @EventPattern(ActionContributedEvent.TOPIC)

[NoCoverage] BlockStatement
apps/statistics-ms/src/statistics-ms.event-listener.controller.ts:117:77
   }
 
   @EventPattern(ActionContributedEvent.TOPIC)
-  async handleActionContributed(@Payload() message: ActionContributedEvent) {
-    this.logger.log(
-      `Action contributed event handled: ${JSON.stringify(message)}`,
-    );
-
-    // CommunityReports and PlatformStatistics logic
-    await Promise.all([
-      this.communityReportsService.registerActionContributed(
-        message.causeId,
-        message.actionId,
-        message.amount,
-      ),
-      this.communityStatisticsService.registerCausesAchieved(
-        message.communityId,
-        message.amount,
-      ),
-    ]);
-  }
+  async handleActionContributed(@Payload() message: ActionContributedEvent) {}
 }
 
