[NoCoverage] BlockStatement
src/history/application/history-events.controller.ts:19:75
   constructor(private readonly historyService: HistoryService) {}
 
   @EventPattern(CommunityCreatedEvent.TOPIC)
-  async handleCommunityCreated(@Payload() message: CommunityCreatedEvent) {
-    await this.historyService.registerCommunityCreation(
-      message.adminId,
-      message.communityId,
-      message.date,
-    );
-    this.logger.log(
-      `Community created event handled: Community ${message.communityId} created`,
-    );
-  }
+  async handleCommunityCreated(@Payload() message: CommunityCreatedEvent) {}
 
   @EventPattern(ActionContributedEvent.TOPIC)

[NoCoverage] BlockStatement
src/history/application/history-events.controller.ts:31:77
   }
 
   @EventPattern(ActionContributedEvent.TOPIC)
-  async handleActionContributed(@Payload() message: ActionContributedEvent) {
-    await this.historyService.registerActionContribute(
-      message.userId,
-      message.actionId,
-      message.date,
-    );
-    this.logger.log(
-      `Action contributed event handled: User ${message.userId} contributed to action ${message.actionId}`,
-    );
-  }
+  async handleActionContributed(@Payload() message: ActionContributedEvent) {}
 
   @EventPattern(JoinCommunityRequestCreatedEvent.TOPIC)

[NoCoverage] BlockStatement
src/history/application/history-events.controller.ts:45:5
   @EventPattern(JoinCommunityRequestCreatedEvent.TOPIC)
   async handleJoinCommunityRequestCreated(
     @Payload() message: JoinCommunityRequestCreatedEvent,
-  ) {
-    await this.historyService.registerJoinCommunityRequest(
-      message.userId,
-      message.communityId,
-      message.adminId,
-      message.date,
-    );
-    this.logger.log(
-      `Join community request created event handled: User ${message.userId} requested to join community ${message.communityId}`,
-    );
-  }
+  ) {}
 
   @EventPattern(JoinCommunityRequestRejectedEvent.TOPIC)

[NoCoverage] BlockStatement
src/history/application/history-events.controller.ts:60:5
   @EventPattern(JoinCommunityRequestRejectedEvent.TOPIC)
   async handleJoinCommunityRequestRejected(
     @Payload() message: JoinCommunityRequestRejectedEvent,
-  ) {
-    await this.historyService.registerJoinCommunityRequestRejected(
-      message.userId,
-      message.communityId,
-      message.date,
-    );
-    this.logger.log(
-      `Join community request rejected event handled: User ${message.userId} requested to join community ${message.communityId}`,
-    );
-  }
+  ) {}
 
   @EventPattern(UserJoinedCommunity.TOPIC)

[NoCoverage] BlockStatement
src/history/application/history-events.controller.ts:72:76
   }
 
   @EventPattern(UserJoinedCommunity.TOPIC)
-  async handleUserJoinedCommunity(@Payload() message: UserJoinedCommunity) {
-    await this.historyService.registerUserJoinedCommunity(
-      message.userId,
-      message.communityId,
-      message.date,
-    );
-    this.logger.log(
-      `User joined community event handled: User ${message.userId} joined community ${message.communityId}`,
-    );
-  }
+  async handleUserJoinedCommunity(@Payload() message: UserJoinedCommunity) {}
 
   @EventPattern(CauseCreatedEvent.TOPIC)

[NoCoverage] StringLiteral
src/history/application/history-events.controller.ts:79:7
       message.date,
     );
     this.logger.log(
-      `User joined community event handled: User ${message.userId} joined community ${message.communityId}`,
+      ``,
     );
   }

[NoCoverage] BlockStatement
src/history/application/history-events.controller.ts:84:67
   }
 
   @EventPattern(CauseCreatedEvent.TOPIC)
-  async handleCauseCreated(@Payload() message: CauseCreatedEvent) {
-    await this.historyService.registerCauseCreation(
-      message.userId,
-      message.causeId,
-      message.date,
-    );
-    this.logger.log(
-      `Cause created event handled: User ${message.userId} created cause ${message.causeId}`,
-    );
-  }
+  async handleCauseCreated(@Payload() message: CauseCreatedEvent) {}
 
   @EventPattern(CauseSupportedEvent.TOPIC)

[NoCoverage] StringLiteral
src/history/application/history-events.controller.ts:91:7
       message.date,
     );
     this.logger.log(
-      `Cause created event handled: User ${message.userId} created cause ${message.causeId}`,
+      ``,
     );
   }

[NoCoverage] BlockStatement
src/history/application/history-events.controller.ts:96:71
   }
 
   @EventPattern(CauseSupportedEvent.TOPIC)
-  async handleCauseSupported(@Payload() message: CauseSupportedEvent) {
-    await this.historyService.registerCauseSupported(
-      message.userId,
-      message.causeId,
-      message.date,
-    );
-    this.logger.log(
-      `Cause supported event handled: User ${message.userId} supported cause ${message.causeId}`,
-    );
-  }
+  async handleCauseSupported(@Payload() message: CauseSupportedEvent) {}
 }
 
