[NoCoverage] EqualityOperator
src/history/application/history.controller.ts:32:7
     @Res() res: Response,
   ) {
     if (
-      historyOwner !== userId &&
+      historyOwner === userId &&
       !(await this.historyService.userHasJoinCommunityRequestWithAdmin(
         historyOwner,

[NoCoverage] ConditionalExpression
src/history/application/history.controller.ts:32:7
     @Res() res: Response,
   ) {
     if (
-      historyOwner !== userId &&
-      !(await this.historyService.userHasJoinCommunityRequestWithAdmin(
-        historyOwner,
-        userId,
-      ))
+      false
     ) {
       throw new ForbiddenException(

[NoCoverage] BooleanLiteral
src/history/application/history.controller.ts:33:7
   ) {
     if (
       historyOwner !== userId &&
-      !(await this.historyService.userHasJoinCommunityRequestWithAdmin(
-        historyOwner,
-        userId,
-      ))
+      await this.historyService.userHasJoinCommunityRequestWithAdmin(historyOwner, userId)
     ) {
       throw new ForbiddenException(

[NoCoverage] BlockStatement
src/history/application/history.controller.ts:37:7
         historyOwner,
         userId,
       ))
-    ) {
-      throw new ForbiddenException(
-        `You are not allowed to see the history of user: ${historyOwner}`,
-      );
-    }
+    ) {}
 
     const { type, status, page, limit } = query;

[NoCoverage] StringLiteral
src/history/application/history.controller.ts:53:21
       limit,
     );
 
-    const baseUrl = `${req.protocol}://${req.get('host')}${req.path}`;
+    const baseUrl = ``;
 
     const response = new PaginatedResponseDto(
