[NoCoverage] BlockStatement
src/history/application/history.service.impl.ts:17:72
     private readonly eventPublisher: EventPublisher,
   ) {}
 
-  private async saveEntryAndNotify(entry: HistoryEntry): Promise<void> {
-    const savedEntry = await this.historyEntryRepository.save(entry);
-    this.eventPublisher.mergeObjectContext(savedEntry);
-    savedEntry.commit();
-  }
+  private async saveEntryAndNotify(entry: HistoryEntry): Promise<void> {}
 
   async getUserHistory(

[NoCoverage] BlockStatement
src/history/application/history.service.impl.ts:29:58
     status?: EntryStatus,
     page?: number,
     limit?: number,
-  ): Promise<{ entries: HistoryEntry[]; total: number }> {
-    const [entries, total] = await Promise.all([
-      this.historyEntryRepository.findByUserIdWithFilters(
-        userId,
-        type,
-        status,
-        page,
-        limit,
-      ),
-      this.historyEntryRepository.countByUserIdWithFilters(
-        userId,
-        type,
-        status,
-      ),
-    ]);
-
-    return { entries, total };
-  }
+  ): Promise<{ entries: HistoryEntry[]; total: number }> {}
 
   async registerUserFollowed(

[NoCoverage] BlockStatement
src/history/application/history.service.impl.ts:53:20
     followedUserId: string,
     timestamp: Date,
     followedUserName?: string,
-  ): Promise<void> {
-    const entry = HistoryEntry.create({
-      userId: new UniqueEntityID(userId),
-      type: ActivityType.USER_FOLLOWED,
-      entityId: new UniqueEntityID(followedUserId),
-      timestamp,
-      metadata: followedUserName ? { entityName: followedUserName } : undefined,
-    });
-
-    await this.historyEntryRepository.save(entry);
-  }
+  ): Promise<void> {}
 
   async registerCommunityCreation(

[NoCoverage] BlockStatement
src/history/application/history.service.impl.ts:69:20
     adminId: string,
     communityId: string,
     timestamp: Date,
-  ): Promise<void> {
-    const entry = HistoryEntry.create({
-      userId: new UniqueEntityID(adminId),
-      type: ActivityType.COMMUNITY_ADMIN,
-      entityId: new UniqueEntityID(communityId),
-      timestamp,
-    });
-
-    await this.saveEntryAndNotify(entry);
-  }
+  ): Promise<void> {}
 
   async registerActionContribute(

[NoCoverage] BlockStatement
src/history/application/history.service.impl.ts:84:20
     userId: string,
     actionId: string,
     timestamp: Date,
-  ): Promise<void> {
-    const entry = HistoryEntry.create({
-      userId: new UniqueEntityID(userId),
-      type: ActivityType.ACTION_CONTRIBUTED,
-      entityId: new UniqueEntityID(actionId),
-      timestamp,
-    });
-
-    await this.saveEntryAndNotify(entry);
-  }
+  ): Promise<void> {}
 
   async registerJoinCommunityRequest(

[NoCoverage] BlockStatement
src/history/application/history.service.impl.ts:100:20
     communityId: string,
     communityAdminId: string,
     timestamp: Date,
-  ): Promise<void> {
-    const entry = HistoryEntry.create({
-      userId: new UniqueEntityID(userId),
-      type: ActivityType.JOIN_COMMUNITY_REQUEST_SENT,
-      entityId: new UniqueEntityID(communityId),
-      status: EntryStatus.PENDING,
-      metadata: { adminId: communityAdminId },
-      timestamp,
-    });
-
-    await this.historyEntryRepository.save(entry);
-  }
+  ): Promise<void> {}
 
   private async archiveJoinCommunityPendingRequest(

[NoCoverage] ObjectLiteral
src/history/application/history.service.impl.ts:106:17
       type: ActivityType.JOIN_COMMUNITY_REQUEST_SENT,
       entityId: new UniqueEntityID(communityId),
       status: EntryStatus.PENDING,
-      metadata: { adminId: communityAdminId },
+      metadata: {},
       timestamp,
     });

[NoCoverage] BlockStatement
src/history/application/history.service.impl.ts:116:20
   private async archiveJoinCommunityPendingRequest(
     userId: string,
     communityId: string,
-  ): Promise<void> {
-    const pendingEntry =
-      await this.historyEntryRepository.findByUserIdEntityIdTypeAndStatus(
-        userId,
-        communityId,
-        ActivityType.JOIN_COMMUNITY_REQUEST_SENT,
-        EntryStatus.PENDING,
-      );
-
-    pendingEntry.status = EntryStatus.ARCHIVED;
-    await this.historyEntryRepository.save(pendingEntry);
-  }
+  ): Promise<void> {}
 
   async registerJoinCommunityRequestRejected(

[NoCoverage] BlockStatement
src/history/application/history.service.impl.ts:133:20
     userId: string,
     communityId: string,
     timestamp: Date,
-  ): Promise<void> {
-    await this.archiveJoinCommunityPendingRequest(userId, communityId);
-
-    const entry = HistoryEntry.create({
-      userId: new UniqueEntityID(userId),
-      type: ActivityType.JOIN_COMMUNITY_REQUEST_REJECTED,
-      entityId: new UniqueEntityID(communityId),
-      status: EntryStatus.REJECTED,
-      timestamp,
-    });
-
-    await this.historyEntryRepository.save(entry);
-  }
+  ): Promise<void> {}
 
   async registerUserJoinedCommunity(

[NoCoverage] BlockStatement
src/history/application/history.service.impl.ts:151:20
     userId: string,
     communityId: string,
     timestamp: Date,
-  ): Promise<void> {
-    await this.archiveJoinCommunityPendingRequest(userId, communityId);
-
-    const entry = HistoryEntry.create({
-      userId: new UniqueEntityID(userId),
-      type: ActivityType.JOINED_COMMUNITY,
-      entityId: new UniqueEntityID(communityId),
-      timestamp,
-    });
-
-    await this.saveEntryAndNotify(entry);
-  }
+  ): Promise<void> {}
 
   async registerCauseCreation(

[NoCoverage] ObjectLiteral
src/history/application/history.service.impl.ts:154:39
   ): Promise<void> {
     await this.archiveJoinCommunityPendingRequest(userId, communityId);
 
-    const entry = HistoryEntry.create({
-      userId: new UniqueEntityID(userId),
-      type: ActivityType.JOINED_COMMUNITY,
-      entityId: new UniqueEntityID(communityId),
-      timestamp,
-    });
+    const entry = HistoryEntry.create({});
 
     await this.saveEntryAndNotify(entry);

[NoCoverage] BlockStatement
src/history/application/history.service.impl.ts:168:20
     userId: string,
     causeId: string,
     timestamp: Date,
-  ): Promise<void> {
-    const entry = HistoryEntry.create({
-      userId: new UniqueEntityID(userId),
-      type: ActivityType.CAUSE_CREATED,
-      entityId: new UniqueEntityID(causeId),
-      timestamp,
-    });
-
-    await this.saveEntryAndNotify(entry);
-  }
+  ): Promise<void> {}
 
   async registerCauseSupported(

[NoCoverage] BlockStatement
src/history/application/history.service.impl.ts:183:20
     userId: string,
     causeId: string,
     timestamp: Date,
-  ): Promise<void> {
-    const entry = HistoryEntry.create({
-      userId: new UniqueEntityID(userId),
-      type: ActivityType.CAUSE_SUPPORTED,
-      entityId: new UniqueEntityID(causeId),
-      timestamp,
-    });
-
-    await this.saveEntryAndNotify(entry);
-  }
+  ): Promise<void> {}
 
   async userHasJoinCommunityRequestWithAdmin(

[NoCoverage] BlockStatement
src/history/application/history.service.impl.ts:197:23
   async userHasJoinCommunityRequestWithAdmin(
     userId: string,
     adminId: string,
-  ): Promise<boolean> {
-    return this.historyEntryRepository.existsUserJoinCommunityRequestWithAdmin(
-      userId,
-      ActivityType.JOIN_COMMUNITY_REQUEST_SENT,
-      adminId,
-    );
-  }
+  ): Promise<boolean> {}
 }
 
