[NoCoverage] BlockStatement
src/history/domain/HistoryEntry.ts:26:28
 }
 
 export class HistoryEntry extends EntityRoot<HistoryEntryProps> {
-  get id(): UniqueEntityID {
-    return this._id;
-  }
+  get id(): UniqueEntityID {}
 
   get userId(): UniqueEntityID {

[NoCoverage] BlockStatement
src/history/domain/HistoryEntry.ts:30:32
     return this._id;
   }
 
-  get userId(): UniqueEntityID {
-    return this.props.userId;
-  }
+  get userId(): UniqueEntityID {}
 
   get type(): ActivityType {

[NoCoverage] BlockStatement
src/history/domain/HistoryEntry.ts:34:28
     return this.props.userId;
   }
 
-  get type(): ActivityType {
-    return this.props.type;
-  }
+  get type(): ActivityType {}
 
   get entityId(): UniqueEntityID {

[NoCoverage] BlockStatement
src/history/domain/HistoryEntry.ts:38:34
     return this.props.type;
   }
 
-  get entityId(): UniqueEntityID {
-    return this.props.entityId;
-  }
+  get entityId(): UniqueEntityID {}
 
   get timestamp(): Date {

[NoCoverage] BlockStatement
src/history/domain/HistoryEntry.ts:42:25
     return this.props.entityId;
   }
 
-  get timestamp(): Date {
-    return this.props.timestamp;
-  }
+  get timestamp(): Date {}
 
   get status(): EntryStatus | undefined {

[NoCoverage] BlockStatement
src/history/domain/HistoryEntry.ts:46:41
     return this.props.timestamp;
   }
 
-  get status(): EntryStatus | undefined {
-    return this.props.status;
-  }
+  get status(): EntryStatus | undefined {}
 
   set status(status: EntryStatus) {

[NoCoverage] BlockStatement
src/history/domain/HistoryEntry.ts:50:35
     return this.props.status;
   }
 
-  set status(status: EntryStatus) {
-    this.props.status = status;
-  }
+  set status(status: EntryStatus) {}
 
   get metadata(): HistoryEntryProps['metadata'] {

[NoCoverage] BlockStatement
src/history/domain/HistoryEntry.ts:54:49
     this.props.status = status;
   }
 
-  get metadata(): HistoryEntryProps['metadata'] {
-    return this.props.metadata;
-  }
+  get metadata(): HistoryEntryProps['metadata'] {}
 
   public static create(

[NoCoverage] BlockStatement
src/history/domain/HistoryEntry.ts:61:19
   public static create(
     props: HistoryEntryProps,
     id?: UniqueEntityID,
-  ): HistoryEntry {
-    this.validateProps(props);
-    const historyEntry = new HistoryEntry(
-      {
-        ...props,
-        timestamp: props.timestamp ?? new Date(),
-      },
-      id,
-    );
-    historyEntry.apply(
-      new HistoryRegisteredEvent(
-        historyEntry.id.toString(),
-        historyEntry.userId.toString(),
-        historyEntry.type,
-        historyEntry.entityId.toString(),
-      ),
-    );
-    return historyEntry;
-  }
+  ): HistoryEntry {}
 
   private static validateProps(props: HistoryEntryProps): void {

[NoCoverage] LogicalOperator
src/history/domain/HistoryEntry.ts:66:20
     const historyEntry = new HistoryEntry(
       {
         ...props,
-        timestamp: props.timestamp ?? new Date(),
+        timestamp: props.timestamp && new Date(),
       },
       id,

[NoCoverage] BlockStatement
src/history/domain/HistoryEntry.ts:81:64
     return historyEntry;
   }
 
-  private static validateProps(props: HistoryEntryProps): void {
-    if (!props.type || !props.entityId || !props.userId) {
-      throw new MissingPropertiesError(
-        'Missing required properties for HistoryEntry',
-      );
-    }
-  }
+  private static validateProps(props: HistoryEntryProps): void {}
 }
 

[NoCoverage] ConditionalExpression
src/history/domain/HistoryEntry.ts:82:9
   }
 
   private static validateProps(props: HistoryEntryProps): void {
-    if (!props.type || !props.entityId || !props.userId) {
+    if (false) {
       throw new MissingPropertiesError(
         'Missing required properties for HistoryEntry',

[NoCoverage] ConditionalExpression
src/history/domain/HistoryEntry.ts:82:9
   }
 
   private static validateProps(props: HistoryEntryProps): void {
-    if (!props.type || !props.entityId || !props.userId) {
+    if (false || !props.userId) {
       throw new MissingPropertiesError(
         'Missing required properties for HistoryEntry',

[NoCoverage] StringLiteral
src/history/domain/HistoryEntry.ts:84:9
   private static validateProps(props: HistoryEntryProps): void {
     if (!props.type || !props.entityId || !props.userId) {
       throw new MissingPropertiesError(
-        'Missing required properties for HistoryEntry',
+        "",
       );
     }
