[NoCoverage] BlockStatement
history/domain/events/user-followed.handler.ts:12:42
 
   constructor(private readonly historyService: HistoryService) {}
 
-  async handle(event: UserFollowedEvent) {
-    await this.historyService.registerUserFollowed(
-      event.userId,
-      event.followedUserId,
-      event.date,
-      event.userName,
-    );
-
-    this.logger.log(
-      `Internal user followed event handled: User with id: ${event.userId} followed user with id: ${event.followedUserId}`,
-    );
-  }
+  async handle(event: UserFollowedEvent) {}
 }
 
