[NoCoverage] BlockStatement
src/history/infra/history-entry.repository.typeorm.ts:22:71
     super();
   }
 
-  async save(entity: DomainHistoryEntry): Promise<DomainHistoryEntry> {
-    const persistenceEntity = await this.historyEntryRepository.save(
-      HistoryEntryMapper.toPersistence(entity),
-    );
-    return HistoryEntryMapper.toDomain(persistenceEntity);
-  }
+  async save(entity: DomainHistoryEntry): Promise<DomainHistoryEntry> {}
 
   async findById(id: string): Promise<DomainHistoryEntry> {

[NoCoverage] BlockStatement
src/history/infra/history-entry.repository.typeorm.ts:29:59
     return HistoryEntryMapper.toDomain(persistenceEntity);
   }
 
-  async findById(id: string): Promise<DomainHistoryEntry> {
-    const entry = await this.historyEntryRepository.findOneBy({ id });
-    if (!entry) {
-      throw new EntityNotFoundError(`HistoryEntry with id ${id} not found`);
-    }
-    return HistoryEntryMapper.toDomain(entry);
-  }
+  async findById(id: string): Promise<DomainHistoryEntry> {}
 
   async findByUserIdEntityIdTypeAndStatus(

[NoCoverage] ConditionalExpression
src/history/infra/history-entry.repository.typeorm.ts:31:9
 
   async findById(id: string): Promise<DomainHistoryEntry> {
     const entry = await this.historyEntryRepository.findOneBy({ id });
-    if (!entry) {
+    if (true) {
       throw new EntityNotFoundError(`HistoryEntry with id ${id} not found`);
     }

[NoCoverage] BooleanLiteral
src/history/infra/history-entry.repository.typeorm.ts:31:9
 
   async findById(id: string): Promise<DomainHistoryEntry> {
     const entry = await this.historyEntryRepository.findOneBy({ id });
-    if (!entry) {
+    if (entry) {
       throw new EntityNotFoundError(`HistoryEntry with id ${id} not found`);
     }

[NoCoverage] BlockStatement
src/history/infra/history-entry.repository.typeorm.ts:42:34
     entityId: string,
     type: ActivityType,
     status: EntryStatus,
-  ): Promise<DomainHistoryEntry> {
-    const entry = await this.historyEntryRepository.findOne({
-      where: {
-        userId,
-        entityId,
-        type,
-        status,
-      },
-    });
-
-    if (!entry) {
-      throw new EntityNotFoundError(
-        `HistoryEntry with userId ${userId}, entityId ${entityId}, type ${type} and status ${status} not found`,
-      );
-    }
-    return HistoryEntryMapper.toDomain(entry);
-  }
+  ): Promise<DomainHistoryEntry> {}
 
   async findByUserIdWithFilters(

[NoCoverage] BlockStatement
src/history/infra/history-entry.repository.typeorm.ts:52:17
       },
     });
 
-    if (!entry) {
-      throw new EntityNotFoundError(
-        `HistoryEntry with userId ${userId}, entityId ${entityId}, type ${type} and status ${status} not found`,
-      );
-    }
+    if (!entry) {}
     return HistoryEntryMapper.toDomain(entry);
   }

[NoCoverage] BooleanLiteral
src/history/infra/history-entry.repository.typeorm.ts:52:9
       },
     });
 
-    if (!entry) {
+    if (entry) {
       throw new EntityNotFoundError(
         `HistoryEntry with userId ${userId}, entityId ${entityId}, type ${type} and status ${status} not found`,

[NoCoverage] BlockStatement
src/history/infra/history-entry.repository.typeorm.ts:66:36
     status?: EntryStatus,
     page: number = PaginationDefaults.DEFAULT_PAGE,
     limit: number = PaginationDefaults.DEFAULT_LIMIT,
-  ): Promise<DomainHistoryEntry[]> {
-    const query = this.historyEntryRepository
-      .createQueryBuilder('history_entry')
-      .where('history_entry.userId = :userId', { userId });
-
-    if (type) {
-      query.andWhere('history_entry.type = :type', { type });
-    }
-
-    if (status) {
-      query.andWhere('history_entry.status = :status', { status });
-    }
-
-    const entries = await query
-      .orderBy('history_entry.timestamp', 'DESC')
-      .skip((page - 1) * limit)
-      .take(limit)
-      .getMany();
-
-    return entries.map(HistoryEntryMapper.toDomain);
-  }
+  ): Promise<DomainHistoryEntry[]> {}
 
   async countByUserIdWithFilters(

[NoCoverage] ObjectLiteral
src/history/infra/history-entry.repository.typeorm.ts:72:52
       .where('history_entry.userId = :userId', { userId });
 
     if (type) {
-      query.andWhere('history_entry.type = :type', { type });
+      query.andWhere('history_entry.type = :type', {});
     }
 

[NoCoverage] StringLiteral
src/history/infra/history-entry.repository.typeorm.ts:76:22
     }
 
     if (status) {
-      query.andWhere('history_entry.status = :status', { status });
+      query.andWhere("", { status });
     }
 

[NoCoverage] ArithmeticOperator
src/history/infra/history-entry.repository.typeorm.ts:81:13
 
     const entries = await query
       .orderBy('history_entry.timestamp', 'DESC')
-      .skip((page - 1) * limit)
+      .skip((page - 1) / limit)
       .take(limit)
       .getMany();

[NoCoverage] ArithmeticOperator
src/history/infra/history-entry.repository.typeorm.ts:81:14
 
     const entries = await query
       .orderBy('history_entry.timestamp', 'DESC')
-      .skip((page - 1) * limit)
+      .skip((page + 1) * limit)
       .take(limit)
       .getMany();

[NoCoverage] BlockStatement
src/history/infra/history-entry.repository.typeorm.ts:92:22
     userId: string,
     type?: ActivityType,
     status?: EntryStatus,
-  ): Promise<number> {
-    const query = this.historyEntryRepository
-      .createQueryBuilder('history_entry')
-      .where('history_entry.userId = :userId', { userId });
-
-    if (type) {
-      query.andWhere('history_entry.type = :type', { type });
-    }
-
-    if (status) {
-      query.andWhere('history_entry.status = :status', { status });
-    }
-
-    return query.getCount();
-  }
+  ): Promise<number> {}
 
   async existsUserJoinCommunityRequestWithAdmin(

[NoCoverage] StringLiteral
src/history/infra/history-entry.repository.typeorm.ts:94:27
     status?: EntryStatus,
   ): Promise<number> {
     const query = this.historyEntryRepository
-      .createQueryBuilder('history_entry')
+      .createQueryBuilder("")
       .where('history_entry.userId = :userId', { userId });
 

[NoCoverage] StringLiteral
src/history/infra/history-entry.repository.typeorm.ts:95:14
   ): Promise<number> {
     const query = this.historyEntryRepository
       .createQueryBuilder('history_entry')
-      .where('history_entry.userId = :userId', { userId });
+      .where("", { userId });
 
     if (type) {

[NoCoverage] ObjectLiteral
src/history/infra/history-entry.repository.typeorm.ts:102:56
     }
 
     if (status) {
-      query.andWhere('history_entry.status = :status', { status });
+      query.andWhere('history_entry.status = :status', {});
     }
 

[NoCoverage] BlockStatement
src/history/infra/history-entry.repository.typeorm.ts:112:23
     userId: string,
     JOIN_COMMUNITY_REQUEST_SENT: ActivityType,
     adminId: string,
-  ): Promise<boolean> {
-    const entry = await this.historyEntryRepository.findOne({
-      where: {
-        userId,
-        type: JOIN_COMMUNITY_REQUEST_SENT,
-        metadata: { adminId },
-      },
-    });
-
-    return !!entry;
-  }
+  ): Promise<boolean> {}
 }
 

[NoCoverage] ObjectLiteral
src/history/infra/history-entry.repository.typeorm.ts:113:61
     JOIN_COMMUNITY_REQUEST_SENT: ActivityType,
     adminId: string,
   ): Promise<boolean> {
-    const entry = await this.historyEntryRepository.findOne({
-      where: {
-        userId,
-        type: JOIN_COMMUNITY_REQUEST_SENT,
-        metadata: { adminId },
-      },
-    });
+    const entry = await this.historyEntryRepository.findOne({});
 
     return !!entry;

[NoCoverage] ObjectLiteral
src/history/infra/history-entry.repository.typeorm.ts:117:19
       where: {
         userId,
         type: JOIN_COMMUNITY_REQUEST_SENT,
-        metadata: { adminId },
+        metadata: {},
       },
     });

[NoCoverage] BooleanLiteral
src/history/infra/history-entry.repository.typeorm.ts:121:12
       },
     });
 
-    return !!entry;
+    return !entry;
   }
 }
