[NoCoverage] BlockStatement
src/notifications/application/notification.controller.ts:31:5
     @GetUserId() requestingUserId: string,
     @Req() req: Request,
     @Res() res: Response,
-  ) {
-    if (requestingUserId !== userId) {
-      throw new ForbiddenException(
-        'You do not have permission to view this user notifications',
-      );
-    }
-
-    const { page, limit } = query;
-
-    const { notifications, total } =
-      await this.notificationService.getUserNotifications(userId, page, limit);
-
-    const baseUrl = `${req.protocol}://${req.get('host')}${req.path}`;
-
-    const response = new PaginatedResponseDto(
-      notifications.map(NotificationMapper.toDto),
-      total,
-      page,
-      limit,
-      baseUrl,
-    );
-
-    res.status(HttpStatus.OK).json(response);
-  }
+  ) {}
 
   @Patch(':notificationId')

[NoCoverage] EqualityOperator
src/notifications/application/notification.controller.ts:32:9
     @Req() req: Request,
     @Res() res: Response,
   ) {
-    if (requestingUserId !== userId) {
+    if (requestingUserId === userId) {
       throw new ForbiddenException(
         'You do not have permission to view this user notifications',

[NoCoverage] ConditionalExpression
src/notifications/application/notification.controller.ts:32:9
     @Req() req: Request,
     @Res() res: Response,
   ) {
-    if (requestingUserId !== userId) {
+    if (true) {
       throw new ForbiddenException(
         'You do not have permission to view this user notifications',

[NoCoverage] StringLiteral
src/notifications/application/notification.controller.ts:43:50
     const { notifications, total } =
       await this.notificationService.getUserNotifications(userId, page, limit);
 
-    const baseUrl = `${req.protocol}://${req.get('host')}${req.path}`;
+    const baseUrl = `${req.protocol}://${req.get("")}${req.path}`;
 
     const response = new PaginatedResponseDto(

[NoCoverage] BlockStatement
src/notifications/application/notification.controller.ts:61:5
     @Param('userId', ParseUUIDPipe) userId: string,
     @Param('notificationId', ParseUUIDPipe) notificationId: string,
     @Res() res: Response,
-  ) {
-    await this.notificationService.markAsRead(userId, notificationId);
-    res.status(HttpStatus.NO_CONTENT).send();
-  }
+  ) {}
 }
 
