[NoCoverage] BlockStatement
src/notifications/application/notification.service.impl.ts:20:64
     userId: string,
     page?: number,
     limit?: number,
-  ): Promise<{ notifications: Notification[]; total: number }> {
-    const [notifications, total] = await Promise.all([
-      this.notificationRepository.findByUserId(userId, page, limit),
-      this.notificationRepository.countByUserId(userId),
-    ]);
-
-    return { notifications, total };
-  }
+  ): Promise<{ notifications: Notification[]; total: number }> {}
 
   async markAsRead(userId: string, notificationId: string): Promise<void> {

[NoCoverage] ArrayDeclaration
src/notifications/application/notification.service.impl.ts:21:54
     page?: number,
     limit?: number,
   ): Promise<{ notifications: Notification[]; total: number }> {
-    const [notifications, total] = await Promise.all([
-      this.notificationRepository.findByUserId(userId, page, limit),
-      this.notificationRepository.countByUserId(userId),
-    ]);
+    const [notifications, total] = await Promise.all([]);
 
     return { notifications, total };

[NoCoverage] BlockStatement
src/notifications/application/notification.service.impl.ts:29:75
     return { notifications, total };
   }
 
-  async markAsRead(userId: string, notificationId: string): Promise<void> {
-    await this.notificationRepository.markAsRead(userId, notificationId);
-  }
+  async markAsRead(userId: string, notificationId: string): Promise<void> {}
 
   async createNotificationsForFollowers(

[NoCoverage] BlockStatement
src/notifications/application/notification.service.impl.ts:39:20
     activityType: ActivityType,
     entityId: string,
     timestamp: Date,
-  ): Promise<void> {
-    const followers = await this.userService.getUserFollowers(userId);
-
-    const notifications = followers.map((follower) =>
-      Notification.create({
-        historyEntryId: new UniqueEntityID(historyEntryId),
-        userId: follower.id,
-        activityType,
-        entityId: new UniqueEntityID(entityId),
-        read: false,
-        timestamp,
-      }),
-    );
-
-    if (notifications.length > 0) {
-      await this.notificationRepository.createMany(notifications);
-    }
-  }
+  ): Promise<void> {}
 }
 

[NoCoverage] ArrowFunction
src/notifications/application/notification.service.impl.ts:42:41
   ): Promise<void> {
     const followers = await this.userService.getUserFollowers(userId);
 
-    const notifications = followers.map((follower) =>
-      Notification.create({
-        historyEntryId: new UniqueEntityID(historyEntryId),
-        userId: follower.id,
-        activityType,
-        entityId: new UniqueEntityID(entityId),
-        read: false,
-        timestamp,
-      }),
+    const notifications = followers.map(() => undefined,
     );
 

[NoCoverage] BooleanLiteral
src/notifications/application/notification.service.impl.ts:48:15
         userId: follower.id,
         activityType,
         entityId: new UniqueEntityID(entityId),
-        read: false,
+        read: true,
         timestamp,
       }),

[NoCoverage] ConditionalExpression
src/notifications/application/notification.service.impl.ts:53:9
       }),
     );
 
-    if (notifications.length > 0) {
+    if (false) {
       await this.notificationRepository.createMany(notifications);
     }

[NoCoverage] ConditionalExpression
src/notifications/application/notification.service.impl.ts:53:9
       }),
     );
 
-    if (notifications.length > 0) {
+    if (true) {
       await this.notificationRepository.createMany(notifications);
     }
