[NoCoverage] BlockStatement
src/notifications/domain/Notification.ts:16:28
 }
 
 export class Notification extends Entity<NotificationProps> {
-  get id(): UniqueEntityID {
-    return this._id;
-  }
+  get id(): UniqueEntityID {}
 
   get userId(): UniqueEntityID {

[NoCoverage] BlockStatement
src/notifications/domain/Notification.ts:24:40
     return this.props.userId;
   }
 
-  get historyEntryId(): UniqueEntityID {
-    return this.props.historyEntryId;
-  }
+  get historyEntryId(): UniqueEntityID {}
 
   get activityType(): ActivityType {

[NoCoverage] BlockStatement
src/notifications/domain/Notification.ts:28:36
     return this.props.historyEntryId;
   }
 
-  get activityType(): ActivityType {
-    return this.props.activityType;
-  }
+  get activityType(): ActivityType {}
 
   get entityId(): UniqueEntityID {

[NoCoverage] BlockStatement
src/notifications/domain/Notification.ts:36:23
     return this.props.entityId;
   }
 
-  get read(): boolean {
-    return this.props.read;
-  }
+  get read(): boolean {}
 
   get timestamp(): Date {

[NoCoverage] BlockStatement
src/notifications/domain/Notification.ts:44:22
     return this.props.timestamp;
   }
 
-  markAsRead(): void {
-    if (!this.props.read) {
-      this.props.read = true;
-    }
-  }
+  markAsRead(): void {}
 
   public static create(

[NoCoverage] BooleanLiteral
src/notifications/domain/Notification.ts:45:9
   }
 
   markAsRead(): void {
-    if (!this.props.read) {
+    if (this.props.read) {
       this.props.read = true;
     }

[NoCoverage] ConditionalExpression
src/notifications/domain/Notification.ts:45:9
   }
 
   markAsRead(): void {
-    if (!this.props.read) {
+    if (true) {
       this.props.read = true;
     }

[NoCoverage] BooleanLiteral
src/notifications/domain/Notification.ts:46:25
 
   markAsRead(): void {
     if (!this.props.read) {
-      this.props.read = true;
+      this.props.read = false;
     }
   }

[NoCoverage] BlockStatement
src/notifications/domain/Notification.ts:53:19
   public static create(
     props: NotificationProps,
     id?: UniqueEntityID,
-  ): Notification {
-    this.validateProps(props);
-
-    const notification = new Notification(
-      {
-        ...props,
-        read: props.read ?? false,
-        timestamp: props.timestamp ?? new Date(),
-      },
-      id,
-    );
-
-    return notification;
-  }
+  ): Notification {}
 
   private static validateProps(props: NotificationProps): void {

[NoCoverage] LogicalOperator
src/notifications/domain/Notification.ts:59:15
     const notification = new Notification(
       {
         ...props,
-        read: props.read ?? false,
+        read: props.read && false,
         timestamp: props.timestamp ?? new Date(),
       },

[NoCoverage] BooleanLiteral
src/notifications/domain/Notification.ts:59:29
     const notification = new Notification(
       {
         ...props,
-        read: props.read ?? false,
+        read: props.read ?? true,
         timestamp: props.timestamp ?? new Date(),
       },

[NoCoverage] LogicalOperator
src/notifications/domain/Notification.ts:60:20
       {
         ...props,
         read: props.read ?? false,
-        timestamp: props.timestamp ?? new Date(),
+        timestamp: props.timestamp && new Date(),
       },
       id,

[NoCoverage] BlockStatement
src/notifications/domain/Notification.ts:68:64
     return notification;
   }
 
-  private static validateProps(props: NotificationProps): void {
-    if (!props.userId || !props.historyEntryId) {
-      throw new MissingPropertiesError(
-        'Missing required properties for Notification',
-      );
-    }
-  }
+  private static validateProps(props: NotificationProps): void {}
 }
 

[NoCoverage] BlockStatement
src/notifications/domain/Notification.ts:69:49
   }
 
   private static validateProps(props: NotificationProps): void {
-    if (!props.userId || !props.historyEntryId) {
-      throw new MissingPropertiesError(
-        'Missing required properties for Notification',
-      );
-    }
+    if (!props.userId || !props.historyEntryId) {}
   }
 }

[NoCoverage] BooleanLiteral
src/notifications/domain/Notification.ts:69:9
   }
 
   private static validateProps(props: NotificationProps): void {
-    if (!props.userId || !props.historyEntryId) {
+    if (props.userId || !props.historyEntryId) {
       throw new MissingPropertiesError(
         'Missing required properties for Notification',

[NoCoverage] StringLiteral
src/notifications/domain/Notification.ts:71:9
   private static validateProps(props: NotificationProps): void {
     if (!props.userId || !props.historyEntryId) {
       throw new MissingPropertiesError(
-        'Missing required properties for Notification',
+        "",
       );
     }
