[NoCoverage] BlockStatement
notifications/domain/events/history-registered.handler.ts:14:41
 
   private readonly logger = new Logger(HistoryRegisteredHandler.name);
 
-  handle(event: HistoryRegisteredEvent) {
-    this.logger.log(`Internal event captured: ${event.constructor.name}`);
-    this.notificationService.createNotificationsForFollowers(
-      event.historyEntryId,
-      event.userId,
-      event.activityType,
-      event.entityId,
-      event.date,
-    );
-    this.logger.log(
-      `Created notifications for followers of user ${event.userId} for activity type ${event.activityType}`,
-    );
-  }
+  handle(event: HistoryRegisteredEvent) {}
 }
 
