[NoCoverage] BlockStatement
src/notifications/infra/notification.repository.typeorm.ts:20:71
     super();
   }
 
-  async save(entity: DomainNotification): Promise<DomainNotification> {
-    const persistenceEntity = await this.notificationRepository.save(
-      NotificationMapper.toPersistence(entity),
-    );
-    return NotificationMapper.toDomain(persistenceEntity);
-  }
+  async save(entity: DomainNotification): Promise<DomainNotification> {}
 
   async findById(id: string): Promise<DomainNotification> {

[NoCoverage] BlockStatement
src/notifications/infra/notification.repository.typeorm.ts:27:59
     return NotificationMapper.toDomain(persistenceEntity);
   }
 
-  async findById(id: string): Promise<DomainNotification> {
-    const notification = await this.notificationRepository.findOneBy({ id });
-    if (!notification) {
-      throw new EntityNotFoundError(`Notification with id ${id} not found`);
-    }
-    return NotificationMapper.toDomain(notification);
-  }
+  async findById(id: string): Promise<DomainNotification> {}
 
   async findByUserId(

[NoCoverage] ObjectLiteral
src/notifications/infra/notification.repository.typeorm.ts:28:70
   }
 
   async findById(id: string): Promise<DomainNotification> {
-    const notification = await this.notificationRepository.findOneBy({ id });
+    const notification = await this.notificationRepository.findOneBy({});
     if (!notification) {
       throw new EntityNotFoundError(`Notification with id ${id} not found`);

[NoCoverage] ConditionalExpression
src/notifications/infra/notification.repository.typeorm.ts:29:9
 
   async findById(id: string): Promise<DomainNotification> {
     const notification = await this.notificationRepository.findOneBy({ id });
-    if (!notification) {
+    if (true) {
       throw new EntityNotFoundError(`Notification with id ${id} not found`);
     }

[NoCoverage] ConditionalExpression
src/notifications/infra/notification.repository.typeorm.ts:29:9
 
   async findById(id: string): Promise<DomainNotification> {
     const notification = await this.notificationRepository.findOneBy({ id });
-    if (!notification) {
+    if (false) {
       throw new EntityNotFoundError(`Notification with id ${id} not found`);
     }

[NoCoverage] BlockStatement
src/notifications/infra/notification.repository.typeorm.ts:39:36
     userId: string,
     page: number = PaginationDefaults.DEFAULT_PAGE,
     limit: number = PaginationDefaults.DEFAULT_LIMIT,
-  ): Promise<DomainNotification[]> {
-    const notifications = await this.notificationRepository.find({
-      where: { userId },
-      skip: (page - 1) * limit,
-      take: limit,
-      order: { timestamp: 'DESC' },
-    });
-    return notifications.map(NotificationMapper.toDomain);
-  }
+  ): Promise<DomainNotification[]> {}
 
   async countByUserId(userId: string): Promise<number> {

[NoCoverage] ArithmeticOperator
src/notifications/infra/notification.repository.typeorm.ts:42:14
   ): Promise<DomainNotification[]> {
     const notifications = await this.notificationRepository.find({
       where: { userId },
-      skip: (page - 1) * limit,
+      skip: (page + 1) * limit,
       take: limit,
       order: { timestamp: 'DESC' },

[NoCoverage] ArithmeticOperator
src/notifications/infra/notification.repository.typeorm.ts:42:13
   ): Promise<DomainNotification[]> {
     const notifications = await this.notificationRepository.find({
       where: { userId },
-      skip: (page - 1) * limit,
+      skip: (page - 1) / limit,
       take: limit,
       order: { timestamp: 'DESC' },

[NoCoverage] ObjectLiteral
src/notifications/infra/notification.repository.typeorm.ts:44:14
       where: { userId },
       skip: (page - 1) * limit,
       take: limit,
-      order: { timestamp: 'DESC' },
+      order: {},
     });
     return notifications.map(NotificationMapper.toDomain);

[NoCoverage] BlockStatement
src/notifications/infra/notification.repository.typeorm.ts:49:56
     return notifications.map(NotificationMapper.toDomain);
   }
 
-  async countByUserId(userId: string): Promise<number> {
-    return this.notificationRepository.count({
-      where: { userId },
-    });
-  }
+  async countByUserId(userId: string): Promise<number> {}
 
   async markAsRead(userId: string, notificationId: string): Promise<void> {

[NoCoverage] BlockStatement
src/notifications/infra/notification.repository.typeorm.ts:55:75
     });
   }
 
-  async markAsRead(userId: string, notificationId: string): Promise<void> {
-    const notification = await this.notificationRepository.findOne({
-      where: { id: notificationId, userId },
-    });
-
-    if (!notification) {
-      throw new EntityNotFoundError(
-        `Notification with id ${notificationId} for user ${userId} not found`,
-      );
-    }
-
-    notification.read = true;
-    await this.notificationRepository.save(notification);
-  }
+  async markAsRead(userId: string, notificationId: string): Promise<void> {}
 
   async createMany(notifications: DomainNotification[]): Promise<void> {

[NoCoverage] ObjectLiteral
src/notifications/infra/notification.repository.typeorm.ts:57:14
 
   async markAsRead(userId: string, notificationId: string): Promise<void> {
     const notification = await this.notificationRepository.findOne({
-      where: { id: notificationId, userId },
+      where: {},
     });
 

[NoCoverage] ConditionalExpression
src/notifications/infra/notification.repository.typeorm.ts:60:9
       where: { id: notificationId, userId },
     });
 
-    if (!notification) {
+    if (true) {
       throw new EntityNotFoundError(
         `Notification with id ${notificationId} for user ${userId} not found`,

[NoCoverage] BooleanLiteral
src/notifications/infra/notification.repository.typeorm.ts:60:9
       where: { id: notificationId, userId },
     });
 
-    if (!notification) {
+    if (notification) {
       throw new EntityNotFoundError(
         `Notification with id ${notificationId} for user ${userId} not found`,

[NoCoverage] StringLiteral
src/notifications/infra/notification.repository.typeorm.ts:62:9
 
     if (!notification) {
       throw new EntityNotFoundError(
-        `Notification with id ${notificationId} for user ${userId} not found`,
+        ``,
       );
     }

[NoCoverage] BooleanLiteral
src/notifications/infra/notification.repository.typeorm.ts:66:25
       );
     }
 
-    notification.read = true;
+    notification.read = false;
     await this.notificationRepository.save(notification);
   }

[NoCoverage] BlockStatement
src/notifications/infra/notification.repository.typeorm.ts:70:72
     await this.notificationRepository.save(notification);
   }
 
-  async createMany(notifications: DomainNotification[]): Promise<void> {
-    const persistenceNotifications = notifications.map(
-      NotificationMapper.toPersistence,
-    );
-    await this.notificationRepository.save(persistenceNotifications);
-  }
+  async createMany(notifications: DomainNotification[]): Promise<void> {}
 }
 
