[NoCoverage] BlockStatement
src/users/application/user.controller.ts:29:76
 
   @Public()
   @Post()
-  async create(@Body() createUserDto: CreateUserDto, @Res() res: Response) {
-    const userId = await this.usersService.createUser(
-      createUserDto.firstName,
-      createUserDto.lastName,
-      createUserDto.birthDate,
-      createUserDto.email,
-      createUserDto.password,
-      createUserDto.bio,
-      createUserDto.showAge,
-      createUserDto.showEmail,
-    );
-
-    const locationUrl = `/users/${userId}`;
-    res.status(HttpStatus.CREATED).location(locationUrl).json({ id: userId });
-  }
+  async create(@Body() createUserDto: CreateUserDto, @Res() res: Response) {}
 
   @Patch(':id')

[NoCoverage] BlockStatement
src/users/application/user.controller.ts:50:5
     @Param('id', ParseUUIDPipe) id: string,
     @Body() updateUserDto: UpdateUserDto,
     @Res() res: Response,
-  ) {
-    await this.usersService.updateUser(
-      id,
-      updateUserDto.email,
-      updateUserDto.bio,
-    );
-
-    const locationUrl = `/users/${id}`;
-    res.status(HttpStatus.NO_CONTENT).location(locationUrl).send();
-  }
+  ) {}
 
   @Get(':id')

[NoCoverage] BlockStatement
src/users/application/user.controller.ts:62:79
   }
 
   @Get(':id')
-  async findOne(@Param('id', ParseUUIDPipe) id: string, @Res() res: Response) {
-    const user = await this.usersService.getUserProfile(id);
-
-    const userDto = UserMapper.toProfileDto(user);
-    res.status(HttpStatus.OK).json(userDto);
-  }
+  async findOne(@Param('id', ParseUUIDPipe) id: string, @Res() res: Response) {}
 
   @Post(':id/followers')

[NoCoverage] BlockStatement
src/users/application/user.controller.ts:74:5
     @Param('id', ParseUUIDPipe) id: string,
     @GetUserId() userId: string,
     @Res() res: Response,
-  ) {
-    await this.usersService.followUser(id, userId);
-
-    res.status(HttpStatus.NO_CONTENT).send();
-  }
+  ) {}
 
   @Get(':id/followers')

[NoCoverage] BlockStatement
src/users/application/user.controller.ts:84:5
   async getFollowers(
     @Param('id', ParseUUIDPipe) id: string,
     @Res() res: Response,
-  ) {
-    const followers = await this.usersService.getUserFollowers(id);
-
-    res.status(HttpStatus.OK).json(followers.map(UserMapper.toProfileDto));
-  }
+  ) {}
 }
 
