[Killed] BlockStatement
src/users/domain/User.ts:29:28
 }
 
 export class User extends EntityRoot<UserProps> {
-  get id(): UniqueEntityID {
-    return this._id;
-  }
+  get id(): UniqueEntityID {}
 
   get firstName(): string {
killedBy: UserServiceImpl createUser creates a new user successfully and returns its ID
statusReason: TypeError: Cannot read properties of undefined (reading 'toString')

[Killed] BlockStatement
src/users/domain/User.ts:33:27
     return this._id;
   }
 
-  get firstName(): string {
-    return this.props.firstName;
-  }
+  get firstName(): string {}
 
   get lastName(): string {
killedBy: UserServiceImpl createUser creates a new user successfully and returns its ID
statusReason: MissingPropertiesError: [User] Missing properties to create a new user.

[Killed] BlockStatement
src/users/domain/User.ts:37:26
     return this.props.firstName;
   }
 
-  get lastName(): string {
-    return this.props.lastName;
-  }
+  get lastName(): string {}
 
   get birthDate(): UserBirthDate {
killedBy: UserServiceImpl createUser creates a new user successfully and returns its ID
statusReason: MissingPropertiesError: [User] Missing properties to create a new user.

[Killed] BlockStatement
src/users/domain/User.ts:41:34
     return this.props.lastName;
   }
 
-  get birthDate(): UserBirthDate {
-    return this.props.birthDate;
-  }
+  get birthDate(): UserBirthDate {}
 
   get email(): string {
killedBy: UserServiceImpl createUser creates a new user successfully and returns its ID
statusReason: TypeError: Cannot read properties of undefined (reading 'value')

[Killed] BlockStatement
src/users/domain/User.ts:45:23
     return this.props.birthDate;
   }
 
-  get email(): string {
-    return this.props.email.value;
-  }
+  get email(): string {}
 
   set email(email: string) {
killedBy: UserServiceImpl createUser creates a new user successfully and returns its ID
statusReason: InvalidEmailError: The email "undefined" is not valid

[NoCoverage] BlockStatement
src/users/domain/User.ts:49:28
     return this.props.email.value;
   }
 
-  set email(email: string) {
-    this.props.email = UserEmail.create(email);
-  }
+  set email(email: string) {}
 
   get password(): string {

[Killed] BlockStatement
src/users/domain/User.ts:53:26
     this.props.email = UserEmail.create(email);
   }
 
-  get password(): string {
-    return this.props.password.value;
-  }
+  get password(): string {}
 
   set password(password: UserPassword) {
killedBy: UserServiceImpl createUser creates a new user successfully and returns its ID
statusReason: InvalidPasswordError: The password must be longer than 8 characters and contain at least one symbol, one uppercase letter, one lowercase letter, and one number.

[NoCoverage] BlockStatement
src/users/domain/User.ts:57:40
     return this.props.password.value;
   }
 
-  set password(password: UserPassword) {
-    this.props.password = password;
-  }
+  set password(password: UserPassword) {}
 
   get userPassword(): UserPassword {

[NoCoverage] BlockStatement
src/users/domain/User.ts:61:36
     this.props.password = password;
   }
 
-  get userPassword(): UserPassword {
-    return this.props.password;
-  }
+  get userPassword(): UserPassword {}
 
   get bio(): string {

[Killed] BlockStatement
src/users/domain/User.ts:65:21
     return this.props.password;
   }
 
-  get bio(): string {
-    return this.props.bio ?? 'No bio available';
-  }
+  get bio(): string {}
 
   set bio(bio: string) {
killedBy: User create should create a user with default bio when not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "No bio available"
Received: undefined

[Killed] LogicalOperator
src/users/domain/User.ts:66:12
   }
 
   get bio(): string {
-    return this.props.bio ?? 'No bio available';
+    return this.props.bio && 'No bio available';
   }
 
killedBy: User create should create a user with default bio when not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "No bio available"
Received: undefined

[NoCoverage] BlockStatement
src/users/domain/User.ts:69:24
     return this.props.bio ?? 'No bio available';
   }
 
-  set bio(bio: string) {
-    this.props.bio = bio;
-  }
+  set bio(bio: string) {}
 
   get showAge(): boolean {

[Killed] BlockStatement
src/users/domain/User.ts:73:26
     this.props.bio = bio;
   }
 
-  get showAge(): boolean {
-    return this.props.showAge;
-  }
+  get showAge(): boolean {}
 
   get showEmail(): boolean {
killedBy: UserServiceImpl createUser creates user with default values when optional parameters are not provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"role": "user", "showAge": false, "showEmail": false}

Number of calls: 1

[Killed] BlockStatement
src/users/domain/User.ts:77:28
     return this.props.showAge;
   }
 
-  get showEmail(): boolean {
-    return this.props.showEmail;
-  }
+  get showEmail(): boolean {}
 
   get role(): string {
killedBy: UserServiceImpl createUser creates user with default values when optional parameters are not provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"role": "user", "showAge": false, "showEmail": false}

Number of calls: 1

[Killed] BlockStatement
src/users/domain/User.ts:81:22
     return this.props.showEmail;
   }
 
-  get role(): string {
-    return this.props.role;
-  }
+  get role(): string {}
 
   set role(role: string) {
killedBy: UserServiceImpl createUser creates user with default values when optional parameters are not provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"role": "user", "showAge": false, "showEmail": false}

Number of calls: 1

[NoCoverage] BlockStatement
src/users/domain/User.ts:85:26
     return this.props.role;
   }
 
-  set role(role: string) {
-    this.props.role = role;
-  }
+  set role(role: string) {}
 
   get age(): number {

[NoCoverage] BlockStatement
src/users/domain/User.ts:89:21
     this.props.role = role;
   }
 
-  get age(): number {
-    return this.birthDate.age;
-  }
+  get age(): number {}
 
   get followers(): User[] {

[Killed] BlockStatement
src/users/domain/User.ts:93:27
     return this.birthDate.age;
   }
 
-  get followers(): User[] {
-    return this.props.followers;
-  }
+  get followers(): User[] {}
 
   public static create(props: UserProps, id?: UniqueEntityID): User {
killedBy: User create should initialize empty followers array when not provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] BlockStatement
src/users/domain/User.ts:97:69
     return this.props.followers;
   }
 
-  public static create(props: UserProps, id?: UniqueEntityID): User {
-    const { firstName, lastName, birthDate, email, password } = props;
-    if (!firstName || !lastName || !birthDate || !email || !password) {
-      throw new MissingPropertiesError(
-        '[User] Missing properties to create a new user.',
-      );
-    }
-
-    return new User({ ...props, followers: props.followers ?? [] }, id);
-  }
+  public static create(props: UserProps, id?: UniqueEntityID): User {}
 
   public updateProfile({ email, bio }: { email?: string; bio?: string }): void {
killedBy: User create should create a valid user
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: User

Received value has no prototype
Received value: undefined

[Killed] LogicalOperator
src/users/domain/User.ts:99:9
 
   public static create(props: UserProps, id?: UniqueEntityID): User {
     const { firstName, lastName, birthDate, email, password } = props;
-    if (!firstName || !lastName || !birthDate || !email || !password) {
+    if (!firstName && !lastName || !birthDate || !email || !password) {
       throw new MissingPropertiesError(
         '[User] Missing properties to create a new user.',
killedBy: User create should throw MissingPropertiesError when firstName is missing
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: MissingPropertiesError

Received function did not throw

[Killed] BooleanLiteral
src/users/domain/User.ts:99:9
 
   public static create(props: UserProps, id?: UniqueEntityID): User {
     const { firstName, lastName, birthDate, email, password } = props;
-    if (!firstName || !lastName || !birthDate || !email || !password) {
+    if (firstName || !lastName || !birthDate || !email || !password) {
       throw new MissingPropertiesError(
         '[User] Missing properties to create a new user.',
killedBy: UserServiceImpl createUser creates a new user successfully and returns its ID
statusReason: MissingPropertiesError: [User] Missing properties to create a new user.

[Killed] LogicalOperator
src/users/domain/User.ts:105:44
       );
     }
 
-    return new User({ ...props, followers: props.followers ?? [] }, id);
+    return new User({ ...props, followers: props.followers && [] }, id);
   }
 
killedBy: User create should initialize empty followers array when not provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] ArrayDeclaration
src/users/domain/User.ts:105:63
       );
     }
 
-    return new User({ ...props, followers: props.followers ?? [] }, id);
+    return new User({ ...props, followers: props.followers ?? ["Stryker was here"] }, id);
   }
 
killedBy: User create should initialize empty followers array when not provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] BlockStatement
src/users/domain/User.ts:108:80
     return new User({ ...props, followers: props.followers ?? [] }, id);
   }
 
-  public updateProfile({ email, bio }: { email?: string; bio?: string }): void {
-    if (email && email !== this.email) {
-      this.props.email = UserEmail.create(email);
-    }
-
-    if (bio !== undefined) {
-      this.props.bio = bio.trim() || 'No bio available';
-    }
-  }
+  public updateProfile({ email, bio }: { email?: string; bio?: string }): void {}
 
   public async isValidPassword(password: string): Promise<boolean> {
killedBy: User updateProfile should update email when provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "newemail@example.com"
Received: "john@example.com"

[Killed] LogicalOperator
src/users/domain/User.ts:109:9
   }
 
   public updateProfile({ email, bio }: { email?: string; bio?: string }): void {
-    if (email && email !== this.email) {
+    if (email || email !== this.email) {
       this.props.email = UserEmail.create(email);
     }
killedBy: User updateProfile should update bio when provided
statusReason: InvalidEmailError: The email "undefined" is not valid

[Killed] BlockStatement
src/users/domain/User.ts:109:40
   }
 
   public updateProfile({ email, bio }: { email?: string; bio?: string }): void {
-    if (email && email !== this.email) {
-      this.props.email = UserEmail.create(email);
-    }
+    if (email && email !== this.email) {}
 
     if (bio !== undefined) {
killedBy: User updateProfile should update email when provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "newemail@example.com"
Received: "john@example.com"

[Killed] ConditionalExpression
src/users/domain/User.ts:113:9
       this.props.email = UserEmail.create(email);
     }
 
-    if (bio !== undefined) {
+    if (true) {
       this.props.bio = bio.trim() || 'No bio available';
     }
killedBy: User updateProfile should update email when provided
statusReason: TypeError: Cannot read properties of undefined (reading 'trim')

[Killed] BlockStatement
src/users/domain/User.ts:113:28
       this.props.email = UserEmail.create(email);
     }
 
-    if (bio !== undefined) {
-      this.props.bio = bio.trim() || 'No bio available';
-    }
+    if (bio !== undefined) {}
   }
 
killedBy: User updateProfile should update bio when provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New bio text"
Received: "Some bio"

[Killed] ConditionalExpression
src/users/domain/User.ts:114:24
     }
 
     if (bio !== undefined) {
-      this.props.bio = bio.trim() || 'No bio available';
+      this.props.bio = true;
     }
   }
killedBy: User updateProfile should update bio when provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New bio text"
Received: true

[Killed] LogicalOperator
src/users/domain/User.ts:114:24
     }
 
     if (bio !== undefined) {
-      this.props.bio = bio.trim() || 'No bio available';
+      this.props.bio = bio.trim() && 'No bio available';
     }
   }
killedBy: User updateProfile should update bio when provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New bio text"
Received: "No bio available"

[NoCoverage] BlockStatement
src/users/domain/User.ts:118:68
     }
   }
 
-  public async isValidPassword(password: string): Promise<boolean> {
-    return this.props.password.compare(password);
-  }
+  public async isValidPassword(password: string): Promise<boolean> {}
 
   public followUser(followed: User) {

[Killed] BlockStatement
src/users/domain/User.ts:122:37
     return this.props.password.compare(password);
   }
 
-  public followUser(followed: User) {
-    if (this.equals(followed)) {
-      throw new UserCannotFollowSelfError();
-    }
-    if (followed.props.followers.find((user) => user.equals(this))) {
-      throw new UserAlreadyFollowedError(followed.id.toString());
-    }
-
-    followed.props.followers.push(this);
-    this.apply(
-      new UserFollowedEvent(
-        this.id.toString(),
-        followed.id.toString(),
-        followed.email,
-      ),
-    );
-  }
+  public followUser(followed: User) {}
 }
 
killedBy: User followUser should add user to followers
statusReason: Error: expect(received).toContain(expected) // indexOf

Received array: []

[Killed] BlockStatement
src/users/domain/User.ts:123:32
   }
 
   public followUser(followed: User) {
-    if (this.equals(followed)) {
-      throw new UserCannotFollowSelfError();
-    }
+    if (this.equals(followed)) {}
     if (followed.props.followers.find((user) => user.equals(this))) {
       throw new UserAlreadyFollowedError(followed.id.toString());
killedBy: User followUser should throw UserCannotFollowSelfError when trying to follow self
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: UserCannotFollowSelfError

Received function did not throw

[Killed] ConditionalExpression
src/users/domain/User.ts:123:9
   }
 
   public followUser(followed: User) {
-    if (this.equals(followed)) {
+    if (true) {
       throw new UserCannotFollowSelfError();
     }
killedBy: User followUser should add user to followers
statusReason: UserCannotFollowSelfError: User cannot follow self

[Killed] ConditionalExpression
src/users/domain/User.ts:126:9
     if (this.equals(followed)) {
       throw new UserCannotFollowSelfError();
     }
-    if (followed.props.followers.find((user) => user.equals(this))) {
+    if (false) {
       throw new UserAlreadyFollowedError(followed.id.toString());
     }
killedBy: User followUser should throw UserAlreadyFollowedError when already following
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: UserAlreadyFollowedError

Received function did not throw

[Killed] ConditionalExpression
src/users/domain/User.ts:126:9
     if (this.equals(followed)) {
       throw new UserCannotFollowSelfError();
     }
-    if (followed.props.followers.find((user) => user.equals(this))) {
+    if (true) {
       throw new UserAlreadyFollowedError(followed.id.toString());
     }
killedBy: UserServiceImpl followUser allows one user to follow another user successfully
statusReason: UserAlreadyFollowedError: User with id followed-id is already followed
