[Killed] BlockStatement
src/users/domain/UserBirthDate.ts:12:50
 }
 
 export class UserBirthDate extends ValueObject<UserBirthDateProps> {
-  private constructor(props: UserBirthDateProps) {
-    super(props);
-  }
+  private constructor(props: UserBirthDateProps) {}
 
   get value(): Date {
killedBy: UserServiceImpl createUser creates a new user successfully and returns its ID
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[NoCoverage] BlockStatement
src/users/domain/UserBirthDate.ts:20:21
     return this.props.value;
   }
 
-  get age(): number {
-    return Utils.calculateAge(this.value);
-  }
+  get age(): number {}
 
   public static create(value: Date): UserBirthDate {

[Killed] BlockStatement
src/users/domain/UserBirthDate.ts:24:52
     return Utils.calculateAge(this.value);
   }
 
-  public static create(value: Date): UserBirthDate {
-    if (!(value instanceof Date) || Number.isNaN(value.getTime())) {
-      throw new InvalidDateProvidedError();
-    }
-    if (value > new Date()) {
-      throw new InvalidDateProvidedError();
-    }
-    if (Utils.calculateAge(value) < AGE_OF_MAJORITY) {
-      throw new UnderageUserError(AGE_OF_MAJORITY);
-    }
-    return new UserBirthDate({ value });
-  }
+  public static create(value: Date): UserBirthDate {}
 }
 
killedBy: UserServiceImpl createUser creates a new user successfully and returns its ID
statusReason: MissingPropertiesError: [User] Missing properties to create a new user.

[Killed] LogicalOperator
src/users/domain/UserBirthDate.ts:25:9
   }
 
   public static create(value: Date): UserBirthDate {
-    if (!(value instanceof Date) || Number.isNaN(value.getTime())) {
+    if (!(value instanceof Date) && Number.isNaN(value.getTime())) {
       throw new InvalidDateProvidedError();
     }
killedBy: UserBirthDate create should throw InvalidDateProvidedError for invalid date
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: InvalidDateProvidedError

Received function did not throw

[Killed] BlockStatement
src/users/domain/UserBirthDate.ts:25:68
   }
 
   public static create(value: Date): UserBirthDate {
-    if (!(value instanceof Date) || Number.isNaN(value.getTime())) {
-      throw new InvalidDateProvidedError();
-    }
+    if (!(value instanceof Date) || Number.isNaN(value.getTime())) {}
     if (value > new Date()) {
       throw new InvalidDateProvidedError();
killedBy: UserBirthDate create should throw InvalidDateProvidedError for invalid date
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: InvalidDateProvidedError

Received function did not throw

[Killed] EqualityOperator
src/users/domain/UserBirthDate.ts:28:9
     if (!(value instanceof Date) || Number.isNaN(value.getTime())) {
       throw new InvalidDateProvidedError();
     }
-    if (value > new Date()) {
+    if (value >= new Date()) {
       throw new InvalidDateProvidedError();
     }
killedBy: UserServiceImpl createUser throws UnderageUserError if user is under age
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: UnderageUserError
Received constructor: InvalidDateProvidedError

Received message: "The provided date is invalid."

       97 |         } else {

[Killed] ConditionalExpression
src/users/domain/UserBirthDate.ts:28:9
     if (!(value instanceof Date) || Number.isNaN(value.getTime())) {
       throw new InvalidDateProvidedError();
     }
-    if (value > new Date()) {
+    if (false) {
       throw new InvalidDateProvidedError();
     }
killedBy: UserBirthDate create should throw InvalidDateProvidedError for future dates
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: InvalidDateProvidedError
Received constructor: UnderageUserError

Received message: "User must be at least 18 years old"

      105 |         } else {

[Killed] EqualityOperator
src/users/domain/UserBirthDate.ts:31:9
     if (value > new Date()) {
       throw new InvalidDateProvidedError();
     }
-    if (Utils.calculateAge(value) < AGE_OF_MAJORITY) {
+    if (Utils.calculateAge(value) <= AGE_OF_MAJORITY) {
       throw new UnderageUserError(AGE_OF_MAJORITY);
     }
killedBy: UserBirthDate create should accept user who just turned age of majority today
statusReason: UnderageUserError: User must be at least 18 years old

[Killed] ConditionalExpression
src/users/domain/UserBirthDate.ts:31:9
     if (value > new Date()) {
       throw new InvalidDateProvidedError();
     }
-    if (Utils.calculateAge(value) < AGE_OF_MAJORITY) {
+    if (true) {
       throw new UnderageUserError(AGE_OF_MAJORITY);
     }
killedBy: UserBirthDate create should create a valid UserBirthDate object for an adult
statusReason: UnderageUserError: User must be at least 18 years old

[Killed] ObjectLiteral
src/users/domain/UserBirthDate.ts:34:30
     if (Utils.calculateAge(value) < AGE_OF_MAJORITY) {
       throw new UnderageUserError(AGE_OF_MAJORITY);
     }
-    return new UserBirthDate({ value });
+    return new UserBirthDate({});
   }
 }
killedBy: UserServiceImpl createUser creates a new user successfully and returns its ID
statusReason: InvalidDateProvidedError: The provided date is invalid.
