[NoCoverage] ArrayDeclaration
users/infra/filters/user-domain-exception.filter.ts:53:5
     [EmailAlreadyInUseError, HttpStatus.CONFLICT],
     [EmailUpdateConflictError, HttpStatus.CONFLICT],
     [UserCannotFollowSelfError, HttpStatus.CONFLICT],
-    [UserAlreadyFollowedError, HttpStatus.CONFLICT],
+    [],
     [InvalidDateProvidedError, HttpStatus.BAD_REQUEST],
     [UnderageUserError, HttpStatus.BAD_REQUEST],
