[NoCoverage] BlockStatement
src/users/infra/user.repository.typeorm.ts:19:51
     super();
   }
 
-  save(entity: Domain.User): Promise<Domain.User> {
-    return this.userRepository
-      .save(UserMapper.toPersistence(entity))
-      .then((user) => UserMapper.toDomain(user));
-  }
+  save(entity: Domain.User): Promise<Domain.User> {}
 
   async findById(id: string): Promise<Domain.User> {

[NoCoverage] ArrowFunction
src/users/infra/user.repository.typeorm.ts:22:13
   save(entity: Domain.User): Promise<Domain.User> {
     return this.userRepository
       .save(UserMapper.toPersistence(entity))
-      .then((user) => UserMapper.toDomain(user));
+      .then(() => undefined);
   }
 

[NoCoverage] BlockStatement
src/users/infra/user.repository.typeorm.ts:25:52
       .then((user) => UserMapper.toDomain(user));
   }
 
-  async findById(id: string): Promise<Domain.User> {
-    const user = await this.userRepository.findOne({
-      where: { id },
-      relations: ['followers'],
-    });
-    if (!user) {
-      throw new EntityNotFoundError(`User with id ${id} not found`);
-    }
-    return UserMapper.toDomain(user);
-  }
+  async findById(id: string): Promise<Domain.User> {}
 
   async findByEmail(email: string): Promise<Domain.User> {

[NoCoverage] ArrayDeclaration
src/users/infra/user.repository.typeorm.ts:28:18
   async findById(id: string): Promise<Domain.User> {
     const user = await this.userRepository.findOne({
       where: { id },
-      relations: ['followers'],
+      relations: [],
     });
     if (!user) {

[NoCoverage] BooleanLiteral
src/users/infra/user.repository.typeorm.ts:30:9
       where: { id },
       relations: ['followers'],
     });
-    if (!user) {
+    if (user) {
       throw new EntityNotFoundError(`User with id ${id} not found`);
     }

[NoCoverage] BlockStatement
src/users/infra/user.repository.typeorm.ts:30:16
       where: { id },
       relations: ['followers'],
     });
-    if (!user) {
-      throw new EntityNotFoundError(`User with id ${id} not found`);
-    }
+    if (!user) {}
     return UserMapper.toDomain(user);
   }

[NoCoverage] BlockStatement
src/users/infra/user.repository.typeorm.ts:36:58
     return UserMapper.toDomain(user);
   }
 
-  async findByEmail(email: string): Promise<Domain.User> {
-    const user = await this.userRepository.findOneBy({ email });
-    if (!user) {
-      throw new EntityNotFoundError(`User with email ${email} not found`);
-    }
-    return UserMapper.toDomain(user);
-  }
+  async findByEmail(email: string): Promise<Domain.User> {}
 }
 

[NoCoverage] ConditionalExpression
src/users/infra/user.repository.typeorm.ts:38:9
 
   async findByEmail(email: string): Promise<Domain.User> {
     const user = await this.userRepository.findOneBy({ email });
-    if (!user) {
+    if (false) {
       throw new EntityNotFoundError(`User with email ${email} not found`);
     }

[NoCoverage] ConditionalExpression
src/users/infra/user.repository.typeorm.ts:38:9
 
   async findByEmail(email: string): Promise<Domain.User> {
     const user = await this.userRepository.findOneBy({ email });
-    if (!user) {
+    if (true) {
       throw new EntityNotFoundError(`User with email ${email} not found`);
     }
