[NoCoverage] BlockStatement
common-lib/src/common/ods.ts:126:62
   },
 };
 
-export function mapODSEnumToDetails(ods: ODSEnum): ODSDetail {
-  return {
-    id: ods,
-    title: odsData[ods]?.title || 'Unknown',
-    description: odsData[ods]?.description || 'Description not available',
-  };
-}
+export function mapODSEnumToDetails(ods: ODSEnum): ODSDetail {}
 
 export function mapODSEnumListToDetails(odsList: ODSEnum[]): ODSDetail[] {

[NoCoverage] ConditionalExpression
common-lib/src/common/ods.ts:129:12
 export function mapODSEnumToDetails(ods: ODSEnum): ODSDetail {
   return {
     id: ods,
-    title: odsData[ods]?.title || 'Unknown',
+    title: false,
     description: odsData[ods]?.description || 'Description not available',
   };

[NoCoverage] OptionalChaining
common-lib/src/common/ods.ts:129:12
 export function mapODSEnumToDetails(ods: ODSEnum): ODSDetail {
   return {
     id: ods,
-    title: odsData[ods]?.title || 'Unknown',
+    title: odsData[ods].title || 'Unknown',
     description: odsData[ods]?.description || 'Description not available',
   };

[NoCoverage] ConditionalExpression
common-lib/src/common/ods.ts:130:18
   return {
     id: ods,
     title: odsData[ods]?.title || 'Unknown',
-    description: odsData[ods]?.description || 'Description not available',
+    description: true,
   };
 }

[NoCoverage] LogicalOperator
common-lib/src/common/ods.ts:130:18
   return {
     id: ods,
     title: odsData[ods]?.title || 'Unknown',
-    description: odsData[ods]?.description || 'Description not available',
+    description: odsData[ods]?.description && 'Description not available',
   };
 }

[NoCoverage] BlockStatement
common-lib/src/common/ods.ts:134:74
   };
 }
 
-export function mapODSEnumListToDetails(odsList: ODSEnum[]): ODSDetail[] {
-  return odsList.map(mapODSEnumToDetails);
-}
+export function mapODSEnumListToDetails(odsList: ODSEnum[]): ODSDetail[] {}
 
 export function mapODSEnumSetToNumberArray(

[NoCoverage] BlockStatement
common-lib/src/common/ods.ts:140:18
 
 export function mapODSEnumSetToNumberArray(
   odsSet: Set<ODSEnum> | null,
-): Array<number> {
-  if (!odsSet) {
-    return [];
-  }
-  return Array.from(odsSet).map((value) => Number(value));
-}
+): Array<number> {}
 
 export function mapNumberArrayToODSEnumSet(

[NoCoverage] ConditionalExpression
common-lib/src/common/ods.ts:141:7
 export function mapODSEnumSetToNumberArray(
   odsSet: Set<ODSEnum> | null,
 ): Array<number> {
-  if (!odsSet) {
+  if (false) {
     return [];
   }

[NoCoverage] ConditionalExpression
common-lib/src/common/ods.ts:141:7
 export function mapODSEnumSetToNumberArray(
   odsSet: Set<ODSEnum> | null,
 ): Array<number> {
-  if (!odsSet) {
+  if (true) {
     return [];
   }

[NoCoverage] ArrowFunction
common-lib/src/common/ods.ts:144:33
   if (!odsSet) {
     return [];
   }
-  return Array.from(odsSet).map((value) => Number(value));
+  return Array.from(odsSet).map(() => undefined);
 }
 

[NoCoverage] BlockStatement
common-lib/src/common/ods.ts:149:17
 
 export function mapNumberArrayToODSEnumSet(
   odsArray: Array<number> | null,
-): Set<ODSEnum> {
-  if (!odsArray) {
-    return new Set<ODSEnum>();
-  }
-  return new Set(odsArray.map((value) => value as ODSEnum));
-}
+): Set<ODSEnum> {}
 

[NoCoverage] BlockStatement
common-lib/src/common/ods.ts:150:18
 export function mapNumberArrayToODSEnumSet(
   odsArray: Array<number> | null,
 ): Set<ODSEnum> {
-  if (!odsArray) {
-    return new Set<ODSEnum>();
-  }
+  if (!odsArray) {}
   return new Set(odsArray.map((value) => value as ODSEnum));
 }

[NoCoverage] BooleanLiteral
common-lib/src/common/ods.ts:150:7
 export function mapNumberArrayToODSEnumSet(
   odsArray: Array<number> | null,
 ): Set<ODSEnum> {
-  if (!odsArray) {
+  if (odsArray) {
     return new Set<ODSEnum>();
   }

[NoCoverage] ArrowFunction
common-lib/src/common/ods.ts:153:31
   if (!odsArray) {
     return new Set<ODSEnum>();
   }
-  return new Set(odsArray.map((value) => value as ODSEnum));
+  return new Set(odsArray.map(() => undefined));
 }
 
