[Killed] BlockStatement
src/core/domain/DomainEvent.ts:10:29
 
   public static readonly TOPIC?: string;
 
-  constructor(type: string) {
-    this.type = type;
-    this.date = new Date();
-  }
+  constructor(type: string) {}
 
   public shouldBePublishedExternally(): boolean {
killedBy: User followUser should add user to followers
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"followedUserId": "69f24201-3969-458b-9e02-03f8a6045573", "type": "UserFollowedEvent", "userId": "a505ef6b-2e61-4a67-b2d3-98182289cc97"}
Received: {"followedUserId": "69f24201-3969-458b-9e02-03f8a6045573", "userId": "a505ef6b-2e61-4a67-b2d3-98182289cc97", "userName": "john@example.com"}

Number of calls: 1

[NoCoverage] BlockStatement
src/core/domain/DomainEvent.ts:15:49
     this.date = new Date();
   }
 
-  public shouldBePublishedExternally(): boolean {
-    return !!(this.constructor as typeof DomainEvent).TOPIC;
-  }
+  public shouldBePublishedExternally(): boolean {}
 
   public getTopic(): string | undefined {

[NoCoverage] BooleanLiteral
src/core/domain/DomainEvent.ts:16:13
   }
 
   public shouldBePublishedExternally(): boolean {
-    return !!(this.constructor as typeof DomainEvent).TOPIC;
+    return !(this.constructor as typeof DomainEvent).TOPIC;
   }
 

[NoCoverage] BlockStatement
src/core/domain/DomainEvent.ts:19:41
     return !!(this.constructor as typeof DomainEvent).TOPIC;
   }
 
-  public getTopic(): string | undefined {
-    return (this.constructor as typeof DomainEvent).TOPIC;
-  }
+  public getTopic(): string | undefined {}
 }
 
