[Survived] BlockStatement
src/core/domain/Entity.ts:8:46
 
   protected readonly props: T;
 
-  constructor(props: T, id?: UniqueEntityID) {
-    this._id = id || new UniqueEntityID();
-    this.props = props;
-  }
+  constructor(props: T, id?: UniqueEntityID) {}
 
   public equals(object?: Entity<T>): boolean {

[Survived] ConditionalExpression
src/core/domain/Entity.ts:9:16
   protected readonly props: T;
 
   constructor(props: T, id?: UniqueEntityID) {
-    this._id = id || new UniqueEntityID();
+    this._id = true;
     this.props = props;
   }

[Survived] ConditionalExpression
src/core/domain/Entity.ts:9:16
   protected readonly props: T;
 
   constructor(props: T, id?: UniqueEntityID) {
-    this._id = id || new UniqueEntityID();
+    this._id = false;
     this.props = props;
   }

[NoCoverage] BlockStatement
src/core/domain/Entity.ts:13:46
     this.props = props;
   }
 
-  public equals(object?: Entity<T>): boolean {
-    if (object === null || object === undefined) {
-      return false;
-    }
-
-    if (this === object) {
-      return true;
-    }
-
-    if (!Entity.isEntity(object)) {
-      return false;
-    }
-
-    return this._id.equals(object._id);
-  }
+  public equals(object?: Entity<T>): boolean {}
 
   public static isEntity(v: unknown): v is Entity<unknown> {

[NoCoverage] EqualityOperator
src/core/domain/Entity.ts:14:9
   }
 
   public equals(object?: Entity<T>): boolean {
-    if (object === null || object === undefined) {
+    if (object !== null || object === undefined) {
       return false;
     }

[NoCoverage] ConditionalExpression
src/core/domain/Entity.ts:14:9
   }
 
   public equals(object?: Entity<T>): boolean {
-    if (object === null || object === undefined) {
+    if (true) {
       return false;
     }

[NoCoverage] BooleanLiteral
src/core/domain/Entity.ts:15:14
 
   public equals(object?: Entity<T>): boolean {
     if (object === null || object === undefined) {
-      return false;
+      return true;
     }
 

[NoCoverage] BlockStatement
src/core/domain/Entity.ts:18:26
       return false;
     }
 
-    if (this === object) {
-      return true;
-    }
+    if (this === object) {}
 
     if (!Entity.isEntity(object)) {

[NoCoverage] ConditionalExpression
src/core/domain/Entity.ts:22:9
       return true;
     }
 
-    if (!Entity.isEntity(object)) {
+    if (true) {
       return false;
     }

[NoCoverage] BlockStatement
src/core/domain/Entity.ts:22:35
       return true;
     }
 
-    if (!Entity.isEntity(object)) {
-      return false;
-    }
+    if (!Entity.isEntity(object)) {}
 
     return this._id.equals(object._id);

[NoCoverage] BooleanLiteral
src/core/domain/Entity.ts:23:14
     }
 
     if (!Entity.isEntity(object)) {
-      return false;
+      return true;
     }
 

[NoCoverage] BlockStatement
src/core/domain/Entity.ts:29:60
     return this._id.equals(object._id);
   }
 
-  public static isEntity(v: unknown): v is Entity<unknown> {
-    return v instanceof Entity;
-  }
+  public static isEntity(v: unknown): v is Entity<unknown> {}
 }
 
