[Killed] ConditionalExpression
src/core/domain/EntityRoot.ts:11:16
 
   constructor(props: T, id?: UniqueEntityID) {
     super();
-    this._id = id || new UniqueEntityID();
+    this._id = true;
     this.props = props;
   }
killedBy: UserServiceImpl createUser creates a new user successfully and returns its ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1234"
Received: "true"

[Killed] LogicalOperator
src/core/domain/EntityRoot.ts:11:16
 
   constructor(props: T, id?: UniqueEntityID) {
     super();
-    this._id = id || new UniqueEntityID();
+    this._id = id && new UniqueEntityID();
     this.props = props;
   }
killedBy: UserServiceImpl createUser creates a new user successfully and returns its ID
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1234"
Received: "205f80b2-855f-470b-9745-1585edbe506c"

[Killed] BlockStatement
src/core/domain/EntityRoot.ts:15:50
     this.props = props;
   }
 
-  public equals(object?: EntityRoot<T>): boolean {
-    if (object === null || object === undefined) {
-      return false;
-    }
-
-    if (this === object) {
-      return true;
-    }
-
-    if (!EntityRoot.isEntityRoot(object)) {
-      return false;
-    }
-
-    return this._id.equals(object._id);
-  }
+  public equals(object?: EntityRoot<T>): boolean {}
 
   public static isEntityRoot(v: unknown): v is EntityRoot<unknown> {
killedBy: User followUser should throw UserCannotFollowSelfError when trying to follow self
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: UserCannotFollowSelfError

Received function did not throw

[Killed] EqualityOperator
src/core/domain/EntityRoot.ts:16:9
   }
 
   public equals(object?: EntityRoot<T>): boolean {
-    if (object === null || object === undefined) {
+    if (object !== null || object === undefined) {
       return false;
     }
killedBy: User followUser should throw UserCannotFollowSelfError when trying to follow self
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: UserCannotFollowSelfError

Received function did not throw

[Killed] EqualityOperator
src/core/domain/EntityRoot.ts:16:28
   }
 
   public equals(object?: EntityRoot<T>): boolean {
-    if (object === null || object === undefined) {
+    if (object === null || object !== undefined) {
       return false;
     }
killedBy: User followUser should throw UserCannotFollowSelfError when trying to follow self
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: UserCannotFollowSelfError

Received function did not throw

[NoCoverage] BlockStatement
src/core/domain/EntityRoot.ts:24:43
       return true;
     }
 
-    if (!EntityRoot.isEntityRoot(object)) {
-      return false;
-    }
+    if (!EntityRoot.isEntityRoot(object)) {}
 
     return this._id.equals(object._id);

[Survived] ConditionalExpression
src/core/domain/EntityRoot.ts:24:9
       return true;
     }
 
-    if (!EntityRoot.isEntityRoot(object)) {
+    if (true) {
       return false;
     }

[NoCoverage] BooleanLiteral
src/core/domain/EntityRoot.ts:25:14
     }
 
     if (!EntityRoot.isEntityRoot(object)) {
-      return false;
+      return true;
     }
 

[Survived] BlockStatement
src/core/domain/EntityRoot.ts:31:68
     return this._id.equals(object._id);
   }
 
-  public static isEntityRoot(v: unknown): v is EntityRoot<unknown> {
-    return v instanceof EntityRoot;
-  }
+  public static isEntityRoot(v: unknown): v is EntityRoot<unknown> {}
 }
 
