[Survived] BlockStatement
src/core/domain/Identifier.ts:2:42
 export class Identifier<T> {
-  constructor(private readonly value: T) {
-    this.value = value;
-  }
+  constructor(private readonly value: T) {}
 
   equals(id?: Identifier<T>): boolean {

[Survived] BlockStatement
src/core/domain/Identifier.ts:6:39
     this.value = value;
   }
 
-  equals(id?: Identifier<T>): boolean {
-    if (id === null || id === undefined) {
-      return false;
-    }
-    if (!(id instanceof this.constructor)) {
-      return false;
-    }
-    return id.toValue() === this.value;
-  }
+  equals(id?: Identifier<T>): boolean {}
 
   toString() {

[Survived] ConditionalExpression
src/core/domain/Identifier.ts:7:24
   }
 
   equals(id?: Identifier<T>): boolean {
-    if (id === null || id === undefined) {
+    if (id === null || false) {
       return false;
     }

[Survived] LogicalOperator
src/core/domain/Identifier.ts:7:9
   }
 
   equals(id?: Identifier<T>): boolean {
-    if (id === null || id === undefined) {
+    if (id === null && id === undefined) {
       return false;
     }

[Survived] BooleanLiteral
src/core/domain/Identifier.ts:10:9
     if (id === null || id === undefined) {
       return false;
     }
-    if (!(id instanceof this.constructor)) {
+    if (id instanceof this.constructor) {
       return false;
     }

[Killed] BlockStatement
src/core/domain/Identifier.ts:16:14
     return id.toValue() === this.value;
   }
 
-  toString() {
-    return String(this.value);
-  }
+  toString() {}
 
   toValue(): T {
killedBy: User create should create a user with custom id
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "custom-id"
Received: undefined

[Survived] BlockStatement
src/core/domain/Identifier.ts:20:16
     return String(this.value);
   }
 
-  toValue(): T {
-    return this.value;
-  }
+  toValue(): T {}
 }
 
