[Killed] BlockStatement
src/core/domain/ValueObject.ts:6:25
 export abstract class ValueObject<T> {
   public readonly props: T;
 
-  constructor(props: T) {
-    this.props = Object.freeze(props);
-  }
+  constructor(props: T) {}
 
   public equals(vo?: ValueObject<T>): boolean {
killedBy: UserBirthDate create should create a valid UserBirthDate object for an adult
statusReason: TypeError: Cannot read properties of undefined (reading 'value')

[NoCoverage] BlockStatement
src/core/domain/ValueObject.ts:10:47
     this.props = Object.freeze(props);
   }
 
-  public equals(vo?: ValueObject<T>): boolean {
-    if (vo === null || vo === undefined) {
-      return false;
-    }
-    if (vo.props === undefined) {
-      return false;
-    }
-    return shallowEqual(this.props, vo.props);
-  }
+  public equals(vo?: ValueObject<T>): boolean {}
 }
 

[NoCoverage] LogicalOperator
src/core/domain/ValueObject.ts:11:9
   }
 
   public equals(vo?: ValueObject<T>): boolean {
-    if (vo === null || vo === undefined) {
+    if (vo === null && vo === undefined) {
       return false;
     }

[NoCoverage] BlockStatement
src/core/domain/ValueObject.ts:14:33
     if (vo === null || vo === undefined) {
       return false;
     }
-    if (vo.props === undefined) {
-      return false;
-    }
+    if (vo.props === undefined) {}
     return shallowEqual(this.props, vo.props);
   }
