[NoCoverage] BlockStatement
src/core/exceptions/negative-count.error.ts:12:32
 import { BaseDomainError } from './base-domain.error';
 
 export class NegativeCountError extends BaseDomainError {
-  constructor(message: string) {
-    super(message);
-  }
+  constructor(message: string) {}
 }
 
