[Killed] BlockStatement
src/core/logic/Either.ts:7:25
 export class Left<L, A> {
   readonly value: L;
 
-  constructor(value: L) {
-    this.value = value;
-  }
+  constructor(value: L) {}
 
   // eslint-disable-next-line class-methods-use-this
killedBy: CommunityService createCommunityRequest should return a CommunityNameIsTaken error
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"_value": undefined, "error": {"message": "The community name CommunityA has already been taken."}, "isFailure": true, "isSuccess": false}
Received: undefined

[NoCoverage] BlockStatement
src/core/logic/Either.ts:12:32
   }
 
   // eslint-disable-next-line class-methods-use-this
-  isLeft(): this is Left<L, A> {
-    return true;
-  }
+  isLeft(): this is Left<L, A> {}
 
   // eslint-disable-next-line no-use-before-define, class-methods-use-this

[NoCoverage] BlockStatement
src/core/logic/Either.ts:17:34
   }
 
   // eslint-disable-next-line no-use-before-define, class-methods-use-this
-  isRight(): this is Right<L, A> {
-    return false;
-  }
+  isRight(): this is Right<L, A> {}
 }
 

[Timeout] BlockStatement
src/core/logic/Either.ts:25:25
 export class Right<L, A> {
   readonly value: A;
 
-  constructor(value: A) {
-    this.value = value;
-  }
+  constructor(value: A) {}
 
   // eslint-disable-next-line class-methods-use-this

[NoCoverage] BlockStatement
src/core/logic/Either.ts:30:32
   }
 
   // eslint-disable-next-line class-methods-use-this
-  isLeft(): this is Left<L, A> {
-    return false;
-  }
+  isLeft(): this is Left<L, A> {}
 
   // eslint-disable-next-line class-methods-use-this

[NoCoverage] BlockStatement
src/core/logic/Either.ts:35:34
   }
 
   // eslint-disable-next-line class-methods-use-this
-  isRight(): this is Right<L, A> {
-    return true;
-  }
+  isRight(): this is Right<L, A> {}
 }
 

[Killed] BlockStatement
src/core/logic/Either.ts:40:51
   }
 }
 
-export const left = <L, A>(l: L): Either<L, A> => {
-  return new Left(l);
-};
+export const left = <L, A>(l: L): Either<L, A> => {};
 
 export const right = <L, A>(a: A): Either<L, A> => {
killedBy: CommunityService createCommunityRequest should return a CommunityNameIsTaken error
statusReason: TypeError: Cannot read properties of undefined (reading 'value')

[Killed] BlockStatement
src/core/logic/Either.ts:44:52
   return new Left(l);
 };
 
-export const right = <L, A>(a: A): Either<L, A> => {
-  return new Right<L, A>(a);
-};
+export const right = <L, A>(a: A): Either<L, A> => {};
 
killedBy: CommunityService createCommunityRequest should return the created community request
statusReason: TypeError: Cannot read properties of undefined (reading 'value')
