[Killed] BlockStatement
src/core/logic/Result.ts:11:73
 
   private _value: T;
 
-  public constructor(isSuccess: boolean, error?: T | string, value?: T) {
-    if (isSuccess && error) {
-      throw new Error(
-        'InvalidOperation: A result cannot be successful and contain an error',
-      );
-    }
-    if (!isSuccess && !error) {
-      throw new Error(
-        'InvalidOperation: A failing result needs to contain an error message',
-      );
-    }
-
-    this.isSuccess = isSuccess;
-    this.isFailure = !isSuccess;
-    this.error = error;
-    this._value = value;
-
-    Object.freeze(this);
-  }
+  public constructor(isSuccess: boolean, error?: T | string, value?: T) {}
 
   public getValue(): T {
killedBy: CommunityService createCommunityRequest should return the created community request
statusReason: Error: Can't get the value of an error result. Use 'errorValue' instead.

[NoCoverage] StringLiteral
src/core/logic/Result.ts:14:9
   public constructor(isSuccess: boolean, error?: T | string, value?: T) {
     if (isSuccess && error) {
       throw new Error(
-        'InvalidOperation: A result cannot be successful and contain an error',
+        "",
       );
     }

[Killed] LogicalOperator
src/core/logic/Result.ts:17:9
         'InvalidOperation: A result cannot be successful and contain an error',
       );
     }
-    if (!isSuccess && !error) {
+    if (!isSuccess || !error) {
       throw new Error(
         'InvalidOperation: A failing result needs to contain an error message',
killedBy: CommunityService createCommunityRequest should return the created community request
statusReason: Error: InvalidOperation: A failing result needs to contain an error message

[Killed] BlockStatement
src/core/logic/Result.ts:31:24
     Object.freeze(this);
   }
 
-  public getValue(): T {
-    if (!this.isSuccess) {
-      throw new Error(
-        "Can't get the value of an error result. Use 'errorValue' instead.",
-      );
-    }
-
-    return this._value;
-  }
+  public getValue(): T {}
 
   public errorValue(): T {
killedBy: CommunityService createCommunityRequest should return the created community request
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BooleanLiteral
src/core/logic/Result.ts:32:9
   }
 
   public getValue(): T {
-    if (!this.isSuccess) {
+    if (this.isSuccess) {
       throw new Error(
         "Can't get the value of an error result. Use 'errorValue' instead.",
killedBy: CommunityService createCommunityRequest should return the created community request
statusReason: Error: Can't get the value of an error result. Use 'errorValue' instead.

[NoCoverage] StringLiteral
src/core/logic/Result.ts:34:9
   public getValue(): T {
     if (!this.isSuccess) {
       throw new Error(
-        "Can't get the value of an error result. Use 'errorValue' instead.",
+        "",
       );
     }

[NoCoverage] BlockStatement
src/core/logic/Result.ts:41:26
     return this._value;
   }
 
-  public errorValue(): T {
-    return this.error as T;
-  }
+  public errorValue(): T {}
 
   public static ok<U>(value?: U): Result<U> {

[Killed] BlockStatement
src/core/logic/Result.ts:45:45
     return this.error as T;
   }
 
-  public static ok<U>(value?: U): Result<U> {
-    return new Result<U>(true, null, value);
-  }
+  public static ok<U>(value?: U): Result<U> {}
 
   // eslint-disable-next-line @typescript-eslint/no-explicit-any
killedBy: CommunityService createCommunityRequest should return the created community request
statusReason: TypeError: Cannot read properties of undefined (reading 'getValue')

[NoCoverage] BlockStatement
src/core/logic/Result.ts:50:48
   }
 
   // eslint-disable-next-line @typescript-eslint/no-explicit-any
-  public static fail<U>(error: any): Result<U> {
-    return new Result<U>(false, error);
-  }
+  public static fail<U>(error: any): Result<U> {}
 
   // eslint-disable-next-line @typescript-eslint/no-explicit-any

[NoCoverage] BooleanLiteral
src/core/logic/Result.ts:51:26
 
   // eslint-disable-next-line @typescript-eslint/no-explicit-any
   public static fail<U>(error: any): Result<U> {
-    return new Result<U>(false, error);
+    return new Result<U>(true, error);
   }
 

[NoCoverage] BlockStatement
src/core/logic/Result.ts:55:62
   }
 
   // eslint-disable-next-line @typescript-eslint/no-explicit-any
-  public static combine(results: Result<any>[]): Result<any> {
-    // eslint-disable-next-line no-restricted-syntax
-    for (const result of results) {
-      if (result.isFailure) return result;
-    }
-    return Result.ok();
-  }
+  public static combine(results: Result<any>[]): Result<any> {}
 }
 

[NoCoverage] BlockStatement
src/core/logic/Result.ts:57:35
   // eslint-disable-next-line @typescript-eslint/no-explicit-any
   public static combine(results: Result<any>[]): Result<any> {
     // eslint-disable-next-line no-restricted-syntax
-    for (const result of results) {
-      if (result.isFailure) return result;
-    }
+    for (const result of results) {}
     return Result.ok();
   }

[NoCoverage] ConditionalExpression
src/core/logic/Result.ts:58:11
   public static combine(results: Result<any>[]): Result<any> {
     // eslint-disable-next-line no-restricted-syntax
     for (const result of results) {
-      if (result.isFailure) return result;
+      if (true) return result;
     }
     return Result.ok();

[NoCoverage] ConditionalExpression
src/core/logic/Result.ts:58:11
   public static combine(results: Result<any>[]): Result<any> {
     // eslint-disable-next-line no-restricted-syntax
     for (const result of results) {
-      if (result.isFailure) return result;
+      if (false) return result;
     }
     return Result.ok();
