[NoCoverage] StringLiteral
src/events/domain/CauseSupportedEvent.ts:5:34
 import { DomainEvent } from '@common-lib/common-lib/core/domain/DomainEvent';
 
 export class CauseSupportedEvent extends DomainEvent {
-  public static readonly TOPIC = 'cause-supported';
+  public static readonly TOPIC = "";
 
   constructor(
