[Killed] BlockStatement
src/users/domain/UserEmail.ts:12:23
   private static EMAIL_REGEX =
     /^[a-zA-Z0-9.+_-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/;
 
-  get value(): string {
-    return this.props.value;
-  }
+  get value(): string {}
 
   private static validate(email: string): void {
killedBy: User updateProfile should update email when provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "newemail@example.com"
Received: undefined

[Killed] BlockStatement
src/users/domain/UserEmail.ts:16:48
     return this.props.value;
   }
 
-  private static validate(email: string): void {
-    if (!UserEmail.EMAIL_REGEX.test(email)) {
-      throw new InvalidEmailError(email);
-    }
-  }
+  private static validate(email: string): void {}
 
   public static create(email: string): UserEmail {
killedBy: UserEmail create should throw InvalidEmailError for email without @
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: InvalidEmailError

Received function did not throw

[Killed] BooleanLiteral
src/users/domain/UserEmail.ts:17:9
   }
 
   private static validate(email: string): void {
-    if (!UserEmail.EMAIL_REGEX.test(email)) {
+    if (UserEmail.EMAIL_REGEX.test(email)) {
       throw new InvalidEmailError(email);
     }
killedBy: UserServiceImpl createUser creates a new user successfully and returns its ID
statusReason: InvalidEmailError: The email "test.user@example.com" is not valid

[Killed] ConditionalExpression
src/users/domain/UserEmail.ts:17:9
   }
 
   private static validate(email: string): void {
-    if (!UserEmail.EMAIL_REGEX.test(email)) {
+    if (false) {
       throw new InvalidEmailError(email);
     }
killedBy: UserEmail create should throw InvalidEmailError for email without @
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: InvalidEmailError

Received function did not throw

[Killed] BlockStatement
src/users/domain/UserEmail.ts:22:50
     }
   }
 
-  public static create(email: string): UserEmail {
-    UserEmail.validate(email);
-    return new UserEmail({ value: email.toLowerCase() });
-  }
+  public static create(email: string): UserEmail {}
 }
 
killedBy: UserServiceImpl createUser creates a new user successfully and returns its ID
statusReason: MissingPropertiesError: [User] Missing properties to create a new user.

[Killed] MethodExpression
src/users/domain/UserEmail.ts:24:35
 
   public static create(email: string): UserEmail {
     UserEmail.validate(email);
-    return new UserEmail({ value: email.toLowerCase() });
+    return new UserEmail({ value: email.toUpperCase() });
   }
 }
killedBy: User updateProfile should update email when provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "newemail@example.com"
Received: "NEWEMAIL@EXAMPLE.COM"
