[Killed] BlockStatement
src/communities/exceptions/CommunityNameIsTaken.ts:5:46
 import { Result } from '@common-lib/common-lib/core/logic/Result';
 
 export class CommunityNameIsTaken extends Result<DomainError> {
-  private constructor(communityName: string) {
-    super(false, {
-      message: `The community name ${communityName} has already been taken.`,
-    });
-  }
+  private constructor(communityName: string) {}
 
   public static create(communityName: string): CommunityNameIsTaken {
killedBy: CommunityService createCommunityRequest should return a CommunityNameIsTaken error
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BooleanLiteral
src/communities/exceptions/CommunityNameIsTaken.ts:6:11
 
 export class CommunityNameIsTaken extends Result<DomainError> {
   private constructor(communityName: string) {
-    super(false, {
+    super(true, {
       message: `The community name ${communityName} has already been taken.`,
     });
killedBy: CommunityService createCommunityRequest should return a CommunityNameIsTaken error
statusReason: Error: InvalidOperation: A result cannot be successful and contain an error

[Killed] ObjectLiteral
src/communities/exceptions/CommunityNameIsTaken.ts:6:18
 
 export class CommunityNameIsTaken extends Result<DomainError> {
   private constructor(communityName: string) {
-    super(false, {
-      message: `The community name ${communityName} has already been taken.`,
-    });
+    super(false, {});
   }
 
killedBy: CommunityService createCommunityRequest should return a CommunityNameIsTaken error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 4

- CommunityNameIsTaken {
+ InvalidDateProvided {
    "_value": undefined,

[Killed] BlockStatement
src/communities/exceptions/CommunityNameIsTaken.ts:11:69
     });
   }
 
-  public static create(communityName: string): CommunityNameIsTaken {
-    return new CommunityNameIsTaken(communityName);
-  }
+  public static create(communityName: string): CommunityNameIsTaken {}
 }
 
killedBy: CommunityService createCommunityRequest should return a CommunityNameIsTaken error
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: undefined
Received: {"_value": undefined, "error": {"message": "The provided date is invalid: Wed Jan 22 2025 13:59:36 GMT+0100 (Central European Standard Time)"}, "isFailure": true, "isSuccess": false}
