[Killed] BlockStatement
src/communities/exceptions/CommunityNotFound.ts:5:35
 import { Result } from '@common-lib/common-lib/core/logic/Result';
 
 export class CommunityNotFound extends Result<DomainError> {
-  private constructor(id: string) {
-    super(false, {
-      message: `The community with the id "${id}" does not exist.`,
-    });
-  }
+  private constructor(id: string) {}
 
   public static create(id: string): CommunityNotFound {
killedBy: CommunityService getCommunity should return a CommunityNotFound error
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Survived] ObjectLiteral
src/communities/exceptions/CommunityNotFound.ts:6:18
 
 export class CommunityNotFound extends Result<DomainError> {
   private constructor(id: string) {
-    super(false, {
-      message: `The community with the id "${id}" does not exist.`,
-    });
+    super(false, {});
   }
 

[Survived] BlockStatement
src/communities/exceptions/CommunityNotFound.ts:11:55
     });
   }
 
-  public static create(id: string): CommunityNotFound {
-    return new CommunityNotFound(id);
-  }
+  public static create(id: string): CommunityNotFound {}
 }
 
