[Timeout] BlockStatement
src/users/application/user.service.impl.ts:34:9
     showEmail: boolean,
   ): Promise<string> {
     // Check if the email is already in use
-    try {
-      await this.userRepository.findByEmail(email);
-      // If the email is found, then it is already in use
-      throw new EmailAlreadyInUseError(email);
-    } catch (error) {
+    try {} catch (error) {
       // If the error is not an EntityNotFoundError, then throw it
       if (!(error instanceof EntityNotFoundError)) {

[Killed] BlockStatement
src/users/application/user.service.impl.ts:38:21
       await this.userRepository.findByEmail(email);
       // If the email is found, then it is already in use
       throw new EmailAlreadyInUseError(email);
-    } catch (error) {
-      // If the error is not an EntityNotFoundError, then throw it
-      if (!(error instanceof EntityNotFoundError)) {
-        throw error;
-      }
-    }
+    } catch (error) {}
 
     // Create the new user
killedBy: UserServiceImpl createUser throws EmailAlreadyInUseError if email is already in use
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: EmailAlreadyInUseError
Received constructor: InvalidPasswordError

Received message: "The password must be longer than 8 characters and contain at least one symbol, one uppercase letter, one lowercase letter, and one number."

      80 |         } else {

[Killed] BlockStatement
src/users/application/user.service.impl.ts:40:52
       throw new EmailAlreadyInUseError(email);
     } catch (error) {
       // If the error is not an EntityNotFoundError, then throw it
-      if (!(error instanceof EntityNotFoundError)) {
-        throw error;
-      }
+      if (!(error instanceof EntityNotFoundError)) {}
     }
 
killedBy: UserServiceImpl createUser throws EmailAlreadyInUseError if email is already in use
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: EmailAlreadyInUseError
Received constructor: InvalidPasswordError

Received message: "The password must be longer than 8 characters and contain at least one symbol, one uppercase letter, one lowercase letter, and one number."

      80 |         } else {

[Timeout] ConditionalExpression
src/users/application/user.service.impl.ts:40:11
       throw new EmailAlreadyInUseError(email);
     } catch (error) {
       // If the error is not an EntityNotFoundError, then throw it
-      if (!(error instanceof EntityNotFoundError)) {
+      if (true) {
         throw error;
       }

[Killed] BlockStatement
src/users/application/user.service.impl.ts:68:75
     return savedUser.id.toString();
   }
 
-  async updateUser(id: string, email: string, bio: string): Promise<void> {
-    // Find the existing user
-    const existingUser = await this.userRepository.findById(id);
-
-    // Check if the email is different
-    if (existingUser.email === email) {
-      throw new EmailUpdateConflictError();
-    }
-
-    // Check if the email is already in use
-    try {
-      await this.userRepository.findByEmail(email);
-      // If the email is found, then it is already in use
-      throw new EmailAlreadyInUseError(email);
-    } catch (error) {
-      // If the error is not an EntityNotFoundError, then throw it
-      if (!(error instanceof EntityNotFoundError)) {
-        throw error;
-      }
-    }
-
-    // Update the user
-    existingUser.updateProfile({ email, bio });
-    await this.userRepository.save(existingUser);
-  }
+  async updateUser(id: string, email: string, bio: string): Promise<void> {}
 
   async getUserProfile(id: string): Promise<User> {
killedBy: UserServiceImpl updateUser updates a user profile successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "1234"

Number of calls: 0

[Killed] ConditionalExpression
src/users/application/user.service.impl.ts:73:9
     const existingUser = await this.userRepository.findById(id);
 
     // Check if the email is different
-    if (existingUser.email === email) {
+    if (true) {
       throw new EmailUpdateConflictError();
     }
killedBy: UserServiceImpl updateUser updates a user profile successfully
statusReason: EmailUpdateConflictError: The new email must be different from the current email.

[Killed] EqualityOperator
src/users/application/user.service.impl.ts:73:9
     const existingUser = await this.userRepository.findById(id);
 
     // Check if the email is different
-    if (existingUser.email === email) {
+    if (existingUser.email !== email) {
       throw new EmailUpdateConflictError();
     }
killedBy: UserServiceImpl updateUser updates a user profile successfully
statusReason: EmailUpdateConflictError: The new email must be different from the current email.

[Killed] ConditionalExpression
src/users/application/user.service.impl.ts:84:11
       throw new EmailAlreadyInUseError(email);
     } catch (error) {
       // If the error is not an EntityNotFoundError, then throw it
-      if (!(error instanceof EntityNotFoundError)) {
+      if (false) {
         throw error;
       }
killedBy: UserServiceImpl updateUser throws EmailAlreadyInUseError if email is already used by another user
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ObjectLiteral
src/users/application/user.service.impl.ts:90:32
     }
 
     // Update the user
-    existingUser.updateProfile({ email, bio });
+    existingUser.updateProfile({});
     await this.userRepository.save(existingUser);
   }
killedBy: UserServiceImpl updateUser updates a user profile successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "bio": "Updated bio",
-   "email": "new.email@example.com",

[Killed] BlockStatement
src/users/application/user.service.impl.ts:94:51
     await this.userRepository.save(existingUser);
   }
 
-  async getUserProfile(id: string): Promise<User> {
-    return this.userRepository.findById(id);
-  }
+  async getUserProfile(id: string): Promise<User> {}
 
   async getUserByEmail(email: string): Promise<User> {
killedBy: UserServiceImpl getUserProfile returns the user profile if user exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BlockStatement
src/users/application/user.service.impl.ts:98:54
     return this.userRepository.findById(id);
   }
 
-  async getUserByEmail(email: string): Promise<User> {
-    return this.userRepository.findByEmail(email);
-  }
+  async getUserByEmail(email: string): Promise<User> {}
 
   async followUser(id: string, followerId: string): Promise<void> {
killedBy: UserServiceImpl getUserByEmail returns the user if email exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BlockStatement
src/users/application/user.service.impl.ts:102:67
     return this.userRepository.findByEmail(email);
   }
 
-  async followUser(id: string, followerId: string): Promise<void> {
-    const follower = this.eventPublisher.mergeObjectContext(
-      await this.userRepository.findById(followerId),
-    );
-    const followed = await this.userRepository.findById(id);
-
-    follower.followUser(followed);
-    await this.userRepository.save(followed);
-    follower.commit();
-  }
+  async followUser(id: string, followerId: string): Promise<void> {}
 
   async getUserFollowers(id: string): Promise<User[]> {
killedBy: UserServiceImpl followUser allows one user to follow another user successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "follower-id"

Number of calls: 0

[Killed] BlockStatement
src/users/application/user.service.impl.ts:113:55
     follower.commit();
   }
 
-  async getUserFollowers(id: string): Promise<User[]> {
-    const user = await this.userRepository.findById(id);
-    return user.followers;
-  }
+  async getUserFollowers(id: string): Promise<User[]> {}
 }
 
killedBy: UserServiceImpl getUserFollowers returns list of followers for a given user
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined
