[Killed] BlockStatement
src/users/exceptions/email-already-in-use.error.ts:12:30
 import { BaseDomainError } from '@common-lib/common-lib/core/exceptions/base-domain.error';
 
 export class EmailAlreadyInUseError extends BaseDomainError {
-  constructor(email: string) {
-    super(`Email "${email}" is already in use`);
-  }
+  constructor(email: string) {}
 }
 
killedBy: UserServiceImpl createUser throws EmailAlreadyInUseError if email is already in use
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: EmailAlreadyInUseError
Received constructor: ReferenceError

Received message: "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      60 |     } else {
