[Killed] BlockStatement
src/users/exceptions/email-update-conflict.error.ts:12:17
 import { BaseDomainError } from '@common-lib/common-lib/core/exceptions/base-domain.error';
 
 export class EmailUpdateConflictError extends BaseDomainError {
-  constructor() {
-    super('The new email must be different from the current email.');
-  }
+  constructor() {}
 }
 
killedBy: UserServiceImpl updateUser throws EmailUpdateConflictError if the email is the same as current
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: EmailUpdateConflictError
Received constructor: ReferenceError

Received message: "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      60 |     } else {
