[Killed] BlockStatement
src/users/exceptions/invalid-email.error.ts:4:30
 import { BaseDomainError } from '@common-lib/common-lib/core/exceptions';
 
 export class InvalidEmailError extends BaseDomainError {
-  constructor(email: string) {
-    super(`The email "${email}" is not valid`);
-  }
+  constructor(email: string) {}
 }
 
killedBy: UserEmail create should throw InvalidEmailError for email without @
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: InvalidEmailError
Received constructor: ReferenceError

Received message: "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      53 |     } else {
