[Killed] BlockStatement
src/users/exceptions/user-already-followed.error.ts:4:27
 import { BaseDomainError } from '@common-lib/common-lib/core/exceptions/base-domain.error';
 
 export class UserAlreadyFollowedError extends BaseDomainError {
-  constructor(id: string) {
-    super(`User with id ${id} is already followed`);
-  }
+  constructor(id: string) {}
 }
 
killedBy: User followUser should throw UserAlreadyFollowedError when already following
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: UserAlreadyFollowedError
Received constructor: ReferenceError

Received message: "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      53 |     } else {
