[Killed] BlockStatement
src/users/exceptions/under-age-user.error.ts:12:31
 import { BaseDomainError } from '@common-lib/common-lib/core/exceptions/base-domain.error';
 
 export class UnderageUserError extends BaseDomainError {
-  constructor(minAge: number) {
-    super(`User must be at least ${minAge} years old`);
-  }
+  constructor(minAge: number) {}
 }
 
killedBy: UserServiceImpl createUser throws UnderageUserError if user is under age
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: UnderageUserError
Received constructor: ReferenceError

Received message: "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      60 |     } else {

[Survived] StringLiteral
src/users/exceptions/under-age-user.error.ts:13:11
 
 export class UnderageUserError extends BaseDomainError {
   constructor(minAge: number) {
-    super(`User must be at least ${minAge} years old`);
+    super(``);
   }
 }
