[Killed] BlockStatement
src/users/exceptions/user-cannot-follow-self.error.ts:4:17
 import { BaseDomainError } from '@common-lib/common-lib/core/exceptions/base-domain.error';
 
 export class UserCannotFollowSelfError extends BaseDomainError {
-  constructor() {
-    super(`User cannot follow self`);
-  }
+  constructor() {}
 }
 
killedBy: UserServiceImpl followUser prevents user from following themselves
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: UserCannotFollowSelfError
Received constructor: ReferenceError

Received message: "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      53 |     } else {
