[Killed] BlockStatement
common-lib/src/common/utils.ts:9:48
  */
 
 export class Utils {
-  static calculateAge(birthDate: Date): number {
-    const today = new Date();
-    let age = today.getFullYear() - birthDate.getFullYear();
-    const monthDifference = today.getMonth() - birthDate.getMonth();
-    if (
-      monthDifference < 0 ||
-      (monthDifference === 0 && today.getDate() < birthDate.getDate())
-    ) {
-      age -= 1;
-    }
-    return age;
-  }
+  static calculateAge(birthDate: Date): number {}
 
   static calculateAverage(amount: number, totalAmount: number): number {
killedBy: UserServiceImpl createUser throws UnderageUserError if user is under age
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: UnderageUserError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'id')"

      109 |       user.commit();

[Timeout] ArithmeticOperator
common-lib/src/common/utils.ts:11:15
 export class Utils {
   static calculateAge(birthDate: Date): number {
     const today = new Date();
-    let age = today.getFullYear() - birthDate.getFullYear();
+    let age = today.getFullYear() + birthDate.getFullYear();
     const monthDifference = today.getMonth() - birthDate.getMonth();
     if (

[Killed] ConditionalExpression
common-lib/src/common/utils.ts:14:7
     let age = today.getFullYear() - birthDate.getFullYear();
     const monthDifference = today.getMonth() - birthDate.getMonth();
     if (
-      monthDifference < 0 ||
-      (monthDifference === 0 && today.getDate() < birthDate.getDate())
+      false
     ) {
       age -= 1;
killedBy: UserBirthDate create should reject user who is one day short of age of majority
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: UnderageUserError

Received function did not throw

[Killed] LogicalOperator
common-lib/src/common/utils.ts:14:7
     let age = today.getFullYear() - birthDate.getFullYear();
     const monthDifference = today.getMonth() - birthDate.getMonth();
     if (
-      monthDifference < 0 ||
-      (monthDifference === 0 && today.getDate() < birthDate.getDate())
+      monthDifference < 0 && monthDifference === 0 && today.getDate() < birthDate.getDate()
     ) {
       age -= 1;
killedBy: UserBirthDate create should reject user who is one day short of age of majority
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: UnderageUserError

Received function did not throw

[Killed] EqualityOperator
common-lib/src/common/utils.ts:15:33
     const monthDifference = today.getMonth() - birthDate.getMonth();
     if (
       monthDifference < 0 ||
-      (monthDifference === 0 && today.getDate() < birthDate.getDate())
+      (monthDifference === 0 && today.getDate() <= birthDate.getDate())
     ) {
       age -= 1;
killedBy: Utils should calculate age correctly for birthday today
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 34
Received: 33

[Killed] ConditionalExpression
common-lib/src/common/utils.ts:15:33
     const monthDifference = today.getMonth() - birthDate.getMonth();
     if (
       monthDifference < 0 ||
-      (monthDifference === 0 && today.getDate() < birthDate.getDate())
+      (monthDifference === 0 && true)
     ) {
       age -= 1;
killedBy: Utils should calculate age correctly for birthday today
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 34
Received: 33

[Killed] BlockStatement
common-lib/src/common/utils.ts:16:7
     if (
       monthDifference < 0 ||
       (monthDifference === 0 && today.getDate() < birthDate.getDate())
-    ) {
-      age -= 1;
-    }
+    ) {}
     return age;
   }
killedBy: Utils should calculate age correctly for birthday not yet passed this year
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 33
Received: 34

[Killed] AssignmentOperator
common-lib/src/common/utils.ts:17:7
       monthDifference < 0 ||
       (monthDifference === 0 && today.getDate() < birthDate.getDate())
     ) {
-      age -= 1;
+      age += 1;
     }
     return age;
killedBy: Utils should calculate age correctly for birthday not yet passed this year
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 33
Received: 35

[Killed] BlockStatement
common-lib/src/common/utils.ts:22:72
     return age;
   }
 
-  static calculateAverage(amount: number, totalAmount: number): number {
-    if (totalAmount <= 0) {
-      throw new Error('Total amount must be greater than zero');
-    }
-    return parseFloat(((amount / totalAmount) * 100).toFixed(2));
-  }
+  static calculateAverage(amount: number, totalAmount: number): number {}
 }
 
killedBy: Utils calculateAverage should calculate percentage correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 25
Received: undefined

[Killed] ConditionalExpression
common-lib/src/common/utils.ts:23:9
   }
 
   static calculateAverage(amount: number, totalAmount: number): number {
-    if (totalAmount <= 0) {
+    if (true) {
       throw new Error('Total amount must be greater than zero');
     }
killedBy: Utils calculateAverage should calculate percentage correctly
statusReason: Error: Total amount must be greater than zero

[Killed] ConditionalExpression
common-lib/src/common/utils.ts:23:9
   }
 
   static calculateAverage(amount: number, totalAmount: number): number {
-    if (totalAmount <= 0) {
+    if (false) {
       throw new Error('Total amount must be greater than zero');
     }
killedBy: Utils calculateAverage should throw an error for zero total amount
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Total amount must be greater than zero"

Received function did not throw

[Killed] StringLiteral
common-lib/src/common/utils.ts:24:23
 
   static calculateAverage(amount: number, totalAmount: number): number {
     if (totalAmount <= 0) {
-      throw new Error('Total amount must be greater than zero');
+      throw new Error("");
     }
     return parseFloat(((amount / totalAmount) * 100).toFixed(2));
killedBy: Utils calculateAverage should throw an error for zero total amount
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Total amount must be greater than zero"
Received message:   ""

      82 |         } else {
      83 |           stryCov_9fa48("2035");
    > 84 |           throw new Error(stryMutAct_9fa48("2036") ? "" : (stryCov_9fa48("2036"), 'Total amount must be greater than zero'));

[Killed] ArithmeticOperator
common-lib/src/common/utils.ts:26:25
     if (totalAmount <= 0) {
       throw new Error('Total amount must be greater than zero');
     }
-    return parseFloat(((amount / totalAmount) * 100).toFixed(2));
+    return parseFloat(((amount * totalAmount) * 100).toFixed(2));
   }
 }
killedBy: Utils calculateAverage should calculate percentage correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 25
Received: 250000

[Killed] ArithmeticOperator
common-lib/src/common/utils.ts:26:24
     if (totalAmount <= 0) {
       throw new Error('Total amount must be greater than zero');
     }
-    return parseFloat(((amount / totalAmount) * 100).toFixed(2));
+    return parseFloat((amount / totalAmount / 100).toFixed(2));
   }
 }
killedBy: Utils calculateAverage should calculate percentage correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 25
Received: 0
