[Killed] ConditionalExpression
src/core/domain/UniqueEntityID.ts:6:11
 
 export class UniqueEntityID extends Identifier<string | number> {
   constructor(id?: string | number) {
-    super(id || uuidv4());
+    super(true);
   }
 }
killedBy: User create should create a user with custom id
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "custom-id"
Received: "true"

[Killed] LogicalOperator
src/core/domain/UniqueEntityID.ts:6:11
 
 export class UniqueEntityID extends Identifier<string | number> {
   constructor(id?: string | number) {
-    super(id || uuidv4());
+    super(id && uuidv4());
   }
 }
killedBy: User create should create a user with custom id
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "custom-id"
Received: "65ff0b8d-312a-4bcd-acff-21db11c48212"
