[Killed] BlockStatement
src/core/exceptions/base-domain.error.ts:11:32
  */
 
 export abstract class BaseDomainError extends Error {
-  constructor(message: string) {
-    super(message);
-    this.name = this.constructor.name;
-    // Maintain the correct error trace
-    if (typeof Error.captureStackTrace === 'function') {
-      Error.captureStackTrace(this, this.constructor);
-    }
-  }
+  constructor(message: string) {}
 }
 
killedBy: Equivalence partitioning tests for UserPassword.create Should throw InvalidPasswordError for passwords with less than 8 characters
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: InvalidPasswordError
Received constructor: ReferenceError

Received message: "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      68 |         } else {

[Survived] BlockStatement
src/core/exceptions/base-domain.error.ts:15:56
     super(message);
     this.name = this.constructor.name;
     // Maintain the correct error trace
-    if (typeof Error.captureStackTrace === 'function') {
-      Error.captureStackTrace(this, this.constructor);
-    }
+    if (typeof Error.captureStackTrace === 'function') {}
   }
 }

[Survived] EqualityOperator
src/core/exceptions/base-domain.error.ts:15:9
     super(message);
     this.name = this.constructor.name;
     // Maintain the correct error trace
-    if (typeof Error.captureStackTrace === 'function') {
+    if (typeof Error.captureStackTrace !== 'function') {
       Error.captureStackTrace(this, this.constructor);
     }
