[Killed] BlockStatement
src/core/exceptions/invalid-date-provided.error.ts:12:33
 import { BaseDomainError } from './base-domain.error';
 
 export class InvalidDateProvidedError extends BaseDomainError {
-  constructor(message?: string) {
-    super(message || 'The provided date is invalid.');
-  }
+  constructor(message?: string) {}
 }
 
killedBy: UserBirthDate create should throw InvalidDateProvidedError for invalid date
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: InvalidDateProvidedError
Received constructor: ReferenceError

Received message: "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      60 |     } else {

[Survived] ConditionalExpression
src/core/exceptions/invalid-date-provided.error.ts:13:11
 
 export class InvalidDateProvidedError extends BaseDomainError {
   constructor(message?: string) {
-    super(message || 'The provided date is invalid.');
+    super(false);
   }
 }

[Survived] ConditionalExpression
src/core/exceptions/invalid-date-provided.error.ts:13:11
 
 export class InvalidDateProvidedError extends BaseDomainError {
   constructor(message?: string) {
-    super(message || 'The provided date is invalid.');
+    super(true);
   }
 }
