[Killed] BlockStatement
src/core/exceptions/entity-not-found.error.ts:12:32
 import { BaseDomainError } from './base-domain.error';
 
 export class EntityNotFoundError extends BaseDomainError {
-  constructor(message: string) {
-    super(message);
-  }
+  constructor(message: string) {}
 }
 
killedBy: UserServiceImpl createUser creates a new user successfully and returns its ID
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor
