[Killed] BlockStatement
src/core/exceptions/missing-properties.error.ts:12:32
 import { BaseDomainError } from './base-domain.error';
 
 export class MissingPropertiesError extends BaseDomainError {
-  constructor(message: string) {
-    super(message);
-  }
+  constructor(message: string) {}
 }
 
killedBy: User create should throw MissingPropertiesError when firstName is missing
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: MissingPropertiesError
Received constructor: ReferenceError

Received message: "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      60 |     } else {
