[NoCoverage] BlockStatement
api-gateway/src/middlewares/actions-proxy.middleware.ts:8:35
 
 @Injectable()
 export class ActionsProxyMiddleware extends ProxyMiddleware {
-  protected getOptions(): Options {
-    return {
-      target: envs.actionsUrl,
-      pathRewrite: { '^/api/v1/actions': '/' },
-      changeOrigin: true,
-    };
-  }
+  protected getOptions(): Options {}
 }
 

[NoCoverage] ObjectLiteral
api-gateway/src/middlewares/actions-proxy.middleware.ts:9:12
 @Injectable()
 export class ActionsProxyMiddleware extends ProxyMiddleware {
   protected getOptions(): Options {
-    return {
-      target: envs.actionsUrl,
-      pathRewrite: { '^/api/v1/actions': '/' },
-      changeOrigin: true,
-    };
+    return {};
   }
 }

[NoCoverage] BooleanLiteral
api-gateway/src/middlewares/actions-proxy.middleware.ts:12:21
     return {
       target: envs.actionsUrl,
       pathRewrite: { '^/api/v1/actions': '/' },
-      changeOrigin: true,
+      changeOrigin: false,
     };
   }
