[NoCoverage] ConditionalExpression
src/communities/application/community.controller.ts:417:9
       communityId,
     );
 
-    if (isCommunityAdmin === false) {
+    if (true) {
       res.status(HttpStatus.UNAUTHORIZED);
       res.json({

[NoCoverage] ConditionalExpression
src/communities/application/community.controller.ts:442:7
 
     // Create the paginated response
     const response = new PaginatedResponseDto(
-      data.length > 0 ? data.map(JoinCommunityRequestMapper.toDto) : [],
+      true ? data.map(JoinCommunityRequestMapper.toDto) : [],
       total,
       page,

[NoCoverage] EqualityOperator
src/communities/application/community.controller.ts:442:7
 
     // Create the paginated response
     const response = new PaginatedResponseDto(
-      data.length > 0 ? data.map(JoinCommunityRequestMapper.toDto) : [],
+      data.length >= 0 ? data.map(JoinCommunityRequestMapper.toDto) : [],
       total,
       page,

[NoCoverage] ObjectLiteral
src/communities/application/community.controller.ts:471:16
 
     if (isCommunityAdmin === false) {
       res.status(HttpStatus.UNAUTHORIZED);
-      res.json({
-        errors: {
-          message: `The user with ID ${userId} is not an admin of the community with ID ${communityId}.`,
-        },
-      });
+      res.json({});
       res.send();
       return;

[NoCoverage] ObjectLiteral
src/communities/application/community.controller.ts:504:16
 
       // Return the request
       res.status(HttpStatus.OK);
-      res.json({
-        data: JoinCommunityRequestMapper.toDto(request),
-      });
+      res.json({});
       res.send();
     }

[NoCoverage] ObjectLiteral
src/communities/application/community.controller.ts:555:20
           return;
         case Exceptions.CommentIsMandatory:
           res.status(HttpStatus.BAD_REQUEST);
-          res.json({ errors: { message: error.errorValue().message } });
+          res.json({});
           res.send();
           return;
