[Killed] BlockStatement
src/users/application/user.service.impl.ts:68:75
     return savedUser.id.toString();
   }
 
-  async updateUser(id: string, email: string, bio: string): Promise<void> {
-    // Find the existing user
-    const existingUser = await this.userRepository.findById(id);
-    // Check if the email is different
-    if (existingUser.email === email) {
-      throw new EmailUpdateConflictError();
-    }
-
-    // Check if the email is already in use
-    try {
-      await this.userRepository.findByEmail(email);
-      // If the email is found, then it is already in use
-      throw new EmailAlreadyInUseError(email);
-    } catch (error) {
-      // If the error is not an EntityNotFoundError, then throw it
-      if (!(error instanceof EntityNotFoundError)) {
-        throw error;
-      }
-    }
-
-    // Update the user
-    existingUser.updateProfile({ email, bio });
-    await this.userRepository.save(existingUser);
-  }
+  async updateUser(id: string, email: string, bio: string): Promise<void> {}
 
   async getUserProfile(id: string): Promise<User> {
killedBy: UserServiceImpl updateUser updates a user profile successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "1234"

Number of calls: 0

[Killed] BlockStatement
src/users/application/user.service.impl.ts:72:39
     // Find the existing user
     const existingUser = await this.userRepository.findById(id);
     // Check if the email is different
-    if (existingUser.email === email) {
-      throw new EmailUpdateConflictError();
-    }
+    if (existingUser.email === email) {}
 
     // Check if the email is already in use
killedBy: UserServiceImpl updateUser throws EmailUpdateConflictError if the email is the same as current
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: EmailUpdateConflictError
Received constructor: EmailAlreadyInUseError

Received message: "Email \"same.email@example.com\" is already in use"

      137 |           await this.userRepository.findByEmail(email);
