[NoCoverage] BlockStatement
api-gateway/src/middlewares/communities-docs-proxy.middleware.ts:7:26
 
 @Injectable()
 export class CommunitiesDocsProxyMiddleware extends ProxyMiddleware {
-  protected getOptions() {
-    return {
-      target: envs.communitiesDocsUrl,
-      pathRewrite: {
-        '^/api/v1/doc/communities': '/',
-      },
-      changeOrigin: true,
-    };
-  }
+  protected getOptions() {}
 }
 

[NoCoverage] ObjectLiteral
api-gateway/src/middlewares/communities-docs-proxy.middleware.ts:10:20
   protected getOptions() {
     return {
       target: envs.communitiesDocsUrl,
-      pathRewrite: {
-        '^/api/v1/doc/communities': '/',
-      },
+      pathRewrite: {},
       changeOrigin: true,
     };
