[NoCoverage] BlockStatement
api-gateway/src/middlewares/users-docs-proxy.middleware.ts:7:26
 
 @Injectable()
 export class UsersDocsProxyMiddleware extends ProxyMiddleware {
-  protected getOptions() {
-    return {
-      target: envs.usersDocsUrl,
-      pathRewrite: {
-        '^/api/v1/doc/users': '/',
-      },
-      changeOrigin: true,
-    };
-  }
+  protected getOptions() {}
 }
 
