[NoCoverage] BlockStatement
apps/statistics-ms/src/statistics-ms.event-listener.controller.ts:30:75
   ) {}
 
   @EventPattern(CommunityCreatedEvent.TOPIC)
-  async handleCommunityCreated(@Payload() message: CommunityCreatedEvent) {
-    this.logger.log(
-      `Community created event handled: ${JSON.stringify(message)}`,
-    );
-
-    // CommunityReports and PlatformStatistics logic
-    await Promise.all([
-      this.communityReportsService.registerCommunityCreation(
-        message.communityId,
-        message.name,
-        message.adminId,
-      ),
-      this.communityStatisticsService.registerCommunityCreation(
-        message.communityId,
-        message.name,
-      ),
-    ]);
-  }
+  async handleCommunityCreated(@Payload() message: CommunityCreatedEvent) {}
 
   @EventPattern(UserJoinedCommunity.TOPIC)

[NoCoverage] ArrayDeclaration
apps/statistics-ms/src/statistics-ms.event-listener.controller.ts:36:23
     );
 
     // CommunityReports and PlatformStatistics logic
-    await Promise.all([
-      this.communityReportsService.registerCommunityCreation(
-        message.communityId,
-        message.name,
-        message.adminId,
-      ),
-      this.communityStatisticsService.registerCommunityCreation(
-        message.communityId,
-        message.name,
-      ),
-    ]);
+    await Promise.all([]);
   }
 
