[NoCoverage] StringLiteral
src/history/application/history-events.controller.ts:55:7
       message.date,
     );
     this.logger.log(
-      `Join community request created event handled: User ${message.userId} requested to join community ${message.communityId}`,
+      ``,
     );
   }
