[NoCoverage] ConditionalExpression
src/history/application/history.controller.ts:34:7
     @Res() res: Response,
   ) {
     if (
-      historyOwner !== userId &&
-      !(await this.historyService.userHasJoinCommunityRequestWithAdmin(
-        historyOwner,
-        userId,
-      ))
+      true
     ) {
       throw new ForbiddenException(

[NoCoverage] StringLiteral
src/history/application/history.controller.ts:41:9
       ))
     ) {
       throw new ForbiddenException(
-        `You are not allowed to see the history of user: ${historyOwner}`,
+        ``,
       );
     }
