[NoCoverage] ConditionalExpression
src/notifications/application/notification.controller.ts:34:9
     @Req() req: Request,
     @Res() res: Response,
   ) {
-    if (requestingUserId !== userId) {
+    if (false) {
       throw new ForbiddenException(
         'You do not have permission to view this user notifications',

[NoCoverage] StringLiteral
src/notifications/application/notification.controller.ts:36:9
   ) {
     if (requestingUserId !== userId) {
       throw new ForbiddenException(
-        'You do not have permission to view this user notifications',
+        "",
       );
     }
