[NoCoverage] StringLiteral
src/users/application/user.controller.ts:43:25
       createUserDto.showEmail,
     );
 
-    const locationUrl = `/users/${userId}`;
+    const locationUrl = ``;
     res.status(HttpStatus.CREATED).location(locationUrl).json({ id: userId });
   }

[NoCoverage] StringLiteral
src/users/application/user.controller.ts:60:25
       updateUserDto.bio,
     );
 
-    const locationUrl = `/users/${id}`;
+    const locationUrl = ``;
     res.status(HttpStatus.NO_CONTENT).location(locationUrl).send();
   }
