[Timeout] BlockStatement
src/core/domain/EntityRoot.ts:9:46
 
   protected readonly props: T;
 
-  constructor(props: T, id?: UniqueEntityID) {
-    super();
-    this._id = id || new UniqueEntityID();
-    this.props = props;
-  }
+  constructor(props: T, id?: UniqueEntityID) {}
 
   public equals(object?: EntityRoot<T>): boolean {
